{"name": "Fer-de-Lance", "overview_text": "The Fer-de-Lance is outstanding in its role as a combat vessel. Its damage output is among the highest of all medium sized ships thanks to its high number of hardpoints including one Class 4, which have excellent convergence when firing allowing the use of fixed mounts on all of them. Among medium sized ships, only the Federal Gunship, Python, Krait Mk II, and Mamba can compete with the Fer-de-Lance in terms of firepower, although the Fer-de-Lance is more manoeuvrable, meaning in practice it is usually more capable of dishing out damage than the others. This does not take Ship-Launched Fighters into consideration, a capability that the Federal Gunship and Krait Mk II possess while the Fer-de-Lance does not. The Fer-de-Lance is also less agile than the Alliance Chieftain and Federal Assault Ship, but still has the advantage in firepower over them.\nIn combat, the Fer-de-Lance excels against all opponents, from larger ships to Thargoid Interceptors. It is widely considered one of the best ships for taking on skilled human pilots, more so than the Anaconda and Federal Corvette. The Imperial Cutter only poses a challenge to the Fer-de-Lance due to the Cutter's superior firepower and shielding, but the Fer-de-Lance still has the advantage in speed and agility.\nThe Fer-de-Lance is reliant on its shield for defence. Its base shield is by far the highest of all medium sized ships, and it has 6 utility mounts compared to the average 4 on most medium sized ships, allowing it to install more Shield Boosters for even more protection (since shield boosters increase shield by percentages, they are also more effective on the Fer-de-Lance than on ships with lesser shields). The result is that Fer-de-Lance builds can exceed 1000MJ of shield even without engineering, but with engineering it can reach over 2000MJ. The Fer-de-lance's armour is comparably mediocre, as its base armour is not quite as durable as the Federal ships, the Alliance ships, or the Python, and its abysmal optional internal compartments leave little room for Hull or Module Reinforcement Packages.\nThe Fer-de-Lance's sole weakness in combat is its low mass lock factor of 12, meaning it will not be able to mass lock any medium combat ships aside from itself and the Mamba, or any large ships other than the Imperial Clipper. Consequently, the Fer-de-Lance makes for a poor pirating vessel since, in addition to its limited cargo capacity, it is relatively easy for most other ship models to either escape from it or interdict it.\nThe Fer-de-Lance is specialized in its role as a fighter and is virtually unusable in any other role. Its jump range falls just short of 21 ly without engineering, the fourth lowest of all available ships, making it one of the least suitable vessels for exploration. It cannot effectively chase targets across the bubble or hunt down bounties, and will have serious trouble jumping away to the nearest Interstellar Factor to clear its own bounties. It has a cargo capacity of 70t max, which is extremely poor for its price and size, making it an unsuitable ship for pirating, trading, and mining. The Fer-de-Lance is essentially a bigger Vulture; unbeaten in combat potential for its size but is terrible in every other role. The ship therefore is perfect for Bounty Hunters and can rack up profits in Resource Extraction Sites very quickly.\nThe Fer-De-Lance has a relatively low heat signature, and is well-suited for both shielded (using a shield cell does not result in a major overheating, and the strong base shielding can be improved further with shield boosters) and shieldless stealth builds (small heat output, durable hull and the ability to mount several heat sinks without sacrificing other utility modules allowing for prolonged silent running).\nThe weapon hardpoints are located as follows: two top mounted Class 2 hardpoints on the nose, about a quarter of the way back from the tip, two side mounted Class 2 hardpoints, at about the ship's midpoint, and a single bottom mounted Class 4 hardpoint in the centre of the ship's frame. Four out of six utility mounts are located around the huge hardpoint on the bottom, with the other two being behind the cockpit, next to the fins on top of the vessel.\nThe pilot's seat of the Fer-de-Lance is to the right of the centre of the ship, having the co-pilot's to the left and slightly further back. The canopy glass offers a phenomenal field of view, having more than 90 degrees vertically, and more than 180 degrees horizontally.\nThe Fer-De-Lance has different heat radiator animations for general heat dissipation and Frame Shift Drive charge up for hyperspace. While both feature the animation of the same yellow/orange lighted radiators, the Frame Shift Drive charging animation also features blue lighted radiators and two blue beams. The blue beams are projected from slightly behind the cockpit and are visible from the cockpit from the side windows on both sides.\nMost purchase locations change in the dynamic galaxy. There are only two stations guaranteed to have stock. Use a database network site like inara to find a purchase location near you.\nAll ships are highly customisable through the Outfitting menu of Station Services. Listed below is the default load-out for the Fer-de-Lance.\n", "infobox": {"overview": {"manufacturer": "Zorgon Peterson", "years_produced": "3100-Present", "ship_type": "Combat", "cost": "51,567,040 CR", "insurance": "2,578,352 CR", "expansion": "N/A"}, "specifications": {"hangar_type": "N/A", "landing_pad_size": "Medium", "dimensions": "73.6m x 51.6m x 15.4m", "pilot_seats": "2", "multicrew": "Yes", "fighter_hangar": "No", "hull_mass": "250 t", "mass_lock_factor": "12", "armour": "405", "armour_hardness": "70", "shields": "271 MJ", "heat_capacity": "224", "fuel_capacity": "8 t", "manoeuvrability": "4", "top_speed": "265 m/s (default) 302 m/s (upgraded) ", "boost_speed": "357 m/s (default) 407 m/s (upgraded) ", "unladen_jump_range": "7.04 ly (default) 20.94 ly (upgraded) ", "cargo_capacity": "24 t (default) 72 t (max) "}, "outfitting": {"hardpoints": "6x Utility Mounts 4x Medium Hardpoints 1x Huge Hardpoint ", "internal_compartments": "2x Class 1 Compartments 1x Class 2 Compartment 2x Class 4 Compartments 1x Class 5 Compartment ", "reserved_compartments": "N/A"}, "hardpoints": null}, "outfitting": {"small_hardpoint": [], "medium_hardpoint": [{"default_system": "Pulse Laser", "default_rating": "F", "default_class": "1", "max_class": "2\n"}, {"default_system": "Pulse Laser", "default_rating": "F", "default_class": "1", "max_class": "2\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "2\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "2\n"}], "large_hardpoint": [], "utility_mount": [{"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}], "bulkhead": {"default_system": "Lightweight Alloys", "default_rating": "I", "default_class": "1", "max_class": "8"}, "reactor_bay": {"default_system": "Power Plant", "default_rating": "E", "default_class": "6", "max_class": "6"}, "thrusters_mounting": {"default_system": "Thrusters", "default_rating": "E", "default_class": "5", "max_class": "5"}, "frame_shift_drive_housing": {"default_system": "Frame Shift Drive", "default_rating": "E", "default_class": "4", "max_class": "4"}, "environment_control": null, "power_coupling": {"default_system": "Power Distributor", "default_rating": "E", "default_class": "6", "max_class": "6"}, "sensor_suite": {"default_system": "Sensors", "default_rating": "E", "default_class": "4", "max_class": "4"}, "fuel_store": {"default_system": "Fuel Tank", "default_rating": "C", "default_class": "3", "max_class": "3"}, "internal_compartments": [{"default_system": "Cargo Rack [x16]", "default_rating": "E", "default_class": "4", "max_class": "5\n"}, {"default_system": "Shield Generator", "default_rating": "E", "default_class": "4", "max_class": "4\n"}, {"default_system": "Cargo Rack [x8]", "default_rating": "E", "default_class": "3", "max_class": "4\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "2\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "1\n"}, {"default_system": "Supercruise Assist", "default_rating": "E", "default_class": "1", "max_class": "1\n"}, {"default_system": "(PAS)", "default_rating": "I", "default_class": "1", "max_class": "1\n"}]}}