{"name": "XG7 Trident", "overview_text": "In contrast with human-manufactured Ship-Launched Fighters, the XG7 Trident is an all-rounder that relies on its unique Guardian weaponry. It is slightly slower than the F63 Condor, slightly less manoeuvrable than the Gu-97, and has significantly less armour than the Taipan, but its damage output is substantial, especially against Thargoid craft.\nThe Trident's fully automatic Plasma Autocannon is an energy weapon with the lowest damage-per-shot (8) of all three Guardian hybrid fighters, but deals absolute damage, making it effective against both shields and hull. The weapon can fire for relatively long periods of time without overheating due to the Trident's lower heat generation. \nThe Trident is the most effective of the Guardian hybrid fighters against individual, particularly-strong human ships. While it deals lower overall damage than human Ship-Launched Fighter models, its Plasma Autocannon's absolute damage gives it a clear advantage against any ship with average resistances that are greater than 35%. This makes the Trident an ideal choice when confronting challenging targets.\nBe aware that during combat against a Thargoid Interceptor, its Thargon Swarms will prioritise any Ship-Launched Fighters in the area and quickly destroy them. Eliminate as many Thargon Swarms as possible before deploying a SLF to allow it focus on Thargoid ships unimpeded.\nThe XG7 Trident can be permanently unlocked for purchase by providing the following Materials to a Guardian Technology Broker:\n", "infobox": {"overview": {"manufacturer": "Ram Tah", "years_produced": "3304-Present", "ship_type": "Ship-Launched Fighter", "cost": "15,270 CR", "insurance": "N/A", "expansion": "Elite Dangerous: Horizons"}, "specifications": {"hangar_type": "N/A", "landing_pad_size": "N/A", "dimensions": "8.6m x 19.8m x 17.2m", "pilot_seats": "N/A", "multicrew": "N/A", "fighter_hangar": "N/A", "hull_mass": "N/A", "mass_lock_factor": "N/A", "armour": "10", "armour_hardness": "N/A", "shields": "30 MJ", "heat_capacity": "N/A", "fuel_capacity": "N/A", "manoeuvrability": "N/A", "top_speed": "316 m/s", "boost_speed": "541 m/s", "unladen_jump_range": "N/A", "cargo_capacity": "N/A"}, "outfitting": null, "hardpoints": {"utility_mount": "0", "weapon_mounts": "3"}}, "outfitting": null}