{"name": "Adder", "overview_text": "The Adder is a versatile multirole ship that can take on a variety of roles when outfitted correctly, due to its high cargo capacity and good combat efficiency. It can be considered an upgraded Hauler, and even has a very similar appearance.\nAs a trader, the Adder is the best ship available until the Cobra Mk III becomes an option. With 26T of space available when unshielded it can make a decent profit from selling cargo and can complete most trading missions. Unlike the Hauler, it also retains good combat efficiency and has decent armor for its price; letting it tank hits. Finally, it has good maneuverability, allowing it to dodge an interdiction with ease, and it is capable of mass locking several small ships.\nAs a combat vessel, the Adder is surprisingly effective in the role. When compared to the Eagle, the Adder is less agile but has far better shielding, an additional utility slot, better armor, and a Class 2 hardpoint, giving it the advantage in both durability and firepower. However, the Adder's damage potential pales in comparison to the Viper Mk III. For this reason, it is better suited for mixed-combat roles such as piracy. The Adder's Class 2 hardpoint serves it well in a variety of combat loadouts, and is of sufficient size to fit several Powerplay weapons. The main weakness of the Adder when outfitting it for combat is its undersized Class 2 Power Distributor, which hampers the performance of power-hungry weapons like lasers, Railguns, and Plasma Accelerators. This can be circumvented by using kinetic weapons instead, but these can run out of ammunition, which requires restocking ammo at a station or having the necessary materials on hand to synthesize more on the fly. An optimal compromise would be to install a mix of kinetic and energy weapons. As the Adder has an excellent hardpoint convergence, a fixed or fixed-gimballed loadout is most effective.\nWhile the Adder's hardpoints do have a wide firing-arc which would benefit turreted weapons, it is not advisable to install them. Turrets severely limit the damage output, and are not needed on a ship as maneuverable as the Adder.\nAs a miner, the Adder is the best ship available at its price range and will do very well until the Cobra Mk III can be afforded. Its Class 2 hardpoint allows it to mount a Class 2 Mining Laser, and combined with two Class 1 Mining Lasers in the smaller hardpoints, it can achieve a very efficient mining speed. The Adder also has a respectable amount of compartment space, enough to carry a decent amount of ores.\nFor exploration, the Adder can achieve a maximum jump range of about 32 LY before engineering. While this is less than the Hauler, keep in mind the Adder has a larger Class 3 Frame Shift Drive, meaning mass from modules and cargo has less of an impact on jump range. Thus, the Adder is an appealing ship for long-range or Rare Goods trading or deep-space mining. The Adder's larger Fuel Tank and capacity for a larger Fuel Scoop allow it to make more jumps before it needs to refuel, and also shortens refueling times. This makes it an acceptable option for long-distance travel using the Neutron Highway.\nThe Adder's inexpensiveness and respectable general-purpose capabilities make it a rugged, attractive craft, especially for newer commanders. Unlike many other ships, the Adder has few notable downsides and can take on any role, especially trading and exploration, more than adequately.\nThe weapon hardpoints are located as follows: two Class 1 hardpoints on the underside of the ship, and one Class 2 hardpoint on the top of the ship behind the cockpit. Additionally, the wings exhibit a small hinge which allows them to fold inwards when the landing gear is deployed, reducing its landing profile. The primary pilot seat is offset to the right of the centerline, and a secondary pilot seat is adjacent to it, making the Adder compatible with Multicrew. Notably, the Adder is the only ship that uses Class 3 Thrusters and has Multicrew functionality; when equipped with Class 3 Enhanced Performance Thrusters, the largest size of the module available, it can achieve impressive speeds and be used as a Multicrew racing ship.\nMore purchase locations can be found on Inara.cz\nAll ships are highly customisable through the Outfitting menu of Station Services. Listed below is the default load-out for the Adder.\n", "infobox": {"overview": {"manufacturer": "Zorgon Peterson", "years_produced": "2914-Present", "ship_type": "Multirole", "cost": "87,808 CR", "insurance": "4,390 CR", "expansion": "N/A"}, "specifications": {"hangar_type": "N/A", "landing_pad_size": "Small", "dimensions": "31.5m x 28.8m x 9.6m", "pilot_seats": "2", "multicrew": "Yes", "fighter_hangar": "No", "hull_mass": "35 t", "mass_lock_factor": "7", "armour": "162", "armour_hardness": "35", "shields": "78 MJ", "heat_capacity": "170", "fuel_capacity": "8 t", "manoeuvrability": "4", "top_speed": "220 m/s (default) 255 m/s (upgraded) ", "boost_speed": "321 m/s (default) 372 m/s (upgraded) ", "unladen_jump_range": "9.12 ly (default) 32.96 ly (upgraded) ", "cargo_capacity": "6 t (default) 30 t (max) "}, "outfitting": {"hardpoints": "2x Utility Mounts 2x Small Hardpoints 1x Medium Hardpoint ", "internal_compartments": "3x Class 1 Compartments 2x Class 2 Compartments 2x Class 3 Compartments ", "reserved_compartments": "N/A"}, "hardpoints": null}, "outfitting": {"small_hardpoint": [{"default_system": "Pulse Laser (L)", "default_rating": "F", "default_class": "1", "max_class": "1\n"}, {"default_system": "Pulse Laser (L)", "default_rating": "F", "default_class": "1", "max_class": "1\n"}], "medium_hardpoint": [], "large_hardpoint": [], "utility_mount": [{"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}], "bulkhead": {"default_system": "Lightweight Alloys", "default_rating": "I", "default_class": "1", "max_class": "8"}, "reactor_bay": {"default_system": "Power Plant", "default_rating": "E", "default_class": "3", "max_class": "3"}, "thrusters_mounting": {"default_system": "Thrusters", "default_rating": "E", "default_class": "3", "max_class": "3"}, "frame_shift_drive_housing": {"default_system": "Frame Shift Drive", "default_rating": "E", "default_class": "3", "max_class": "3"}, "environment_control": {"default_system": "Life Support", "default_rating": "E", "default_class": "1", "max_class": "1"}, "power_coupling": {"default_system": "Power Distributor", "default_rating": "E", "default_class": "2", "max_class": "2"}, "sensor_suite": {"default_system": "Sensors", "default_rating": "E", "default_class": "3", "max_class": "3"}, "fuel_store": {"default_system": "Fuel Tank", "default_rating": "C", "default_class": "3", "max_class": "3"}, "internal_compartments": [{"default_system": "Cargo Rack [x4]", "default_rating": "E", "default_class": "2", "max_class": "3\n"}, {"default_system": "Shield Generator", "default_rating": "E", "default_class": "3", "max_class": "3\n"}, {"default_system": "Cargo Rack [x2]", "default_rating": "E", "default_class": "1", "max_class": "2\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "2\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "1\n"}, {"default_system": "Advanced Docking Computer", "default_rating": "E", "default_class": "1", "max_class": "1\n"}, {"default_system": "Supercruise Assist", "default_rating": "E", "default_class": "1", "max_class": "1\n"}, {"default_system": "(PAS)", "default_rating": "I", "default_class": "1", "max_class": "1\n"}]}}