{"name": "Orca", "overview_text": "The Orca is Saud Kruger's middle-of-the-road passenger liner. It has greater passenger capacity than the Dolphin, but less than the Beluga Liner. Although generally comparable in size to medium ships, its dimensions nonetheless exceed the limits of medium Landing Pads, relegating it to the status of a large ship. Consequently some may overlook the Orca in favor of the larger Beluga Liner, but the Orca's sleeker design makes it easier to fly and allows it to attain a greater jump range.\nWhere officially its maneuverability is slightly better than an Anaconda and worse than a Beluga Liner, in practice the Orca handles far better than this rating suggests. It has a remarkably high turn rate, especially yaw, high acceleration and max speed, and it is very good at strafing and ramming. However, its relatively small Power Plant and limited hardpoint capacity prevent it from becoming a great combat ship. Its large size makes it an easy target, and its shields are mediocre at best for a ship of this size and class. The Orca's armour, on the other hand, can be modified to values on par with other medium combat ships, such as the Federal Assault Ship, and pilots outfitting an Orca for combat tend to fly it shieldless with the largest possible Hull Reinforcement Packages and Module Reinforcement Packages. This also makes it possible for the Orca to wade into anti-Thargoid combat, though better options are available. One of the biggest drawbacks of an Orca in combat is its hardpoint placement; all hardpoints are on the underside of the ship, making it easy for enemy ships to stay out of the Orca's firing range. This has not stopped a handful of pilots from setting up groups dedicated to combat in Orcas, and like any ship, it is still formidable with engineering and skilled pilots.\nThe jump range of the Orca can reach a rather impressive average of 36 ly before Engineering, making it a solid choice for an exploration ship at a fraction of the price of the Anaconda. This makes the Orca a better ship for long distance passenger hauling than most others and contributes heavily to its role as a cruise ship, allowing Commanders to take high-paying VIPs many light-years. Its range is still less than that of a Diamondback Explorer or Asp Explorer, which are both a fraction of the price.\nAs a trader or miner the Orca is a very bad option. In both aspects, the Type-7 Transporter is a far better option especially due to the Orca's huge pricetag. At a maximum 194T of possible cargo it has the lowest of any large ship, even lower when shielded.\nThe biggest downside the Orca has is its pricetag; it is only slightly better at its roles than the Dolphin or Type-7 but at more than ten times the cost. It is also worse than the Beluga Liner at everything but jump range; Commanders looking for passenger missions may choose it instead. The Orca is very good at carrying passengers long range, however because of the weight it is ill-advised to bring bulk passengers long range; at which point the Dolphin outclasses the Orca.\nThe Orca's hardpoints are placed as follows: all three hardpoints are located on the underside of the ship, with the single Class 3 hardpoint positioned in front of the front landing gear, and the two Class 2 hardpoints behind it and side by side. This placement is ideal for fixed weapons. The cockpit is located on the bottom of massive window in the front of the ship, with the pilot seat on the left side. From there the pilot enjoys excellent viewing angles in all directions but down. The Orca also has a second pilot seat and is compatible with Multicrew.\nThe Orca's heat dispersion capabilities are relatively poor, so caution must be taken when adding or engineering modules with a high thermal load. The ship is especially prone to overheat when scooping fuel. A silver lining to this inconvenience is that it can be combined with Silent Running and a weapon modified with Thermal Conduit to deal massive amounts of damage.\nAll ships are highly customisable through the Outfitting menu of Station Services. Listed below is the default load-out for the Orca.\n", "infobox": {"overview": {"manufacturer": "Saud Kruger", "years_produced": "3300-Present", "ship_type": "Passenger Liner", "cost": "48,539,887 CR", "insurance": "2,426,994 CR", "expansion": "N/A"}, "specifications": {"hangar_type": "N/A", "landing_pad_size": "Large", "dimensions": "130.4m x 50.8m x 22.7m", "pilot_seats": "2", "multicrew": "Yes", "fighter_hangar": "No", "hull_mass": "290 t", "mass_lock_factor": "13", "armour": "396", "armour_hardness": "55", "shields": "233 MJ", "heat_capacity": "262", "fuel_capacity": "32 t", "manoeuvrability": "1", "top_speed": "308 m/s (default) 348 m/s (upgraded) ", "boost_speed": "390 m/s (default) 441 m/s (upgraded) ", "unladen_jump_range": "10.52 ly (default) 36.17 ly (upgraded) ", "cargo_capacity": "72 t (default) 194 t (max) "}, "outfitting": {"hardpoints": "4x Utility Mounts 2x Medium Hardpoints 1x Large Hardpoint ", "internal_compartments": "1x Class 1 Compartment 2x Class 2 Compartments 1x Class 3 Compartment 1x Class 4 Compartment 3x Class 5 Compartments 1x Class 6 Compartment ", "reserved_compartments": "N/A"}, "hardpoints": null}, "outfitting": {"small_hardpoint": [], "medium_hardpoint": [{"default_system": "Pulse Laser (L)", "default_rating": "F", "default_class": "1", "max_class": "2\n"}, {"default_system": "Pulse Laser (L)", "default_rating": "F", "default_class": "1", "max_class": "2\n"}], "large_hardpoint": [], "utility_mount": [{"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}], "bulkhead": {"default_system": "Lightweight Alloys", "default_rating": "I", "default_class": "1", "max_class": "8"}, "reactor_bay": {"default_system": "Power Plant", "default_rating": "E", "default_class": "5", "max_class": "5"}, "thrusters_mounting": null, "frame_shift_drive_housing": {"default_system": "Frame Shift Drive", "default_rating": "E", "default_class": "5", "max_class": "5"}, "environment_control": {"default_system": "Life Support", "default_rating": "E", "default_class": "6", "max_class": "6"}, "power_coupling": {"default_system": "Power Distributor", "default_rating": "E", "default_class": "5", "max_class": "5"}, "sensor_suite": {"default_system": "Sensors", "default_rating": "E", "default_class": "4", "max_class": "4"}, "fuel_store": {"default_system": "Fuel Tank", "default_rating": "C", "default_class": "5", "max_class": "5"}, "internal_compartments": [{"default_system": "Cargo Rack [x32]", "default_rating": "E", "default_class": "5", "max_class": "6\n"}, {"default_system": "Cargo Rack [x16]", "default_rating": "E", "default_class": "4", "max_class": "5\n"}, {"default_system": "Cargo Rack [x16]", "default_rating": "E", "default_class": "4", "max_class": "5\n"}, {"default_system": "Shield Generator", "default_rating": "E", "default_class": "5", "max_class": "5\n"}, {"default_system": "Cargo Rack [x8]", "default_rating": "E", "default_class": "3", "max_class": "4\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "3\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "2\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "2\n"}, {"default_system": "Supercruise Assist", "default_rating": "E", "default_class": "1", "max_class": "1\n"}, {"default_system": "(PAS)", "default_rating": "I", "default_class": "1", "max_class": "1\n"}]}}