{"name": "Dolphin", "overview_text": "The Dolphin is one of the three Saud Kruger line of ships, along with the Orca and Beluga Liner. It can be considered the passenger equivalent to the Type-6 Transporter. Like its sisters, it is capable of carrying Luxury Cabins and has a focus on Passenger Missions, however it is somewhat viable in other roles as well.\nThe Dolphin has 84T of cargo space available for trading. Considering it has a similar price tag to the Type-6 and similar combat ability this makes the Dolphin a rather poor trading vessel; however, its higher jump range makes it a good Rare Goods trader or for long range transport.\nIn combat, the Dolphin is just as bad as the Type-6 and suffers from many of the same downsides with its Sidewinder grade offenses and mediocre shields and armour. However, it has better mobility and better hardpoint placement, allowing it to be much more nimble as well as making it easier to keep Fixed Hardpoints on target. Installing heavier Bulkheads will seriously reduce the Dolphin's jump range, as upgrades weigh in at 32t for Reinforced Alloys and 63t for Military Grade, Mirrored Surface and Reactive Surface Composites. Fitting a class 1 or 2 Hull Reinforcement Package will offer a comparable improvement in armour with only a small mass increase.\nAs an explorer, the Dolphin is a suitable low-budget option. It has a potential jump range of 35 ly before engineering, higher than that of the standard Type-6 and just slightly short of the more expensive Asp Explorer. The Dolphin also has excellent heat management compared to most other ships, and will rarely exceed 70% heat even when fuel scooping and charging its Frame Shift Drive simultaneously. Its main weakness with regard to exploration is its low number of internal compartments, which leaves less room for staple exploration modules such as a Fuel Scoop, Guardian Frame Shift Drive Booster, Auto Field-Maintenance Unit, and Planetary Vehicle Hangar. Pilots who wish to embark on long-term expeditions may want to consider upgrading to a more spacious vessel.\nPassenger missions are its focus and it does them more effectively than most other ships. It has one slot for a Luxury Passenger Cabin and plenty of space for more passengers alongside. With its very high jump range this makes it great at doing long-range passenger missions, including those looking to go thousands of light-years. It is not as good for bulk missions as it has low compartment space.\nOverall, the Dolphin is a stylish exploration ship, the most efficient choice for transporting luxury VIP passengers, and a reasonable alternative to the trade focused Type-6 Transporter, but any combat activities should be avoided.\nThe Dolphin's cockpit is located at the front of the ship, and like other Saud Kruger ships, it features a tinted canopy that obscures the interior. The two small hardpoints are placed directly below the cockpit, on the underside of the ship.\nOutfitting\nAll ships are highly customisable through the Outfitting menu of Station Services. Listed below is the default load-out for the Dolphin.\n", "infobox": {"overview": {"manufacturer": "Saud Kruger", "years_produced": "3303-Present", "ship_type": "Passenger Liner", "cost": "1,337,330 CR", "insurance": "66,867 CR", "expansion": "N/A"}, "specifications": {"hangar_type": "N/A", "landing_pad_size": "Small", "dimensions": "51.8m x 20.8m x 8.8m", "pilot_seats": "1", "multicrew": "No", "fighter_hangar": "No", "hull_mass": "140 t", "mass_lock_factor": "9", "armour": "198", "armour_hardness": "35", "shields": "143 MJ", "heat_capacity": "245", "fuel_capacity": "16 t", "manoeuvrability": "3", "top_speed": "258 m/s (default) 290 m/s (upgraded) ", "boost_speed": "361 m/s (default) 406 m/s (upgraded) ", "unladen_jump_range": "10.67 ly (default) 35.10 ly (upgraded) ", "cargo_capacity": "14 t (default) 88 t (max) "}, "outfitting": {"hardpoints": "3x Utility Mounts 2x Small Hardpoints ", "internal_compartments": "2x Class 1 Compartments 3x Class 2 Compartments 1x Class 3 Compartment 2x Class 4 Compartments 1x Class 5 Compartment ", "reserved_compartments": "N/A"}, "hardpoints": null}, "outfitting": null}