{"name": "Gu-97", "overview_text": "Compared to the F63 Condor and Taipan Ship-Launched Fighters, the Gu-97 sacrifices protection for a dramatic increase in mobility. This results in a spacecraft that novice pilots may have difficulties adequately controlling, but which also rewards experienced pilots who know how to track targets and evade enemy fire.\nAs an SLF, the Gu-97 does not possess a Frame Shift Drive, and thus cannot jump to Supercruise or Hyperspace. Its operational area is limited to the vicinity of its deployment point, such as a station, outpost, carrier, or ship-mounted Fighter Hangar.\nDue to the Gu-97's short length, light weight and high speed, it is prone to spinning out of control when it collides with another object at an angle. When this happens the pilot may lose control of the fighter for an extended period.\nThe Gu-97 is available in 5 variants, which differ only in weapons and utility slot. F-variants have fixed weapons and G-variants have gimballed weapons.\n* This is the cost to initially outfit a Fighter Hangar bay for that fighter type/variant, or to change it to a different fighter type/variant. The cost to restock destroyed fighters is 1,030 CR each.[2]\nThe Gu-97 can be purchased in Empire systems only, but can be restocked in any system.\n", "infobox": {"overview": {"manufacturer": "Gutamaya", "years_produced": "3302-Present", "ship_type": "Ship-Launched Fighter", "cost": "15,270 CR", "insurance": "N/A", "expansion": "N/A"}, "specifications": {"hangar_type": "N/A", "landing_pad_size": "N/A", "dimensions": "6.5m x 14.9m x 2.2m", "pilot_seats": "N/A", "multicrew": "N/A", "fighter_hangar": "N/A", "hull_mass": "N/A", "mass_lock_factor": "N/A", "armour": "15", "armour_hardness": "N/A", "shields": "15 MJ", "heat_capacity": "N/A", "fuel_capacity": "N/A", "manoeuvrability": "N/A", "top_speed": "312 m/s", "boost_speed": "540 m/s", "unladen_jump_range": "N/A", "cargo_capacity": "N/A"}, "outfitting": null, "hardpoints": {"utility_mount": "1", "weapon_mounts": "2"}}, "outfitting": null}