{"name": "Vulture", "overview_text": "In combat, the Vulture is a powerful small-sized ship. It is capable of easily staying out of the firing range of tougher ships like Anacondas or Pythons and its two large hardpoints are capable of dishing out fairly heavy damage. Moreover, since class 3 weapons tend to have a higher Armour-Pierce Rating, this allows the Vulture to overcome the higher Armour Hardness generally found in larger ships. As such, the Vulture can be a capable anti-large-ship specialist, while smaller ships can be utterly dominated in seconds even without engineering. However, the low number of hardpoints means weapons such as Missiles, Mines, Torpedoes or Railguns are not viable as they have limited ammo capacities and are not all available in Class 3. This limits the Vulture to only conventional weaponry. As for weapon mount types, both fixed and gimballed mounts are viable, but turreted mounts are inadvisable due to their higher power consumption, lower damage and that they don't take advantage of the Vulture's agility.\nDefensively, the Vulture has impressive statistics on paper. It possesses the highest base shield and armour strengths out of all small sized ships, it has very good internal compartments, and it has four utility mounts, the same as larger ships such as Python and Federal Gunship. The Vulture's biggest defensive drawback is its limited power capacity, however, and this greatly limits viable loadout choices and requires smart module priority control. Another disadvantage of the Vulture is its speed, which is lower than most other small sized ships and even some medium sized ships. This makes it a struggle to catch up to targets and keep under fire. The Vulture's deficient speed is mitigated by formidable manoeuvrability, which is second only to the Eagle.\nThe Vulture suffers from overspecialization and is unsuited for any role other than combat. As an anti-Thargoid ship, it is effective against Thargoid Scouts, particularly when using turreted AX weaponry. However, its low number of hardpoints limits its use of additional weapons such as the Remote Release Flak Launcher, leaving it without many options to deal with Thargoid Interceptors. Furthermore, its cargo capacity is much lower than other ships in its price range, making it an extremely inefficient trader. However, its agility allows it to collect cargo more easily, even without Collector Limpets. Lastly, the Vulture has sub-par jump range with a maximum potential of 22.36 ly without engineering, the second-lowest of any small ship. This not only hampers its ability as an explorer, but also makes traveling to Interstellar Factors to clear bounties a chore.\nOverall the Vulture functions as a small Fer-de-Lance: unbeaten in sheer power for its size but is one of the worst ships in any other role. Because it is so limited to Bounty Hunting it has very few options and makes a poor single vessel for a commander to fly and the Asp Explorer or Keelback may be more appealing due to their multi-purpose ability.\nThe Vulture's two large hardpoints are located above and behind the cockpit, about halfway down the hull of the ship. Due to the spacing between the hardpoints, a loadout of two fixed weapons may have slight issues with converging on smaller targets. The Vulture also has two pilot seats and can accommodate Multicrew. The pilot's station is on the centerline of the ship. The auxiliary station is offset to the port side above and behind the pilot's station. Since turreted mounts are a poor match for the Vulture and it cannot mount a Fighter Hanger, it is not a recommended choice for a Multicrew ship.\nAll ships are customisable through the Outfitting menu of Station Services. Listed below is the default load-out for the Vulture.\n", "infobox": {"overview": {"manufacturer": "Core Dynamics", "years_produced": "3301-Present", "ship_type": "Combat", "cost": "4,925,615 CR", "insurance": "246,280 CR", "expansion": "N/A"}, "specifications": {"hangar_type": "N/A", "landing_pad_size": "Small", "dimensions": "43.1m x 34.7m x 12.3m", "pilot_seats": "2", "multicrew": "Yes", "fighter_hangar": "No", "hull_mass": "230 t", "mass_lock_factor": "10", "armour": "288", "armour_hardness": "55", "shields": "293 MJ", "heat_capacity": "237", "fuel_capacity": "8 t", "manoeuvrability": "5", "top_speed": "215 m/s (default) 244 m/s (upgraded) ", "boost_speed": "348 m/s (default) 397 m/s (upgraded) ", "unladen_jump_range": "7.93 ly (default) 22.36 ly (upgraded) ", "cargo_capacity": "8 t (default) 60 t (max) "}, "outfitting": {"hardpoints": "4x Utility Mounts 2x Large Hardpoints ", "internal_compartments": "4x Class 1 Compartments 1x Class 2 Compartment 1x Class 4 Compartment 1x Class 5 Compartment ", "reserved_compartments": "1x Class 5 Military Compartment"}, "hardpoints": null}, "outfitting": {"small_hardpoint": [], "medium_hardpoint": [], "large_hardpoint": [{"default_system": "Pulse Laser", "default_rating": "F", "default_class": "1", "max_class": "3\n"}, {"default_system": "Pulse Laser", "default_rating": "F", "default_class": "1", "max_class": "3\n"}], "utility_mount": [{"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}], "bulkhead": {"default_system": "Lightweight Alloys", "default_rating": "I", "default_class": "1", "max_class": "8"}, "reactor_bay": {"default_system": "Power Plant", "default_rating": "E", "default_class": "4", "max_class": "4"}, "thrusters_mounting": {"default_system": "Thrusters", "default_rating": "E", "default_class": "5", "max_class": "5"}, "frame_shift_drive_housing": {"default_system": "Frame Shift Drive", "default_rating": "E", "default_class": "4", "max_class": "4"}, "environment_control": {"default_system": "Life Support", "default_rating": "E", "default_class": "3", "max_class": "3"}, "power_coupling": {"default_system": "Power Distributor", "default_rating": "E", "default_class": "5", "max_class": "5"}, "sensor_suite": {"default_system": "Sensors", "default_rating": "E", "default_class": "4", "max_class": "4"}, "fuel_store": {"default_system": "Fuel Tank", "default_rating": "C", "default_class": "3", "max_class": "3"}, "internal_compartments": [{"default_system": "Shield Generator", "default_rating": "E", "default_class": "5", "max_class": "5\n"}, {"default_system": "Empty (M)", "default_rating": "--", "default_class": "--", "max_class": "5\n"}, {"default_system": "Cargo Rack [x8]", "default_rating": "E", "default_class": "3", "max_class": "4\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "2\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "1\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "1\n"}, {"default_system": "Advanced Docking Computer", "default_rating": "E", "default_class": "1", "max_class": "1\n"}, {"default_system": "Supercruise Assist", "default_rating": "E", "default_class": "1", "max_class": "1\n"}, {"default_system": "(PAS)", "default_rating": "I", "default_class": "1", "max_class": "1\n"}]}}