{"name": "Anaconda", "overview_text": "Boasting a total of eight weapon hardpoints, the Anaconda is a formidable combat ship. It, the Fer-de-Lance, the Federal Corvette, the Imperial Cutter, and the Mamba are the only ships capable of equipping Class 4 weaponry, the most powerful weapons that conventional ships can carry. Turreted and gimballed weapons are recommended due to the Anaconda's relatively stiff handling, which can make lining up shots difficult. The only glaring issue with it in combat is simply that if you want combat specifically, the Federal Corvette may be a better choice. However, there are some advantages to the Anaconda that the Corvette lacks in combat, which will be discussed later.\nDefensively, the Anaconda is extremely sturdy when customized for survivability. It has eight utility mounts, tied for the highest of any ship in the game, and its potent Class 8 Power Plant allows a Shield Generator, a Shield Cell Bank and multiple Shield Boosters to be activated simultaneously whilst still having enough output leftover to comfortably power the weapons and other systems. Even if the shields fail, the Anaconda has a base armor strength of 945 and a large number of optional internal compartments give plenty of room to install Hull or Module Reinforcement Packages to stack even more protection. Optimizing for hull/armour strength allows a maximum of 6,137.5 without Engineering, or 10,755 with, the most of any ship. Last but not least, should the need to retreat arise, the Anaconda's Mass Lock Factor of 23 means it can be mass locked only by itself, a Federal Corvette, Imperial Cutter, or a Type-10 Defender, so it can escape from other vessels with relative ease. The Anaconda will be outrun by the Corvette and Cutter, because it is the slowest of the big three. PVP in an Anaconda versus other big ships is tough and usually lethal in an equal battle.\nStatistically speaking, the Anaconda is the single best exploration ship in the game. With a staggering jump range of 41.45 LY before Engineering, it can easily jump massive distances. However, the Diamondback Explorer has slightly better range without Engineering, while the Mandalay has slightly better range both with and without Engineering. In addition, both the Diamondback Explorer and Mandalay have a much lower price and rebuy than the Anaconda, and much smaller footprints for landing in rough terrain. What places the Anaconda a notch above ships like the Diamondback Explorer is its much larger optional internal capacity and its maximum jump range of 90 LY, which is just barely outclassed by the Mandalay's 91 LY. Its large fuel tank and ability to fit a Class 7 Fuel Scoop top it off as an impressive vessel for exploration. The only drawbacks are its size, which can make finding a suitable landing spot on a planetary surface bothersome, and its slow turning rate in Supercruise which can make moving around stars and other stellar objects a harrowing experience for unwary pilots. Additionally, it shares a weakness with the Hauler, in that thanks to its impossibly light weight, adding modules can significantly reduce its jump range. As such, a pilot must take careful consideration with regards to loadout when outfitting an Anaconda for exploration. With the SCO FSD, a proper Anaconda build can reach a jump range of 90 LY. However, due to the Anaconda's unspecialized body, it suffers reduced supercruise stability, severe heat generation, and dramatically increased fuel consumption while SCO is active. \nSince the Second Thargoid War in Sol, double engineered FSD SCO's have been given to commanders. This knocked the Anaconda out of the top 1 spot for exploration. Instead the Mandalay has been crowned king of the highest possible jump range. However, while the Mandalay is better for long distance travel speed runs, the Anaconda is still better in almost every other way for extended, deep space exploration due to its module capacity and durability. The amount of optional internal slots allow it to carry more, a significantly higher base armour rating and hull health, better shields, much more utilities for heatsinks and a fighter bay. It also handles far better in a neutron jet cone than the Mandalay. While some argue that the Anaconda has a small fuel tank, weaker SCO FSD compatibility and is difficult to land, but these are mostly fixable issues. For example:\nThe Anaconda's robust internal slots enable fitting everything you need and extra modules. For example: extra hull reinforcement, fuel, a spare AFMU, or mining lasers to gather materials and synthesis.  A low Emissions power plant and 8 heat sinks means little chance of overheating. [1]\nSome traders make use of the Anaconda due to its high jump range and decent cargo capacity; however, at only 468T of cargo, it is surpassed by several other large ships such as Lakon's Type-9 Heavy and Type-10 Defender, the Federal Corvette, and the Imperial Cutter, making it the least effective ship in its price range, though thanks to the abundance of slots placing a cargo rack in a spare compartment to collect the odd bobble can be an interesting way of earning a small amount of extra credits. The Anaconda also makes for a fantastic miner, able to fit a large amount of potential Mining Lasers as well as plenty of space for Limpets and cargo holds. Its ability to mount a Fighter Hangar for Ship-Launched Fighters coupled with great self-defense potential means the Anaconda fits the role very well. Due to its slow speed and maneuverability it can be tough to move through rock fields but overall it is an excellent mining ship if the Cutter is not available, though some may prefer the Anaconda thanks to its vastly better jump range.\nAs a combat battleship, the Anaconda is an interesting alternative to the Corvette. The slower speed and maneuverability lowers its utility in dogfights but its far better armour and decent shields allow it to hold the line better against most opponents. The weapon positioning of the Anaconda is rather poor for fixed weapons but using the bottom Huge, 2 Small and Large hard points can allow fixed mounts to be viable though the slow handling of the Anaconda makes it tough to utilize compared to the Corvette.  The top 2 Large hard points are ideal for turreted laser weapons while the 2 Mediums tend to be best for auxiliary weapons such as Torpedoes or Missiles. Because of their position the Mediums tend to be inefficient as Gimballed or Turreted mounts while their wide convergence makes them weak with fixed weapons, so lock-on or hit scan weapons tend to be ideal for these slots. \nFor shields, depending on your combat opponent, this can make or break your build. Against NPC's Prismatic Shields are generally worse thanks to their inability to recharge past 50% without extreme waits (You can reboot and repair to bring them to 50% if they are nearly destroyed) and they don't have anywhere near the same raw defense as the Cutter does, so using Bi-Weaves are generally better for PvE as they are significantly more forgiving and more effective for long fights in Haz Rez zones or Conflict Zones. Rather than turning or running from smaller ships to line up a shot, make use of the Anaconda's biggest blessing, its absolutely outrageously high DPS. Despite what would make sense, the Corvette has worse DPS than the Anaconda IF the Anaconda can get all of its guns on target, though its slow speed and low maneuverability would make it seem worse. Rather than trying to compete with a Corvette in its prime environment -speed and turning- it is highly recommended that you lean into the Anacondas strength, mainly, being made of (as Commander TheYamiks so politely puts it) Federal Pilot Brains, or in other words, the outlandishly high Hull Strength. By backpedaling in the reverse sweet spot (Blue part of your speed meter) while face tanking anything they fire at you, you can bring all 8 of your hardpoints to bear and absolutely smoke any ship that is foolish enough to follow. It also makes it easier to track small ships by either pitching up while moving down, or by pitching down while moving up, allowing you to follow their ship when they pass by you rather than turning around and watching them blitz past you again.\nFor weapons, the top 2 Large hardpoints are ideal for turrets as there are no obstructions to block their view, and the bottom 4 hardpoints are best for either Gimballed or Fixed but less effective for Turrets thanks to the ships large and wide body. While using the Huge hardpoint with a Plasma Accelerator might be tempting, unlike most Fixed weapons the Plasma Accelerator has abysmal travel time making it almost useless at anything farther than pointblank range. It is typically best used with either Fixed Multi-Cannons or Gimballed Laser type weapons. Overall however, the ships weapons offer great customization and thanks to having 8 of them there is a large amount of variation in load outs you may pick.\nThe weapon hardpoint locations are as follows: two Class 3 hardpoints are mounted parallel on the top of the bow; the third is located underneath the nose. Its single Class 4 hardpoint is mounted behind the bottom Large, and the two Class 2 hardpoints are embedded in the sides of the ship, hidden beneath sliding panels emblazoned with the Faulcon DeLacy logo. Finally, two additional Class 1 hardpoints are mounted on the underside of the ship, far back.\nThe Anaconda's bridge is located on the top of the ship roughly at its midpoint. The pilot's seat is positioned in the center of the bridge, with one co-pilot seat to the right and two more on the left. The canopy offers a wide horizontal field of view (more than 180 degrees), however the canopy's widths are tapered off to either side, limiting vertical field of view. The ship's nose also obstructs view underneath the ship. In a combat scenario, two Class 3 hardpoints and two utility mounts are deployed directly in front of the bridge, which can obstruct the pilot's view when they fire. Turreted weapons are the most troublesome, as their special mounts will obscure your view even further. \nOverall, the Anaconda excels as a multi-role ship, and is only surpassed by more specialized vessels. The major downsides of the ship are its sub-par speed and maneuverability, as well as the somewhat high cost for outfitting -though out of the big three it is still relatively cheap- and maintenance: prices for less essential modules will easily exceed 1 million credits, and the most expensive modules such as the power plant can run upwards of a hundred million credits. The repair fees for the Anaconda are also relatively high, since repair costs are calculated based on the purchase price of the ship and its modules, and so it is usually cheaper to repair an Anaconda's modules using an Auto Field-Maintenance Unit. As total outfitting costs can exceed half a billion credits for a combat-focused build, hunting for discounts is strongly recommended. The only major flaw that may turn off some buyers is the high investment required to fully kit an Anaconda, as unlike the Corvette and Cutter, which require rank and thus usually are bought with credits earned from getting their ranks, the Anaconda can be purchased as soon as you have enough credits. Some people will buy it before having the money to make it useful, and are left with the atrocious E rated Anaconda which is nearly useless and a huge downgrade from whatever ship they were flying previously. \nAll ships are highly customisable through the Outfitting menu of Station Services. Listed below is the default load-out for the Anaconda.\n", "infobox": {"overview": {"manufacturer": "Faulcon DeLacy", "years_produced": "2856-Present", "ship_type": "Multirole", "cost": "146,969,450 CR", "insurance": "7,348,473 CR", "expansion": "N/A"}, "specifications": {"hangar_type": "N/A", "landing_pad_size": "Large", "dimensions": "155m x 62m x 32m", "pilot_seats": "3-4", "multicrew": "Yes", "fighter_hangar": "Yes", "hull_mass": "400 t", "mass_lock_factor": "23", "armour": "945", "armour_hardness": "65", "shields": "362 MJ", "heat_capacity": "334", "fuel_capacity": "32 t", "manoeuvrability": "1", "top_speed": "183 m/s (default) 209 m/s (upgraded) ", "boost_speed": "244 m/s (default) 279 m/s (upgraded) ", "unladen_jump_range": "9.41 ly (default) 41.45 ly (upgraded) ", "cargo_capacity": "114 t (default) 470 t (max) "}, "outfitting": {"hardpoints": "8x Utility Mounts 2x Small Hardpoints 2x Medium Hardpoints 3x Large Hardpoints 1x Huge Hardpoint ", "internal_compartments": "1x Class 1 Compartment 1x Class 2 Compartment 3x Class 4 Compartments 3x Class 5 Compartments 3x Class 6 Compartments 1x Class 7 Compartment ", "reserved_compartments": "1x Class 5 Military Compartment"}, "hardpoints": null}, "outfitting": {"small_hardpoint": [{"default_system": "Pulse Laser (L)", "default_rating": "F", "default_class": "1", "max_class": "1\n"}, {"default_system": "Pulse Laser (L)", "default_rating": "F", "default_class": "1", "max_class": "1\n"}], "medium_hardpoint": [{"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "2\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "2\n"}], "large_hardpoint": [{"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "3\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "3\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "3\n"}], "utility_mount": [{"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}], "bulkhead": {"default_system": "Lightweight Alloys", "default_rating": "I", "default_class": "1", "max_class": "8"}, "reactor_bay": {"default_system": "Power Plant", "default_rating": "E", "default_class": "8", "max_class": "8"}, "thrusters_mounting": {"default_system": "Thrusters", "default_rating": "E", "default_class": "7", "max_class": "7"}, "frame_shift_drive_housing": {"default_system": "Frame Shift Drive", "default_rating": "E", "default_class": "6", "max_class": "6"}, "environment_control": {"default_system": "Life Support", "default_rating": "E", "default_class": "5", "max_class": "5"}, "power_coupling": {"default_system": "Power Distributor", "default_rating": "E", "default_class": "8", "max_class": "8"}, "sensor_suite": {"default_system": "Sensors", "default_rating": "E", "default_class": "8", "max_class": "8"}, "fuel_store": {"default_system": "Fuel Tank", "default_rating": "C", "default_class": "5", "max_class": "5"}, "internal_compartments": [{"default_system": "Cargo Rack [x64]", "default_rating": "E", "default_class": "6", "max_class": "7\n"}, {"default_system": "Cargo Rack [x32]", "default_rating": "E", "default_class": "5", "max_class": "6\n"}, {"default_system": "Shield Generator", "default_rating": "E", "default_class": "6", "max_class": "6\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "6\n"}, {"default_system": "Cargo Rack [x16]", "default_rating": "E", "default_class": "4", "max_class": "5\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "5\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "5\n"}, {"default_system": "Empty (M)", "default_rating": "--", "default_class": "--", "max_class": "5\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "4\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "4\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "4\n"}, {"default_system": "Cargo Rack [x2]", "default_rating": "E", "default_class": "1", "max_class": "2\n"}, {"default_system": "Supercruise Assist", "default_rating": "E", "default_class": "1", "max_class": "1\n"}, {"default_system": "(PAS)", "default_rating": "I", "default_class": "1", "max_class": "1\n"}]}}