{"name": "Taipan", "overview_text": "Among Ship-Launched Fighters, the Taipan is not as fast as the F63 Condor nor as maneuverable as the Imperial Fighter, but it does have the greatest armour and shield strength, allowing it to absorb more damage and still remain combat effective.\nAs an SLF, the Taipan does not possess a Frame Shift Drive, and thus cannot jump to Supercruise or Hyperspace. Its operational area is limited to the vicinity of its deployment point, such as a station, outpost, carrier, or ship-mounted Fighter Hangar.\nThe rear wings of the Taipan will move based on the amount of the fighter's heat level. As the fighter's heat level increases, the rear wings will form from a V-shape into a parallel shape. This allows the fighter to more effectively release heat into outer space, slightly hindering the fighter's manoeuvrability until cooled down.\nThe Taipan is available in 6 variants, which differ only in weapons and utility modules, and slightly in the top and boost speed. F-variants have fixed weapons and G-variants have gimballed weapons.\n* This is the cost to initially outfit a Fighter Hangar bay for that fighter type/variant, or to change it to a different fighter type/variant. The cost to restock destroyed fighters is 1,030 CR each.[2]\nThe Taipan can be purchased in Alliance and Independent systems only, but can be restocked in any system.\n", "infobox": {"overview": {"manufacturer": "Faulcon DeLacy", "years_produced": "3302-Present", "ship_type": "Ship-Launched Fighter", "cost": "15,270 CR", "insurance": "N/A", "expansion": "N/A"}, "specifications": {"hangar_type": "N/A", "landing_pad_size": "N/A", "dimensions": "13.9m x 16.9m x 2.6m", "pilot_seats": "N/A", "multicrew": "N/A", "fighter_hangar": "N/A", "hull_mass": "N/A", "mass_lock_factor": "N/A", "armour": "45", "armour_hardness": "N/A", "shields": "30 MJ", "heat_capacity": "N/A", "fuel_capacity": "N/A", "manoeuvrability": "N/A", "top_speed": "263-279 m/s", "boost_speed": "544-577 m/s", "unladen_jump_range": "N/A", "cargo_capacity": "N/A"}, "outfitting": null, "hardpoints": {"utility_mount": "1", "weapon_mounts": "2"}}, "outfitting": null}