{"name": "F63 Condor", "overview_text": "The F63 Condor only has moderate agility and defenses, but is noted for its high straight-line speed, contrasting with the Gu-97, which prioritizes agility, and the Taipan, which is designed for durability. The Condor thus fills a third niche among Ship-Launched Fighters as a strike craft that can move in, hit hard, and then outrun any pursuers. The F63 Condor supports two small hardpoints and at least one utility mount, but is unique in that it is the only SLF model that can mount Multi-cannons, allowing it to inflict more hull damage than other options.\nAs an SLF, the F63 Condor does not possess a Frame Shift Drive, and thus cannot jump to Supercruise or Hyperspace. Its operational area is limited to the vicinity of its deployment point, such as a station, outpost, carrier, or ship-mounted Fighter Hangar.\nThe F63 Condor is flyable in the CQC Championship, and is a part of the starter (Rank 1) loadout. It comes with two pulse lasers and a Chaff Launcher as default.\nThe F63 Condor is available in 5 variants, which differ only in weapons and utility module, and slightly in the top and boost speed. It is the only fighter available with kinetic weapons. F-variants have fixed weapons and G-variants have gimballed weapons.\n* This is the cost to initially outfit a Fighter Hangar bay for that fighter type/variant, or to change it to a different fighter type/variant. The cost to restock destroyed fighters is 1,030 CR each.[2]\nThe F63 Condor can be purchased in Federation systems only, but can be restocked in any system.\n", "infobox": {"overview": {"manufacturer": "Core Dynamics", "years_produced": "3302-Present", "ship_type": "Ship-Launched Fighter", "cost": "15,270 CR", "insurance": "N/A", "expansion": "N/A"}, "specifications": {"hangar_type": "N/A", "landing_pad_size": "N/A", "dimensions": "13.5m x 10.5m x 2.5m", "pilot_seats": "N/A", "multicrew": "N/A", "fighter_hangar": "N/A", "hull_mass": "N/A", "mass_lock_factor": "N/A", "armour": "25", "armour_hardness": "N/A", "shields": "25 MJ", "heat_capacity": "N/A", "fuel_capacity": "N/A", "manoeuvrability": "N/A", "top_speed": "316-327 m/s", "boost_speed": "536-554 m/s", "unladen_jump_range": "N/A", "cargo_capacity": "N/A"}, "outfitting": null, "hardpoints": {"utility_mount": "1", "weapon_mounts": "2"}}, "outfitting": null}