{"name": "Type-7 Transporter", "overview_text": "The Type-7 Transporter is a bulky trading vessel and often the next choice for traders who want to upgrade from the Type-6 Transporter. It features triple the capacity of a Type-6 at a higher price. Due to the Type-7 requiring a large Landing Pad as a result of its tall frame, it cannot dock at Outposts, which somewhat limits its utility compared to medium ships with smaller cargo capacities such as the Federal Dropship, Alliance Chieftain, or Python. The Type-7 is both the cheapest and smallest large-sized ship on the market.\nThe Type-7 is an excellent shielded or Open Play trader when outfit with Military Grade Composites, a Shield Generator, and Shield Boosters. Its pitch and yaw speed combined with an acceptable base speed and adequate defenses allow it to make a hyperspace jump out of combat or potentially evade interdiction. It is usually a better strategy to submit for a faster FSD cool-down, boost past your attacker, and charge your Frame Shift Drive. The Type-7's Mass Lock Factor is below most medium ships and all large ships. Thus, it is not advisable to jump to Supercruise to avoid an attacker.\nIn combat, the Type-7, much like other freighters, is not viable. Its hardpoints are outclassed by even the Imperial Eagle or Viper Mk III, which are far cheaper, and significantly more maneuverable. In practice, the top and bottom hardpoints' poor convergence, combined with the weak Class 4 Power Distributor, and even heat problems further limit damage output and hardpoint options. As a multirole or pirate ship, the Type-7 is surpassed by its main competitor, the Python. Even the Asp Scout is a better option for combat, multipurpose and piracy. When outfitting the Type-7 as a shielded trader, it is worth considering equipping no weapons at all for increased speed and jump range.\nAs pertaining to passenger missions, whether grinding reputation or credits, the Type-7 has three Class 6 Compartments, as well as three Class 5 Compartments. This makes it the cheapest ship in the game of those which have six or more Compartments of Class 5 or greater, the others being the Beluga Liner, Anaconda, Federal Corvette, and the Imperial Cutter.  Considering it's price, it represents a useful niche for those that cannot afford a Python, as well as those that might be eyeing a Beluga or other more expensive large passenger hauler but cannot afford one. As it is large ship it cannot dock at outposts, which are typically lower security, and therefore it is more commonly subjected to station scans than a medium ship such as a Python would be. This can be mitigated with heatsinks or other heat-reducing measures. Additionally, passengers missions from outposts tend to pay slightly more, so there is a slight loss of credits per hour, though small, that comes from using a large ship such as the Type-7 for this purpose.\nThe Type-7 is a viable exploration ship, with some caveats. With ranges around 30 LY, the ship is very capable of long range jumps and can be very good at long range deliveries or Rare Commodities trading. Unfortunately, the Type-7 struggles to control its heat. It is possible to overheat while fuel-scooping or simply charging the Frame Shift Drive to jump to the next system on a route. Heat can be mitigated by installing an A-rated Power Plant and multiple Heatsink Launchers.\nThe Type-7 is an adequate miner, perhaps as an intermediate step between an Adder, Cobra Mk III, or Viper Mk IV and a Python, Anaconda, Type-9 Heavy, or Imperial Cutter. It lacks any Class 2 hardpoints, which are necessary to install a Seismic Charge Launcher for deep core asteroid mining, so it is only suited to laser mining. While it can accommodate more limpets and cargo space than the Python, its mining speed is limited by its Class 4 Power Distributor and hardpoints. As the weapons capacitor of a 4A Power Distributor can be depleted by only three Mining Lasers, it is possible to install a Sub-surface Displacement Missile with no negative effect.\nThe Type-7 possesses four Class 1 hardpoints and four utility mounts. Two of the hardpoints are located on the front face of the ship, on either side of the cockpit. One hardpoint is located on the topside of the ship, roughly amidships and dead center. The fourth and final hardpoint is located on the ship's underside, behind the cargo hatch and offset to the right; notably, a fifth hardpoint placement can be seen opposite this one, but is unusable.\nThe Type-7's cockpit is mounted low on the front face of the ship. A large portion of the ship's profile lies directly above the pilot. When manually flying through an access corridor, it is important to keep this in mind. It is not uncommon for pilots new to the Type-7 to crash the top of the ship on the access corridor. This can be avoided by entering the airlock either sideways or lower than normal.\nAll ships are highly customisable through the Outfitting menu of Station Services. Listed below is the default load-out for the Type-7 Transporter.\n", "infobox": {"overview": {"manufacturer": "Lakon Spaceways", "years_produced": "3290-Present", "ship_type": "Freighter", "cost": "17,472,252 CR", "insurance": "873,613 CR", "expansion": "N/A"}, "specifications": {"hangar_type": "N/A", "landing_pad_size": "Large", "dimensions": "81.6m x 56.1m x 25.4m", "pilot_seats": "1", "multicrew": "No", "fighter_hangar": "No", "hull_mass": "350 t", "mass_lock_factor": "10", "armour": "612", "armour_hardness": "54", "shields": "99 MJ", "heat_capacity": "226", "fuel_capacity": "32 t", "manoeuvrability": "1", "top_speed": "182 m/s (default) 209 m/s (upgraded) ", "boost_speed": "304 m/s (default) 348 m/s (upgraded) ", "unladen_jump_range": "12.27 ly (default) 29.75 ly (upgraded) ", "cargo_capacity": "128 t (default) 306 t (max) "}, "outfitting": {"hardpoints": "4x Utility Mounts 4x Small Hardpoints ", "internal_compartments": "1x Class 1 Compartment 1x Class 2 Compartment 2x Class 3 Compartments 3x Class 5 Compartments 3x Class 6 Compartments ", "reserved_compartments": "N/A"}, "hardpoints": null}, "outfitting": {"small_hardpoint": [{"default_system": "Pulse Laser (L)", "default_rating": "F", "default_class": "1", "max_class": "1\n"}, {"default_system": "Pulse Laser (L)", "default_rating": "F", "default_class": "1", "max_class": "1\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "1\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "1\n"}], "medium_hardpoint": [], "large_hardpoint": [], "utility_mount": [{"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "0\n"}], "bulkhead": {"default_system": "Lightweight Alloy", "default_rating": "C", "default_class": "1", "max_class": "1"}, "reactor_bay": {"default_system": "Power Plant", "default_rating": "E", "default_class": "4", "max_class": "5"}, "thrusters_mounting": {"default_system": "Thrusters", "default_rating": "E", "default_class": "5", "max_class": "5"}, "frame_shift_drive_housing": {"default_system": "Frame Shift Drive", "default_rating": "E", "default_class": "5", "max_class": "5"}, "environment_control": {"default_system": "Life Support", "default_rating": "E", "default_class": "4", "max_class": "4"}, "power_coupling": {"default_system": "Power Distributor", "default_rating": "E", "default_class": "3", "max_class": "4"}, "sensor_suite": {"default_system": "Sensors", "default_rating": "E", "default_class": "3", "max_class": "3"}, "fuel_store": null, "internal_compartments": [{"default_system": "Cargo Rack [x32]", "default_rating": "E", "default_class": "5", "max_class": "6\n"}, {"default_system": "Cargo Rack [x32]", "default_rating": "E", "default_class": "5", "max_class": "6\n"}, {"default_system": "Cargo Rack [x32]", "default_rating": "E", "default_class": "5", "max_class": "6\n"}, {"default_system": "Cargo Rack [x16]", "default_rating": "E", "default_class": "4", "max_class": "5\n"}, {"default_system": "Cargo Rack [x16]", "default_rating": "E", "default_class": "4", "max_class": "5\n"}, {"default_system": "Shield Generator", "default_rating": "E", "default_class": "4", "max_class": "5\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "3\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "3\n"}, {"default_system": "Empty", "default_rating": "--", "default_class": "--", "max_class": "2\n"}, {"default_system": "Supercruise Assist", "default_rating": "E", "default_class": "1", "max_class": "1\n"}, {"default_system": "(PAS)", "default_rating": "I", "default_class": "1", "max_class": "1\n"}]}}