{"name": "XG8 Javelin", "overview_text": "In contrast with human-manufactured Ship-Launched Fighters, the XG8 Javelin is an all-rounder that relies on its unique Guardian weaponry. It is slightly slower than the F63 Condor, slightly less manoeuvrable than the Gu-97, and has significantly less armour than the Taipan, but its damage output is substantial, especially against Thargoid craft.\nWhile the Javelin's Shard Launcher has the highest potential damage-per-shot (133) of all three Guardian hybrid fighters, its slow-moving projectiles make it difficult to use, limiting its range. However, it has the highest DPS of any fighter, and if allowed to apply its damage, it can quickly tear down even powerful shields singlehanded. In general, it is most effective against larger, slower targets, and less effective against smaller and more nimble enemies.\nBe aware that during combat against a Thargoid Interceptor, its Thargon Swarms will prioritise any Ship-Launched Fighters in the area and quickly destroy them. Eliminate as many Thargon Swarms as possible before deploying a SLF to allow it focus on Thargoid ships unimpeded.\nThe XG8 Javelin can be permanently unlocked for purchase by providing the following Materials to a Guardian Technology Broker:\n", "infobox": {"overview": {"manufacturer": "Ram Tah", "years_produced": "3304-Present", "ship_type": "Ship-Launched Fighter", "cost": "15,270 CR", "insurance": "N/A", "expansion": "Elite Dangerous: Horizons"}, "specifications": {"hangar_type": "N/A", "landing_pad_size": "N/A", "dimensions": "13.5m x 14.2m x 12.9m", "pilot_seats": "N/A", "multicrew": "N/A", "fighter_hangar": "N/A", "hull_mass": "N/A", "mass_lock_factor": "N/A", "armour": "10", "armour_hardness": "N/A", "shields": "30 MJ", "heat_capacity": "N/A", "fuel_capacity": "N/A", "manoeuvrability": "N/A", "top_speed": "316 m/s", "boost_speed": "541 m/s", "unladen_jump_range": "N/A", "cargo_capacity": "N/A"}, "outfitting": null, "hardpoints": {"utility_mount": "0", "weapon_mounts": "3"}}, "outfitting": null}