{"text": "The Imperial Eagle is a combat ship manufactured by Gutamaya, produced from 3199 to the present. It costs 110,830 CR with an insurance of 5,542 CR. Compared to the Eagle, it has superior armor and shield strength, a Class 2 hardpoint, and enhanced speed with upgraded thrusters, making it potentially the fastest ship in normal space. However, it sacrifices agility and has limited cargo capacity, making it unsuitable for trading or exploration. Its hardpoints are located on the top and underside of the ship, with a confined cockpit and a single pilot seat.", "metadata": {"entity_name": "Imperial Eagle", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Imperial Eagle has dimensions of 31.2m x 34.7m x 7.1m, a hull mass of 50 t, and a mass lock factor of 6. It features armor with a rating of 108 and hardness of 28, shields of 104 MJ, and a heat capacity of 163. The ship has a fuel capacity of 4 t, a top speed of 302 m/s (347 m/s upgraded), a boost speed of 403 m/s (462 m/s upgraded), and an unladen jump range of 8.22 ly (25.37 ly upgraded). Its cargo capacity is 2 t (20 t max).", "metadata": {"entity_name": "Imperial Eagle", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Imperial Eagle's outfitting includes 1x Utility Mount, 2x Small Hardpoints, and 1x Medium Hardpoint. It has 4x Class 1 Compartments, 1x Class 2 Compartment, 1x Class 3 Compartment, and 1x Class 2 Military Compartment reserved. The default loadout includes Pulse Lasers on the small hardpoints and an empty medium hardpoint.", "metadata": {"entity_name": "Imperial Eagle", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Imperial Eagle's default systems include Lightweight Alloys (Bulkhead, Class 1), Power Plant (Reactor Bay, Class 3), Thrusters (Thrusters Mounting, Class 3), Frame Shift Drive (Frame Shift Drive Housing, Class 3), Life Support (Environment Control, Class 1), Power Distributor (Power Coupling, Class 2), Sensors (Sensor Suite, Class 2), and Fuel Tank (Fuel Store, Class 2). Internal compartments include a Shield Generator, Cargo Rack, and various empty slots.", "metadata": {"entity_name": "Imperial Eagle", "document_type": "ship", "chunk_type": "outfitting"}}