{"text": "The Python Mk II is a combat-oriented ship manufactured by Faulcon DeLacy, produced from 3310 to the present. It costs 67,527,361 CR and has an insurance value of 3,376,368 CR. The ship is designed for high maneuverability and combat effectiveness, with a default unladen jump range of 18.11 ly, which can be upgraded to 26.71 ly. It features six hardpoint slots, including four Class 3 and two Class 2, making it highly lethal in combat. The Python Mk II is available in two variants: Standard and Stellar, with the Stellar version equipped with four Multi-Cannons and two Pulse Lasers by default. It has a cargo capacity of up to 96 tons, significantly less than the Mk I's 294 tons, making it less suitable for trading or mining. The ship was introduced in 2024 and is highly customizable through the Outfitting menu.", "metadata": {"entity_name": "Python Mk II", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Python Mk II has dimensions of 88.4m x 67.5m x 17.3m and a hull mass of 450 tons. It features 2 pilot seats and supports multicrew. The ship's armor rating is 504 with an armor hardness of 70, and it has shields of 316 MJ. Its heat capacity is 260, and it has a fuel capacity of 16 tons. The ship's maneuverability rating is 4, with a default top speed of 261 m/s and a boost speed of 352 m/s, which can be upgraded to 297 m/s and 400 m/s, respectively. The cargo capacity is 10 tons by default, expandable to 96 tons.", "metadata": {"entity_name": "Python Mk II", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Python Mk II comes with six utility mounts, two medium hardpoints, and four large hardpoints. It has internal compartments including two Class 1, one Class 2, one Class 3, one Class 4, and one Class 6. The default outfitting includes Pulse Lasers on the medium hardpoints and empty slots on the large hardpoints and utility mounts. The ship's bulkhead is equipped with Lightweight Alloys (Class 1, Grade C), and it features a Power Plant (Class 6, Grade E), Thrusters (Class 6, Grade E), and a Frame Shift Drive (SCO, Class 5, Grade C). Other default systems include Life Support (Class 4, Grade E), Power Distributor (Class 6, Grade E), Sensors (Class 5, Grade E), and a Fuel Tank (Class 4, Grade C). Internal compartments include a Shield Generator (Class 6, Grade E), Cargo Racks (Class 1, Grade E), Supercruise Assist (Class 1, Grade E), and a Passenger Cabin (Class 1, Grade I).", "metadata": {"entity_name": "Python Mk II", "document_type": "ship", "chunk_type": "outfitting"}}