{"text": "The Sidewinder Mk I is a low-cost starter craft given to newly-licensed pilots, manufactured by Faulcon DeLacy. It is a multirole ship produced from 2982 to the present. The Sidewinder is known for its agility, being one of the most agile ships available, but it is also one of the slowest and weakest-hulled ships. It is an acceptable ship in combat but lacks firepower. As a trader, it has the worst performance due to its low cargo capacity. It has a maximum jump range of about 24ly before engineering, making it a decent introduction to exploration, though not the best choice. The Sidewinder is highly customizable and can be purchased at most shipyards.", "metadata": {"entity_name": "Sidewinder Mk I", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Sidewinder Mk I has dimensions of 14.9m x 21.3m x 5.4m, with a hull mass of 25 t and an armour rating of 108. It has shields of 52 MJ and a heat capacity of 140. The ship has a top speed of 221 m/s (default) or 229 m/s (upgraded), and a boost speed of 322 m/s (default) or 334 m/s (upgraded). Its unladen jump range is 7.25 ly (default) or 24.43 ly (upgraded), with a cargo capacity of 4 t (default) or 16 t (max). The ship has 2x Utility Mounts and 2x Small Hardpoints, with 4x Class 1 Compartments and 2x Class 2 Compartments internally.", "metadata": {"entity_name": "Sidewinder Mk I", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Sidewinder Mk I comes equipped with two Class 1 Pulse Lasers (L) rated G. It has two Utility Mounts that are initially empty. The ship's bulkhead is made of Lightweight Alloys rated I, Class 1. It has a Power Plant rated E, Class 2, Thrusters rated E, Class 2, and a Frame Shift Drive rated E, Class 2. The Sidewinder also includes a Shield Generator (L) rated E, Class 2, a Cargo Rack [x4] (L) rated E, Class 2, an Advanced Docking Computer rated E, Class 1, Supercruise Assist rated E, Class 1, and a PAS rated I, Class 1.", "metadata": {"entity_name": "Sidewinder Mk I", "document_type": "ship", "chunk_type": "outfitting"}}