{"text": "The Diamondback Explorer is a Combat Explorer manufactured by Lakon Spaceways, produced from 3300 to the present. It costs 1,894,760 CR with an insurance value of 94,738 CR. This ship is designed for exploration and combat, featuring a balance of power management and offensive capabilities. It is equipped with a Class 5 Frame Shift Drive and a 32t Fuel Tank, making it excellent for long-distance travel and exploration. The ship's design allows for a significant jump range even with a full combat outfit, making it ideal for missions, forward scouting, or rescue operations. The Diamondback Explorer has excellent heat efficiency and power distribution, which enhances its performance in various scenarios, including fuel scooping, thermal weapon usage, and stealth operations. However, it is heavier for its size and less agile compared to the Diamondback Scout, though it can still effectively engage targets with gimballed weapons. The ship is not well-suited for mining due to its limited internal compartment space and higher cost compared to other ships.", "metadata": {"entity_name": "Diamondback Explorer", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Diamondback Explorer has dimensions of 45.0m x 27.3m x 13.6m and a hull mass of 260 t. It features a mass lock factor of 10, armor rating of 270 with a hardness of 42, and shields of 131 MJ. The ship's heat capacity is 351, and it has a fuel capacity of 32 t. In terms of performance, it has a top speed of 251 m/s (default) and 282 m/s (upgraded), a boost speed of 328 m/s (default) and 369 m/s (upgraded), and an unladen jump range of 15.70 ly (default) and 41.61 ly (upgraded). The cargo capacity is 12 t (default) and can be expanded to 60 t (max). The ship has a manoeuvrability rating of 4 and is equipped with a small landing pad size.", "metadata": {"entity_name": "Diamondback Explorer", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Diamondback Explorer is equipped with four utility mounts and three hardpoints: two medium hardpoints and one large hardpoint. The medium hardpoints are located on either side of the cockpit, each capable of mounting up to a Class 2 weapon system. The large hardpoint is mounted under the nose, providing a field of fire similar to the nose mount of the Python. All hardpoints are grouped on the fore of the ship's hull, allowing simultaneous firing at targets. The ship also features four utility mounts located on the dorsal side of both wingtips, above the cockpit, and on the rear tail. The default outfitting includes two Class 1, two Class 2, two Class 3, and two Class 4 internal compartments, with no reserved compartments.", "metadata": {"entity_name": "Diamondback Explorer", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Diamondback Explorer's default outfitting includes a Lightweight Alloys bulkhead (Class 1, Grade I), a Power Plant reactor bay (Class 4, Grade E), Thrusters (Class 4, Grade E), a Frame Shift Drive (Class 5, Grade E), Life Support (Class 3, Grade E), a Power Distributor (Class 4, Grade E), Sensors (Class 3, Grade E), and a Fuel Tank (Class 5, Grade C). The internal compartments include a Shield Generator (Class 4, Grade E), Cargo Racks (Class 3 and Class 2), an Advanced Docking Computer (Class 1, Grade E), Supercruise Assist (Class 1, Grade E), and a PAS (Class 1, Grade I). The medium hardpoints are equipped with Pulse Lasers (Class 1, Grade F), and all utility mounts are initially empty.", "metadata": {"entity_name": "Diamondback Explorer", "document_type": "ship", "chunk_type": "outfitting"}}