{"text": "The Viper Mk IV is a heavier variant of the Viper Mk III, sacrificing mobility for increased toughness. It has a similar appearance to the Mk III but can fit a larger Class 4 shield generator, resulting in potentially stronger shields. The Viper Mk IV is more resilient due to its higher base hull and more space for Hull Reinforcement Packages, but it has slightly reduced turn rate and speed, making it vulnerable to more nimble ships. It also has heat dissipation issues and a Class 4 Power Plant, allowing it to power high-draw weapons and defenses. Despite its lack of agility, it is one of the toughest small ships and is suitable for beginner deep-core asteroid mining and multi-role use.", "metadata": {"entity_name": "Viper Mk IV", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Viper Mk IV is manufactured by Faulcon DeLacy and has been in production since 3301. It is a combat ship with a cost of 437,930 CR and insurance of 21,897 CR. It has a delta-shaped hull, a landing pad size of Small, dimensions of 29.9m x 24.7m x 8.7m, and a single pilot seat. It does not support multicrew or fighter hangars. The ship has a hull mass of 190 t, armour of 270 with a hardness of 35, shields of 103 MJ, heat capacity of 209, and fuel capacity of 16 t. Its manoeuvrability is rated at 3, with a top speed of 271 m/s (default) or 314 m/s (upgraded), boost speed of 342 m/s (default) or 395 m/s (upgraded), and an unladen jump range of 10.36 ly (default) or 27.38 ly (upgraded). The cargo capacity is 18 t (default) and can be expanded to 54 t (max).", "metadata": {"entity_name": "Viper Mk IV", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Viper Mk IV has 2x Utility Mounts, 2x Small Hardpoints, and 2x Medium Hardpoints. Its internal compartments include 3x Class 1, 2x Class 2, 1x Class 3, and 2x Class 4, with 1x Class 3 Military Compartment reserved. The default loadout includes Pulse Lasers on the Small Hardpoints, and empty Medium Hardpoints. The default systems include Lightweight Alloys (Bulkhead, Class 1), Power Plant (Reactor Bay, Class 4), Thrusters (Thrusters Mounting, Class 4), Power Distributor (Power Coupling, Class 3), Sensors (Sensor Suite, Class 3), and Fuel Tank (Fuel Store, Class 4). Internal compartments include Cargo Racks, Shield Generator, and other systems.", "metadata": {"entity_name": "Viper Mk IV", "document_type": "ship", "chunk_type": "outfitting"}}