{"text": "The Keelback is a combat freighter manufactured by Lakon Spaceways, produced from 3301 to the present. It is advertised as a well-armed trader capable of hauling large cargoes without an escort, similar to the Type-10 Defender. It sacrifices cargo space for combat effectiveness but not as much as the Type-10. Compared to the Type-6 Transporter, it has 16t less cargo space, a higher cost, and a lower jump range, making it a lesser trader but still capable. It is the second-best ship in its price range for trading.", "metadata": {"entity_name": "Keelback", "document_type": "ship", "chunk_type": "overview"}}
{"text": "In combat, the Keelback has two Class 1 hardpoints and two additional Class 2 hardpoints. It has the lowest damage output compared to ships in its price range, such as the Asp Scout and Diamondback Explorer. However, it can mount a Fighter Hangar, significantly increasing its damage output. It has poor maneuverability and speed, making it ineffective at Supercruise interdicting. It can be a good Pirate or Bounty Hunter for commanders utilizing fighters and has decent space for loot.", "metadata": {"entity_name": "Keelback", "document_type": "ship", "chunk_type": "combat"}}
{"text": "As an explorer, the Keelback has a lower jump range than the Type-6 due to its greater mass and more limited compartment space, making it slightly less capable in this role. However, it excels in mining due to its two medium hardpoints, large cargo space, fighter bay for protection, and smaller size. It is one of the best and cheapest ships for mining and can be more appealing than ships like the Asp Explorer or Federal Dropship.", "metadata": {"entity_name": "Keelback", "document_type": "ship", "chunk_type": "exploration"}}
{"text": "The Keelback is an adequate multipurpose ship, capable of exploration, combat, and trading, but it capitalizes on its abilities in mining. Compared to similar ships like the Asp Scout, it generally performs better but has a much lower jump range. It has two Class 2 hardpoints on top near the cockpit and two Class 1 hardpoints on the bottom further back. It has a second pilot seat, making it compatible with Multicrew, and unique rotating engine pods that do not affect thruster performance.", "metadata": {"entity_name": "Keelback", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Keelback has a cost of 3,126,150 CR and insurance of 156,308 CR. It has dimensions of 49.7m x 40.3m x 14.9m, a hull mass of 180 t, and a mass lock factor of 8. It has an armour rating of 486 with an armour hardness of 45, shields of 99 MJ, and a heat capacity of 215. It has a fuel capacity of 16 t, a manoeuvrability rating of 2, a top speed of 202 m/s (default) or 231 m/s (upgraded), a boost speed of 303 m/s (default) or 344 m/s (upgraded), an unladen jump range of 10.94 ly (default) or 27.19 ly (upgraded), and a cargo capacity of 38 t (default) or 98 t (max).", "metadata": {"entity_name": "Keelback", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Keelback has 3x Utility Mounts, 2x Small Hardpoints, and 2x Medium Hardpoints. Its internal compartments include 1x Class 1, 2x Class 2, 1x Class 3, 1x Class 4, and 2x Class 5 compartments. It has no reserved compartments. Its default outfitting includes two Pulse Lasers (Class 1, Rating F) and empty medium hardpoints. Its utility mounts are also empty. Its bulkhead is Lightweight Alloys (Class 1, Rating I), and it has various other systems like Power Plant, Thrusters, Frame Shift Drive, Life Support, Power Distributor, Sensors, and Fuel Tank with their respective ratings and classes.", "metadata": {"entity_name": "Keelback", "document_type": "ship", "chunk_type": "outfitting"}}