{"text": "The Alliance Chieftain is a competitively priced heavy fighter manufactured by Lakon Spaceways, costing 19,382,250 CR. It is significantly cheaper than other similar ships like the Python, Federal Gunship, and Fer-de-Lance, while offering comparable capabilities. The ship features many internal compartments, allowing for equipment like shield cell banks and module reinforcements.", "metadata": {"entity_name": "Alliance Chieftain", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Alliance Chieftain is 68.1m long, 58.5m wide, and 19.9m tall, with a hull mass of 400 tons. It has a mass lock factor of 13, armour rating of 504, armour hardness of 65, shields of 162 MJ, and a heat capacity of 289. The ship has a fuel capacity of 16 tons, a top speed of 235 m/s (default) or 267 m/s (upgraded), a boost speed of 338 m/s (default) or 383 m/s (upgraded), and an unladen jump range of 9.59 ly (default) or 27.83 ly (upgraded). Its cargo capacity is 40 tons (default) or 120 tons (max).", "metadata": {"entity_name": "Alliance Chieftain", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Alliance Chieftain has 4 utility mounts, 3 small hardpoints, 1 medium hardpoint, and 2 large hardpoints. Its internal compartments include 1 Class 1, 2 Class 2, 1 Class 4, 1 Class 5, and 1 Class 6 compartment, with 3 Class 4 military compartments reserved.", "metadata": {"entity_name": "Alliance Chieftain", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Alliance Chieftain's default outfitting includes Pulse Lasers on its medium and one of its large hardpoints. Its utility mounts, small hardpoints, and the other large hardpoint are initially empty. The ship's bulkhead is made of Lightweight Alloys (Class 1, Grade C), and it has a Power Plant (Class 6, Grade E), Thrusters (Class 6, Grade E), Frame Shift Drive (Class 5, Grade E), Life Support (Class 5, Grade E), Power Distributor (Class 6, Grade E), Sensors (Class 4, Grade E), and a Fuel Tank (Class 4, Grade C). Its internal compartments include Cargo Racks, a Shield Generator, and empty slots for customization.", "metadata": {"entity_name": "Alliance Chieftain", "document_type": "ship", "chunk_type": "outfitting"}}