{"text": "The Beluga Liner is the largest ship in the Saud Kruger line after the Dolphin and Orca, designed for luxury passenger transport with a focus on comfort and maneuverability over speed and cargo capacity.", "metadata": {"entity_name": "Beluga Liner", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Beluga Liner features a Class 7 Frame Shift Drive and a 128-tonne Fuel Tank, providing an impressive travel range for long-distance cruises. It can also fit a Fighter Hangar for modest offensive capability.", "metadata": {"entity_name": "Beluga Liner", "document_type": "ship", "chunk_type": "overview"}}
{"text": "As a trading ship, the Beluga Liner has 368t of potential cargo space, which is relatively poor compared to other large ships like the Type-9 Heavy.", "metadata": {"entity_name": "Beluga Liner", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Beluga Liner is an interesting option for exploration, with a jump range of 40-50 ly when equipped with a Guardian Frame Shift Drive Booster. It offers ample internal space and the ability to equip a Fighter Hangar.", "metadata": {"entity_name": "Beluga Liner", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Beluga Liner performs poorly in combat due to its large size, weak shields, and ineffective hardpoint placement, making it vulnerable despite its Fighter Hangar.", "metadata": {"entity_name": "Beluga Liner", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Beluga Liner is highly specialized as a passenger liner but suffers from limitations such as heat management issues, a large size complicating docking, and a suboptimal shield generator.", "metadata": {"entity_name": "Beluga Liner", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Beluga Liner has dimensions of 209.1m x 131.6m x 38.6m, a hull mass of 950 tonnes, and a top speed of 197 m/s (default) or 230 m/s (upgraded).", "metadata": {"entity_name": "Beluga Liner", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Beluga Liner has a default cargo capacity of 44 tonnes, which can be expanded to a maximum of 370 tonnes.", "metadata": {"entity_name": "Beluga Liner", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Beluga Liner is manufactured by Saud Kruger and has been in production since 3302. It is a passenger liner with a cost of 84,532,780 CR and insurance of 4,226,639 CR.", "metadata": {"entity_name": "Beluga Liner", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Beluga Liner features 6x Utility Mounts and 5x Medium Hardpoints, with internal compartments including 1x Class 1, 4x Class 3, 1x Class 4, 2x Class 5, and 4x Class 6 compartments.", "metadata": {"entity_name": "Beluga Liner", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Beluga Liner's default outfitting includes Pulse Lasers on its medium hardpoints and various internal systems such as a Shield Generator, Cargo Racks, and Passenger Cabins.", "metadata": {"entity_name": "Beluga Liner", "document_type": "ship", "chunk_type": "outfitting"}}