{"text": "The Mandalay is an explorer ship manufactured by Zorgon Peterson, produced from 3310 to the present. It costs 17,639,220 CR and has an insurance value of 881,961 CR. The ship is optimized for SCO-capable frame shift drives, offering better fuel economy and ease of control compared to other ships, though with a lower top speed in SCO. Its maneuverability is comparable to the Diamondback Explorer. The Mandalay comes with a 32 t fuel tank and can equip a size 6 fuel scoop. The boarding ramp is under the cockpit, aiding in exobiological scanning, and the cockpit floor is transparent for clear planetary terrain visibility. The ship's design is influenced by the English Electric Lightning interceptor aircraft and was named after a species of spitting cobra native to Myanmar. It became available in early access with the Ascendancy update on 31 October 2024.", "metadata": {"entity_name": "Mandalay", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Mandalay has dimensions of 49.6m x 74.4m x 14.9m and a hull mass of 230 t. It features 2 pilot seats and supports multicrew. The ship's armor rating is 414 with an armor hardness of 55, shields of 268 MJ, and a heat capacity of 250. It has a top speed of 286 m/s (default) and 325 m/s (upgraded), a boost speed of 358 m/s (default) and 406 m/s (upgraded), and an unladen jump range of 31.10 ly (default) and 45.26 ly (upgraded). The cargo capacity is 40 t (default) and 154 t (max).", "metadata": {"entity_name": "Mandalay", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Mandalay has 4x Utility Mounts, 2x Small Hardpoints, and 4x Medium Hardpoints. It features 3x Class 1 Compartments, 1x Class 2 Compartment, 2x Class 3 Compartments, 2x Class 4 Compartments, 1x Class 5 Compartment, and 1x Class 6 Compartment. The default outfitting includes a Lightweight Alloys bulkhead (Class 1, Grade C), a Power Plant reactor bay (Class 5, Grade E), Thrusters (Class 5, Grade E), a Frame Shift Drive (SCO) (Class 5, Grade C), Life Support environment control (Class 4, Grade E), a Power Distributor power coupling (Class 5, Grade E), Sensors (Class 5, Grade E), and a Fuel Tank (Class 5, Grade C). Internal compartments include a Cargo Rack [x32] (Class 5, Grade E), a Shield Generator (Class 5, Grade E), a Cargo Rack [x8] (Class 3, Grade E), and various other compartments.", "metadata": {"entity_name": "Mandalay", "document_type": "ship", "chunk_type": "outfitting"}}