{"text": "The Orca is Saud Kruger's middle-of-the-road passenger liner, offering greater passenger capacity than the Dolphin but less than the Beluga Liner. Despite its size, it exceeds the limits of medium Landing Pads, making it a large ship. Its sleeker design enhances maneuverability, achieving a higher jump range than comparable ships. The Orca's handling is superior to its official ratings, featuring high turn rates, acceleration, and speed, making it adept at strafing and ramming. However, its small Power Plant and limited hardpoint capacity hinder its combat effectiveness. Its large size and mediocre shields make it an easy target, though its armor can be reinforced for combat roles. The Orca's hardpoints are all located on the underside, limiting its combat versatility. Despite these drawbacks, skilled pilots and engineering can make it formidable. Its impressive jump range of up to 36 ly before engineering makes it a solid choice for long-range passenger transport and exploration, though it is not suitable for trading or mining due to its high cost and low cargo capacity.", "metadata": {"entity_name": "Orca", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Orca, manufactured by Saud Kruger, has been in production since 3300. It is classified as a Passenger Liner and costs 48,539,887 CR, with insurance priced at 2,426,994 CR. The ship measures 130.4m x 50.8m x 22.7m and requires a Large landing pad. It features two pilot seats, supports Multicrew, and has a hull mass of 290 t. The Orca's armor rating is 396 with a hardness of 55, and its shields are rated at 233 MJ. Its heat capacity is 262, and it has a fuel capacity of 32 t. The ship's maneuverability rating is 1, with a top speed of 308 m/s (default) or 348 m/s (upgraded), and a boost speed of 390 m/s (default) or 441 m/s (upgraded). The default unladen jump range is 10.52 ly, which can be upgraded to 36.17 ly. Its cargo capacity ranges from 72 t (default) to 194 t (max).", "metadata": {"entity_name": "Orca", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Orca's default outfitting includes 4x Utility Mounts, 2x Medium Hardpoints, and 1x Large Hardpoint. It has a variety of internal compartments: 1x Class 1, 2x Class 2, 1x Class 3, 1x Class 4, 3x Class 5, and 1x Class 6. The default systems include Lightweight Alloys for the bulkhead, a Power Plant for the reactor bay, a Frame Shift Drive, Life Support for environment control, a Power Distributor, Sensors, and a Fuel Tank. The internal compartments are equipped with Cargo Racks of varying sizes, a Shield Generator, Supercruise Assist, and a Passenger Cabin (PAS).", "metadata": {"entity_name": "Orca", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Orca's default medium hardpoints are equipped with Pulse Lasers (L) rated F, with a maximum class of 2. The utility mounts are initially empty, with a maximum class of 0. The bulkhead is fitted with Lightweight Alloys rated I, with a maximum class of 8. The reactor bay houses a Power Plant rated E, with a maximum class of 5. The Frame Shift Drive is rated E, with a maximum class of 5. Environment control is managed by Life Support rated E, with a maximum class of 6. The Power Distributor is rated E, with a maximum class of 5. The sensor suite is rated E, with a maximum class of 4. The fuel store is a Fuel Tank rated C, with a maximum class of 5. The internal compartments include various Cargo Racks and a Shield Generator, with ratings and classes varying by compartment size.", "metadata": {"entity_name": "Orca", "document_type": "ship", "chunk_type": "hardpoints"}}