{"text": "The Type-8 Transporter is a medium-sized freighter manufactured by Lakon Spaceways, designed for cargo hauling with a maximum capacity of 406 tons. It features retractable engines for medium landing pads and has a default jump range of 17.55 ly when laden and 23.42 ly when unladen. The ship is optimized for Frame Shift Drive (SCO) with improved hull stress capacity and interlaced polymer drive insulation. It has 6 hardpoints: 5 small and 1 medium, and 9 optional internal compartments. The Type-8 can be used as a multi-purpose ship, including mining and exploration with engineering upgrades. It was released in early access on August 7, 2024, with the standard version costing 16,520 ARX and the Stellar Edition costing 33,000 ARX. The free version for in-game credits was released on November 28, 2024.", "metadata": {"entity_name": "Type-8 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-8 Transporter has dimensions of 99.34 m x 59.96 m x 25.63 m, a hull mass of 400 t, and a mass lock factor of 18. It features 792 armor with a hardness of 58, shields of 122 MJ, and a heat capacity of 236. The ship has a fuel capacity of 32 t, a top speed of 201 m/s (default) or 228 m/s (upgraded), a boost speed of 342 m/s (default) or 387 m/s (upgraded), and an unladen jump range of 23.42 ly (default) or 29.37 ly (upgraded). The cargo capacity is 176 t (default) or 406 t (max).", "metadata": {"entity_name": "Type-8 Transporter", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Type-8 Transporter has 4 utility mounts, 5 small hardpoints, and 1 medium hardpoint. It includes 1 Class 1, 1 Class 2, 1 Class 4, 2 Class 5, 3 Class 6, and 1 Class 7 internal compartments. The default systems include Pulse Lasers on the small hardpoints, Lightweight Alloys bulkhead, Power Plant, Thrusters, Frame Shift Drive (SCO), Life Support, Power Distributor, Sensors, and Fuel Tank. The internal compartments include Cargo Racks and optional systems like Shield Generator and Supercruise Assist.", "metadata": {"entity_name": "Type-8 Transporter", "document_type": "ship", "chunk_type": "outfitting"}}