{"text": "The Python Mk II is a combat ship manufactured by Faulcon DeLacy, produced from 3310 to the present. It costs 67,527,361 CR and has an insurance value of 3,376,368 CR. The ship is designed for combat activities such as Piracy, Bounty Hunting, Assassination, and Xeno Hunting. It comes in two variants: Standard and Stellar, with the Stellar variant pre-equipped with four Multi-Cannons and two Pulse Lasers. The Python Mk II has six hardpoint slots, including four Class 3 and two Class 2, making it highly lethal in combat. However, its cargo capacity of 96 t is significantly less than the Mk I's 294 t, making it less suitable for trading or mining. The Mk II has a higher default unladen jump range of 18.11 ly compared to the Mk I's 8.25 ly, due to its preinstalled 5C SCO-capable Frame Shift Drive. It was designed for supercruise overcharge, offering better handling, less thermal load, and improved acceleration and deceleration. The Python Mk II was added to Elite Dangerous in 2024, with early access for Elite partners on 1 May 2024 and general availability on 7 August 2024.", "metadata": {"entity_name": "Python Mk II", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Python Mk II has dimensions of 88.4m x 67.5m x 17.3m and a hull mass of 450 t. It features 2 pilot seats, supports multicrew, and has a mass lock factor of 17. The ship's armor rating is 504 with a hardness of 70, and it has shields of 316 MJ. Its heat capacity is 260, and it has a fuel capacity of 16 t. The Python Mk II has a maneuverability rating of 4, with a top speed of 261 m/s (default) and 297 m/s (upgraded), and a boost speed of 352 m/s (default) and 400 m/s (upgraded). Its unladen jump range is 18.11 ly (default) and 26.71 ly (upgraded), with a cargo capacity of 10 t (default) and 96 t (max).", "metadata": {"entity_name": "Python Mk II", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Python Mk II's outfitting includes 6 utility mounts, 2 medium hardpoints, and 4 large hardpoints. It has internal compartments consisting of 2 Class 1, 1 Class 2, 1 Class 3, 1 Class 4, and 1 Class 6 compartments. The default loadout includes Pulse Lasers (Class 1, Grade F) in the medium hardpoints and empty slots in the large hardpoints. Utility mounts are also empty by default. The ship's bulkhead is equipped with Lightweight Alloys (Class 1, Grade C), and it features a Power Plant (Class 6, Grade E), Thrusters (Class 6, Grade E), a Frame Shift Drive (SCO, Class 5, Grade C), Life Support (Class 4, Grade E), a Power Distributor (Class 6, Grade E), Sensors (Class 5, Grade E), a Fuel Tank (Class 4, Grade C), and a Shield Generator (Class 6, Grade E). Additional internal compartments include empty slots and a Cargo Rack (Class 1, Grade E).", "metadata": {"entity_name": "Python Mk II", "document_type": "ship", "chunk_type": "outfitting"}}