{"text": "The Mamba is a combat ship manufactured by Zorgon Peterson, produced from 3304 to the present. It costs 55,867,041 CR and has an insurance value of 2,793,352 CR. The Mamba is designed for speed and heavy firepower, making it suitable for bounty hunting and anti-xeno operations. It features a unique hardpoint layout with one huge, two large, and two small hardpoints, all located on the dorsal surface. The ship has a low heat threshold but compensates with a higher heat dissipation rate. Its maximum cargo capacity is 64t, and it has a default jump range of 6.79 ly, which can be upgraded to 20.53 ly. The Mamba has two pilot seats, allowing for multicrew capability, and its internal compartments include a mix of class 1 to class 5 compartments.", "metadata": {"entity_name": "Mamba", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Mamba has dimensions of 72.2m x 50.1m x 11.4m and a hull mass of 250 t. It features 414 armor with a hardness of 70, shields of 244 MJ, and a heat capacity of 165. The ship's fuel capacity is 8 t, and it has a default top speed of 316 m/s, which can be upgraded to 361 m/s. Its boost speed is 387 m/s by default and can be upgraded to 445 m/s. The Mamba's maneuverability rating is 3, and it has a cargo capacity of 20 t by default, which can be increased to 66 t.", "metadata": {"entity_name": "Mamba", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Mamba's default outfitting includes six utility mounts, two small hardpoints, two large hardpoints, and one huge hardpoint. Its internal compartments consist of one class 1, two class 2, one class 3, one class 4, and one class 5 compartment. The ship's default loadout includes lightweight alloys for bulkhead, a power plant for the reactor bay, thrusters for thrusters mounting, a frame shift drive, life support for environment control, a power distributor, sensors, a fuel tank, a cargo rack, a shield generator, and a supercruise assist.", "metadata": {"entity_name": "Mamba", "document_type": "ship", "chunk_type": "outfitting"}}