{"text": "The Asp Scout is a multirole ship manufactured by Lakon Spaceways, produced from 3301 to the present. It is priced at 3,961,150 CR with an insurance cost of 198,058 CR. The ship is designed as a cheaper alternative to the Asp Explorer but lacks the Explorer's overall capability, making it a less optimal choice for any specific role. Its combat performance is poor due to weak shields and armor, and its hardpoints are not impressive. However, it boasts high maneuverability, making it evasive and capable of keeping fixed mounts on targets. Despite this, its limited utility mounts hinder its potential as a stealth ship. The Asp Scout has a cargo capacity of up to 74t, making it an inefficient trader compared to other ships like the Type-6 Transporter and Dolphin. As an explorer, it has a middling jump range of 31 ly without engineering, which is surpassed by several cheaper ships. Overall, the Asp Scout does not excel in any field but can be a viable option for commanders seeking a multipurpose ship with better maneuverability than the Keelback. The ship features two pilot seats and is multicrew compatible. It has a single centerline grouping of engines, making it shorter and wider than the Asp Explorer. The default load-out includes various hardpoints and internal compartments.", "metadata": {"entity_name": "Asp Scout", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Asp Scout has dimensions of 54.8m x 59.4m x 17.0m, with a hull mass of 150 t and a mass lock factor of 8. It features armor with a rating of 324 and hardness of 52, along with shields of 105 MJ. The ship's heat capacity is 210, and it has a fuel capacity of 16 t. Its maneuverability is rated at 5, with a top speed of 223 m/s (default) or 225 m/s (upgraded), and a boost speed of 304 m/s (default) or 348 m/s (upgraded). The unladen jump range is 11.59 ly (default) or 31.47 ly (upgraded), with a cargo capacity of 16 t (default) or 74 t (max).", "metadata": {"entity_name": "Asp Scout", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Asp Scout is equipped with 2x Utility Mounts, 2x Small Hardpoints, and 2x Medium Hardpoints. Its internal compartments include 1x Class 1, 2x Class 2, 2x Class 3, 1x Class 4, and 1x Class 5 compartments. The default load-out features various systems such as Pulse Lasers (Class 1, Rating F) on the small hardpoints, and empty medium hardpoints. The bulkhead is equipped with Lightweight Alloys (Class 1, Rating I), and the reactor bay, thrusters mounting, frame shift drive housing, environment control, power coupling, and sensor suite are all rated E with respective classes of 4, 4, 4, 3, 4, and 4. The fuel store is rated C (Class 4), and internal compartments include systems like Cargo Racks, Shield Generator, Supercruise Assist, and PAS.", "metadata": {"entity_name": "Asp Scout", "document_type": "ship", "chunk_type": "outfitting"}}