{"text": "The Federal Corvette is a combat-focused ship manufactured by Core Dynamics, produced from 3301 to the present. It is the third largest ship on the private market, with a cost of 187,969,450 CR and insurance of 9,398,473 CR. It is specialized for combat and is one of the strongest ships in a firefight, with high damage output and mobility. It has better armor than the Imperial Cutter but a weaker shield due to its Class 7 Shield Generator. Its main downsides are its poor jump range and lower defenses, but it excels in offensive capabilities and is one of the best Pirate and Bounty Hunting vessels.", "metadata": {"entity_name": "Federal Corvette", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Federal Corvette has dimensions of 167.8m x 87.2m x 28.3m and can accommodate 3-4 pilots with multicrew support. It has a hull mass of 900 t, armor of 666 with a hardness of 70, shields of 519 MJ, and a heat capacity of 333. It has a fuel capacity of 32 t, a top speed of 198 m/s (default) or 232 m/s (upgraded), a boost speed of 257 m/s (default) or 302 m/s (upgraded), and an unladen jump range of 6.31 ly (default) or 21.15 ly (upgraded). Its cargo capacity is 76 t (default) or 618 t (max).", "metadata": {"entity_name": "Federal Corvette", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Federal Corvette features 8 utility mounts, 2 small hardpoints, 2 medium hardpoints, 1 large hardpoint, and 2 huge hardpoints. It also has internal compartments including 1 Class 1, 1 Class 3, 2 Class 4, 2 Class 5, 2 Class 6, and 3 Class 7 compartments, with 2 Class 5 Military Compartments reserved.", "metadata": {"entity_name": "Federal Corvette", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Federal Corvette's default outfitting includes two small hardpoints that are initially empty, two medium hardpoints with Pulse Lasers (L) rated F, Class 1, and a large hardpoint that is initially empty. It also has eight utility mounts that are initially empty.", "metadata": {"entity_name": "Federal Corvette", "document_type": "ship", "chunk_type": "hardpoints"}}
{"text": "The Federal Corvette's default outfitting includes a Lightweight Alloys bulkhead rated I, Class 1, a Power Plant rated E, Class 8, Thrusters rated E, Class 7, a Frame Shift Drive rated E, Class 6, Life Support rated E, Class 5, a Power Distributor rated E, Class 8, Sensors rated E, Class 8, and a Fuel Tank rated C, Class 5.", "metadata": {"entity_name": "Federal Corvette", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Federal Corvette's internal compartments include a Shield Generator rated E, Class 7, a Cargo Rack [x64] rated E, Class 6, and several empty compartments of varying classes. It also has a Supercruise Assist rated E, Class 1, and a (PAS) rated I, Class 1.", "metadata": {"entity_name": "Federal Corvette", "document_type": "ship", "chunk_type": "internal_compartments"}}