{"text": "The Dolphin is a passenger liner manufactured by Saud Kruger, produced from 3303 to present. It is one of the three Saud Kruger line of ships, along with the Orca and Beluga Liner. It has a cost of 1,337,330 CR and insurance of 66,867 CR.", "metadata": {"entity_name": "Dolphin", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Dolphin is capable of carrying Luxury Cabins and focuses on Passenger Missions. It has 84T of cargo space available for trading and a higher jump range, making it suitable for Rare Goods trading or long-range transport.", "metadata": {"entity_name": "Dolphin", "document_type": "ship", "chunk_type": "overview"}}
{"text": "In combat, the Dolphin has Sidewinder grade offenses, mediocre shields and armour, but better mobility and hardpoint placement compared to the Type-6 Transporter. Upgrading Bulkheads reduces its jump range significantly.", "metadata": {"entity_name": "Dolphin", "document_type": "ship", "chunk_type": "overview"}}
{"text": "As an explorer, the Dolphin is a low-budget option with a potential jump range of 35 ly before engineering. It has excellent heat management but limited internal compartments, making it less suitable for long-term expeditions.", "metadata": {"entity_name": "Dolphin", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Dolphin excels in passenger missions, with one slot for a Luxury Passenger Cabin and high jump range, making it great for long-range passenger missions. However, it has low compartment space, making it less suitable for bulk missions.", "metadata": {"entity_name": "Dolphin", "document_type": "ship", "chunk_type": "overview"}}
{"text": "Overall, the Dolphin is a stylish exploration ship, efficient for transporting luxury VIP passengers, and a reasonable alternative to the trade-focused Type-6 Transporter. However, combat activities should be avoided.", "metadata": {"entity_name": "Dolphin", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Dolphin's cockpit is located at the front of the ship, featuring a tinted canopy that obscures the interior. The two small hardpoints are placed directly below the cockpit, on the underside of the ship.", "metadata": {"entity_name": "Dolphin", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Dolphin has dimensions of 51.8m x 20.8m x 8.8m, a hull mass of 140 t, armour rating of 198, armour hardness of 35, shields of 143 MJ, heat capacity of 245, fuel capacity of 16 t, manoeuvrability of 3, top speed of 258 m/s (default) or 290 m/s (upgraded), boost speed of 361 m/s (default) or 406 m/s (upgraded), unladen jump range of 10.67 ly (default) or 35.10 ly (upgraded), and cargo capacity of 14 t (default) or 88 t (max).", "metadata": {"entity_name": "Dolphin", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Dolphin has 3x Utility Mounts and 2x Small Hardpoints. It has internal compartments of 2x Class 1, 3x Class 2, 1x Class 3, 2x Class 4, and 1x Class 5.", "metadata": {"entity_name": "Dolphin", "document_type": "ship", "chunk_type": "outfitting"}}