{"text": "The Cobra Mk IV is a multirole combat ship manufactured by Faulcon DeLacy, produced from 3301 to the present. It is similar to the Viper Mk IV but with better armor, compartments, and damage at the cost of reduced mobility. It has impressive shielding and armor, high damage output, and can hold its own against larger ships. However, it is slower and less maneuverable, with a rating of 3. It has one more Class 1 hardpoint than the Mk III, with adjusted hardpoint placements. It is exclusively for players who upgraded to Elite Dangerous: Horizons during its first year. It has a cargo capacity of up to 92t and the most internal bays of any small ship, making it viable for traders and combat. As an explorer, it has a lower jump range due to its greater mass. It has two pilot seats and can support multicrew. It is highly customizable through the Outfitting menu of Station Services.", "metadata": {"entity_name": "Cobra Mk IV", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Cobra Mk IV has dimensions of 33.1m x 48.1m x 8.6m, a hull mass of 210t, and a mass lock factor of 8. It has an armor rating of 216 with a hardness of 35, shields of 125 MJ, and a heat capacity of 228. It has a fuel capacity of 16t, a top speed of 200 m/s (default) or 228 m/s (upgraded), a boost speed of 299 m/s (default) or 342 m/s (upgraded), and an unladen jump range of 9.44 ly (default) or 24.91 ly (upgraded). It has a cargo capacity of 34t (default) or 92t (max).", "metadata": {"entity_name": "Cobra Mk IV", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Cobra Mk IV has 2x Utility Mounts, 3x Small Hardpoints, and 2x Medium Hardpoints. It has 2x Class 1 Compartments, 2x Class 2 Compartments, 2x Class 3 Compartments, and 4x Class 4 Compartments. It has a default loadout with various systems and ratings.", "metadata": {"entity_name": "Cobra Mk IV", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Cobra Mk IV's default small hardpoints are empty with a max class of 1. Its default medium hardpoints are Pulse Lasers (L) with a rating of F and a max class of 2. Its utility mounts are empty with a max class of 0. Its bulkhead is Lightweight Alloys with a rating of I and a max class of 8. Its reactor bay is a Power Plant with a rating of E and a max class of 4. Its thrusters mounting is Thrusters with a rating of E and a max class of 4. Its frame shift drive housing is a Frame Shift Drive with a rating of E and a max class of 4. Its environment control is Life Support with a rating of E and a max class of 3. Its power coupling is a Power Distributor with a rating of E and a max class of 3. Its sensor suite is Sensors with a rating of E and a max class of 3. Its fuel store is a Fuel Tank with a rating of C and a max class of 4.", "metadata": {"entity_name": "Cobra Mk IV", "document_type": "ship", "chunk_type": "hardpoints"}}
{"text": "The Cobra Mk IV's internal compartments include a Shield Generator with a rating of E and a max class of 4, Cargo Racks with varying sizes and ratings, an Advanced Docking Computer with a rating of E and a max class of 1, Supercruise Assist with a rating of E and a max class of 1, and a PAS with a rating of I and a max class of 1.", "metadata": {"entity_name": "Cobra Mk IV", "document_type": "ship", "chunk_type": "internal_compartments"}}