{"text": "The Imperial Eagle is a combat ship manufactured by Gutamaya, produced from 3199 to the present. It costs 110,830 CR with an insurance value of 5,542 CR. The ship is designed for combat and lacks expansion capabilities.", "metadata": {"entity_name": "Imperial Eagle", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Imperial Eagle has dimensions of 31.2m x 34.7m x 7.1m, a hull mass of 50 tons, and a mass lock factor of 6. It features armour with a rating of 108 and hardness of 28, along with shields of 104 MJ. The ship has a heat capacity of 163, a fuel capacity of 4 tons, and a cargo capacity of 2 tons (expandable to 20 tons). It has a top speed of 302 m/s (347 m/s upgraded), a boost speed of 403 m/s (462 m/s upgraded), and an unladen jump range of 8.22 ly (25.37 ly upgraded). The ship has a manoeuvrability rating of 5 and can accommodate one pilot with no multicrew or fighter hangar capabilities.", "metadata": {"entity_name": "Imperial Eagle", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Imperial Eagle features 1 utility mount, 2 small hardpoints, and 1 medium hardpoint. It has 4 class 1 compartments, 1 class 2 compartment, and 1 class 3 compartment, with 1 class 2 military compartment reserved.", "metadata": {"entity_name": "Imperial Eagle", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Imperial Eagle's default outfitting includes two pulse lasers (class 1, rating F) on the small hardpoints, an empty medium hardpoint, and an empty utility mount. It is equipped with lightweight alloys (class 1, rating I) for bulkhead, a power plant (class 3, rating E) for the reactor bay, thrusters (class 3, rating E) for thrusters mounting, and a frame shift drive (class 3, rating E) for the frame shift drive housing. The environment control uses life support (class 1, rating E), power coupling uses a power distributor (class 2, rating E), and the sensor suite uses sensors (class 2, rating E). The fuel store uses a fuel tank (class 2, rating C). Internal compartments include a shield generator (class 3, rating E), cargo rack (class 1, rating E), empty compartments (class 1 and 2), advanced docking computer (class 1, rating E), supercruise assist (class 1, rating E), and a PAS (class 1, rating I).", "metadata": {"entity_name": "Imperial Eagle", "document_type": "ship", "chunk_type": "outfitting"}}