{"text": "The Krait Phantom is a variation of the Krait Mk II, featuring a more streamlined design, revamped thruster configuration and internal layout, and emphasis on speed and manoeuvrability. To the effect of the latter, while the Phantom has the same number of optional compartment slots as the Mk II, the single Class 4 compartment is changed to a Class 3 compartment, and one of the two Class 6 compartments is changed to a Class 5. In addition, Fighter Hangar compatibility, one Class 3 hardpoint, and one of the two Multicrew seats are removed. These changes result in the Phantom shaving off 50 tonnes of mass, allowing it to have a slightly greater jump range and 21 m/s more default speed and boost speed than the Mk II. At the same time, the Phantom's nominal armour, nominal shield strength, and maximum cargo carrying capacity are reduced, and it also has a marginally taller profile compared to the Mk II.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "overview"}}
{"text": "In combat, although the Krait Phantom loses some of the Krait Mk II's damage output, durability, and its Fighter Hangar, its higher mobility allows it to become an agile and modestly successful fighter vessel. The Phantom still has two Class 2 and two Class 3 hardpoints, more than enough firepower to be a serious threat to large ships, and when combined with its high mobility, the Phantom can be a very deadly vessel in skilled hands. Overall, the Phantom is a highly effective Pirate and Bounty Hunter, and a solid choice for anti-Thargoid combat.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Krait Phantom has somewhat less utility as a trader than the Mk II due to its lower cargo capacity, though it is still a high amount for a medium ship and its significant jump range can offset this drawback. As a miner, the Phantom also under-performs the Mk II since its reduced hardpoints mean fewer mining tools can be equipped, and its lack of a Fighter Hangar means miners cannot bring Ship-Launched Fighters for defence.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Phantom excels as an explorer, with jump ranges slightly higher than the Asp Explorer depending on outfitting and Engineering, and more internal compartment space for a wider variety of modules. The one notable weakness that the Phantom has compared to the Asp Explorer is its substantially higher purchase price, which makes it more difficult for pilots with limited funds to obtain compared to the latter ship, which remains an effective exploration option.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Krait Phantom's two Class 3 hardpoints are mounted on the vessel's dorsal surface, behind and flanking the cockpit. The two Class 2 hardpoints are mounted on the underside of the front-most points of the hull, on either side of the cockpit and slightly forward. This layout is identical to the Krait Mk II's, minus the latter's third central Class 3 hardpoint. The primary pilot's seat is located squarely along the centerline of the ship, but the cockpit itself extends from the hull and is slightly under-slung, affording a wide, unobstructed frontal view reminiscent of Lakon Spaceways ships. The single secondary pilot seat for Multicrew is placed behind the primary seat.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Krait Phantom is a multirole ship manufactured by Faulcon DeLacy, produced from 3304 to the present. It costs 37,472,254 CR with an insurance value of 1,873,613 CR.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Krait Phantom has dimensions of 73.3m x 72.0m x 14.6m, with 2 pilot seats and multicrew capability. It has a hull mass of 270 t, a mass lock factor of 17, armour of 324 with a hardness of 55, shields of 260 MJ, a heat capacity of 300, and a fuel capacity of 32 t. It has a manoeuvrability rating of 3, with a top speed of 256 m/s (default) and 290 m/s (upgraded), a boost speed of 358 m/s (default) and 406 m/s (upgraded), and an unladen jump range of 9.78 ly (default) and 34.79 ly (upgraded). Its cargo capacity is 82 t (default) and 190 t (max).", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Krait Phantom has 4x Utility Mounts, 2x Medium Hardpoints, and 2x Large Hardpoints. Its internal compartments include 1x Class 1, 1x Class 2, 3x Class 3, 3x Class 5, and 1x Class 6.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Krait Phantom's default outfitting includes two Pulse Laser (L) systems with a rating of F and a class of 1, which can be upgraded to a maximum class of 2.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Krait Phantom's default outfitting includes two empty large hardpoints with a maximum class of 3.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Krait Phantom's default outfitting includes four empty utility mounts with a maximum class of 0.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Krait Phantom's default outfitting includes a Lightweight Alloys bulkhead with a rating of C and a class of 1, which can be upgraded to a maximum class of 8.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Krait Phantom's default outfitting includes a Power Plant reactor bay with a rating of E and a class of 7, which can be upgraded to a maximum class of 7.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Krait Phantom's default outfitting includes Thrusters with a rating of E and a class of 6, which can be upgraded to a maximum class of 6.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Krait Phantom's default outfitting includes a Frame Shift Drive with a rating of E and a class of 5, which can be upgraded to a maximum class of 5.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Krait Phantom's default outfitting includes Life Support with a rating of E and a class of 4, which can be upgraded to a maximum class of 4.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Krait Phantom's default outfitting includes a Power Distributor with a rating of E and a class of 7, which can be upgraded to a maximum class of 7.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Krait Phantom's default outfitting includes Sensors with a rating of E and a class of 6, which can be upgraded to a maximum class of 6.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Krait Phantom's default outfitting includes a Fuel Tank with a rating of C and a class of 5, which can be upgraded to a maximum class of 5.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Krait Phantom's default internal compartments include a Shield Generator with a rating of E and a class of 6, which can be upgraded to a maximum class of 6.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Krait Phantom's default internal compartments include three Cargo Racks [x32] with a rating of E and a class of 5, which can be upgraded to a maximum class of 5.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Krait Phantom's default internal compartments include a Cargo Rack [x16] with a rating of E and a class of 4, which can be upgraded to a maximum class of 5.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Krait Phantom's default internal compartments include three empty compartments with a maximum class of 3.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Krait Phantom's default internal compartments include a Cargo Rack [x2] with a rating of E and a class of 1, which can be upgraded to a maximum class of 2.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Krait Phantom's default internal compartments include Supercruise Assist with a rating of E and a class of 1, which can be upgraded to a maximum class of 1.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Krait Phantom's default internal compartments include a (PAS) with a rating of I and a class of 1, which can be upgraded to a maximum class of 1.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "outfitting"}}