{"text": "The Cobra Mk III is a popular multirole ship manufactured by Faulcon DeLacy, produced from 3100 to the present. It is a small, low-cost vessel capable of performing well in various roles, serving as a cheaper alternative to the Python. The Cobra Mk III is potent in combat with impressive damage output and defenses for its price, making it suitable for bounty hunting and pirating. It has a large cargo bay, making it viable for pirates, and its carrying capacity is more than double that of the Hauler and Adder. The ship is also a good and affordable exploration ship due to its sizeable fuel tank and internal compartments. As a miner, the Mk III is very effective due to its additional hardpoints, compartments, and cargo space. The weapon hardpoints are located on the upper and lower surfaces of the ship, with two Class 2 hardpoints in front of the cockpit and two Class 1 hardpoints on the underside.", "metadata": {"entity_name": "Cobra Mk III", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Cobra Mk III has dimensions of 27.1m x 44.0m x 7.9m, a hull mass of 180 t, and a mass lock factor of 8. It has an armor rating of 216 with an armor hardness of 35, shields of 92 MJ, and a heat capacity of 225. The ship has a fuel capacity of 16 t, a manoeuvrability rating of 5, a top speed of 282 m/s (default) or 325 m/s (upgraded), a boost speed of 403 m/s (default) or 464 m/s (upgraded), and an unladen jump range of 11.16 ly (default) or 28.55 ly (upgraded). The cargo capacity is 18 t (default) or 64 t (max).", "metadata": {"entity_name": "Cobra Mk III", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Cobra Mk III has 2x Utility Mounts, 2x Small Hardpoints, and 2x Medium Hardpoints. It also has 2x Class 1 Compartments, 3x Class 2 Compartments, and 3x Class 4 Compartments. The default load-out includes Pulse Lasers on the medium hardpoints and empty slots on the small hardpoints and utility mounts.", "metadata": {"entity_name": "Cobra Mk III", "document_type": "ship", "chunk_type": "outfitting"}}