{"text": "The Federal Gunship is a heavily armored and armed combat ship manufactured by Core Dynamics, produced from 3301 to the present. It features seven weapon hardpoints and four utility mounts, making it one of four medium-sized ships capable of equipping a Fighter Hangar. The ship is known for its potential to inflict devastating damage but has below-average maneuverability and is the slowest medium-sized ship overall.", "metadata": {"entity_name": "Federal Gunship", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Federal Gunship has dimensions of 75.5m x 53.3m x 22.5m, with a hull mass of 580 tons and an armour rating of 630 with an armour hardness of 60. It features 186 MJ of shields, a heat capacity of 325, and a fuel capacity of 16 tons. The ship has a top speed of 171 m/s (default) or 197 m/s (upgraded), a boost speed of 282 m/s (default) or 325 m/s (upgraded), and an unladen jump range of 6.66 ly (default) or 19.40 ly (upgraded). Its cargo capacity is 16 tons (default) and can be expanded to 170 tons (max).", "metadata": {"entity_name": "Federal Gunship", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Federal Gunship's weapon hardpoints include two Class 1 hardpoints on top of the ship next to the heat vents, two Class 2 hardpoints in the bumpers on either side of the cockpit, one Class 3 and two Class 2 hardpoints on the underside of the ship about a third of the length from the front. The primary pilot's seat is set along the centerline of the vessel, and the secondary Multicrew pilot seat lies behind and above it, with an offset to the left.", "metadata": {"entity_name": "Federal Gunship", "document_type": "ship", "chunk_type": "hardpoints"}}
{"text": "The Federal Gunship's outfitting includes 4x Utility Mounts, 2x Small Hardpoints, 4x Medium Hardpoints, and 1x Large Hardpoint. Internal compartments consist of 1x Class 1 Compartment, 2x Class 2 Compartments, 1x Class 5 Compartment, and 2x Class 6 Compartments. Additionally, there are 3x Class 4 Military Compartments reserved.", "metadata": {"entity_name": "Federal Gunship", "document_type": "ship", "chunk_type": "outfitting"}}