{"text": "The Imperial Courier is a multirole ship manufactured by Gutamaya, produced from 3145 to the present. It is a small, agile fighter known for its balance of firepower, shielding, and evasiveness. The ship's agility is comparable to the Viper Mk III and Mk IV, with a faster pitch and yaw than the Mk III but a slower roll than the Mk IV. It has a lower boost speed than the Mk III and a lower mass, which causes it to drop from boost speed faster. The Imperial Courier's stock shield generator provides better protection than those on the Viper Mk III and Cobra Mk III, though it is outperformed by the Cobra Mk V and Vulture. Unlike the Vulture, the Courier does not suffer from power management issues, making it easier to equip shield boosters and cell banks. It can be outfitted for exploration with a nominal jump range of 40-50 ly using a 3A Increased Range Deep Charge Frame Shift Drive. Its low mass allows for a Size 1 Shield Generator, providing adequate protection against light collisions. However, its small fuel tank makes long-distance exploration challenging due to frequent refueling needs and impractical supercruise overcharge use. The Courier can be outfitted with Enhanced Performance Thrusters to become one of the fastest ships in the game, achieving speeds up to 682 m/s and boost speeds up to 885 m/s with D-rated and undersized modules. Its speed is reduced when equipped with A-rated weighted Core Internal modules or engineering effects that increase module mass. The ship has one Class 2 hardpoint at the front of each engine nacelle and one underneath the nose, along with four utility mounts, one on top of each nacelle and two behind the cockpit canopy. The cockpit has a single pilot seat, making it incompatible with multicrew. The default load-out can be highly customized through the Outfitting menu of Station Services.", "metadata": {"entity_name": "Imperial Courier", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Imperial Courier has the following specifications: dimensions of 42.1m x 27.4m x 7.1m, a hull mass of 35 t, armour of 144 with a hardness of 30, shields of 230 MJ, heat capacity of 230, fuel capacity of 8 t, manoeuvrability rating of 4, top speed of 277 m/s (default) or 325 m/s (upgraded), boost speed of 380 m/s (default) or 441 m/s (upgraded), unladen jump range of 7.81 ly (default) or 33.68 ly (upgraded), and cargo capacity of 12 t (default) or 34 t (max). It has 4x Utility Mounts and 3x Medium Hardpoints, with internal compartments including 3x Class 1, 3x Class 2, and 2x Class 3. The ship costs 2,542,931 CR with an insurance value of 127,147 CR.", "metadata": {"entity_name": "Imperial Courier", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Imperial Courier's default outfitting includes: 3x Medium Hardpoints with Pulse Lasers (L) rated F Class 1, 4x Utility Mounts all empty, Bulkhead with Lightweight Alloys rated C Class 1, Reactor Bay with Power Plant rated E Class 4, Thrusters Mounting with Thrusters rated E Class 3, Frame Shift Drive Housing with Frame Shift Drive rated E Class 3, Environment Control with Life Support rated E Class 1, Power Coupling with Power Distributor rated E Class 3, Sensor Suite with Sensors rated E Class 2, Fuel Store with Fuel Tank rated C Class 3, and Internal Compartments including Cargo Racks, Shield Generator, Advanced Docking Computer, Supercruise Assist, and PAS.", "metadata": {"entity_name": "Imperial Courier", "document_type": "ship", "chunk_type": "outfitting"}}