{"text": "The Sidewinder Mk I is a low-cost starter craft given to newly-licensed pilots, manufactured by Faulcon DeLacy. It is a multirole ship produced from 2982 to the present. The Sidewinder is known for its agility, being one of the most maneuverable ships, but it is also one of the slowest and weakest-hulled ships available. It is suitable for combat but lacks firepower, and it is not recommended for trading or mining due to its low cargo capacity. The Sidewinder has a maximum jump range of about 24ly before engineering, making it a decent option for exploration. It is the cheapest and most common ship on the market, available at most shipyards and the only ship available at Detention Centres. The Sidewinder has two Class 1 hardpoints located in front of and just below the cockpit, and it cannot utilize Multicrew. It has a single pilot seat and a maximum cargo capacity of 16t. The Sidewinder's default load-out includes two Pulse Lasers (Class 1, Grade G) and various other systems such as a Power Plant (Class 2, Grade E), Thrusters (Class 2, Grade E), and a Frame Shift Drive (Class 2, Grade E).", "metadata": {"entity_name": "Sidewinder Mk I", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Sidewinder Mk I has dimensions of 14.9m x 21.3m x 5.4m, a hull mass of 25 t, and a mass lock factor of 6. It has an armour rating of 108 with an armour hardness of 20, shields of 52 MJ, a heat capacity of 140, and a fuel capacity of 2 t. The ship has a manoeuvrability rating of 5, a top speed of 221 m/s (default) or 229 m/s (upgraded), a boost speed of 322 m/s (default) or 334 m/s (upgraded), and an unladen jump range of 7.25 ly (default) or 24.43 ly (upgraded). The Sidewinder has a cargo capacity of 4 t (default) or 16 t (max).", "metadata": {"entity_name": "Sidewinder Mk I", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Sidewinder Mk I has two small hardpoints, each equipped with a Pulse Laser (Class 1, Grade G) by default. It also has two utility mounts that are empty by default. The ship's internal compartments include a Shield Generator (Class 2, Grade E), a Cargo Rack [x4] (Class 2, Grade E), and various other systems such as an Advanced Docking Computer (Class 1, Grade E) and Supercruise Assist (Class 1, Grade E). The Sidewinder's bulkhead is equipped with Lightweight Alloys (Class 1, Grade I), and it has a Power Plant (Class 2, Grade E), Thrusters (Class 2, Grade E), a Frame Shift Drive (Class 2, Grade E), Life Support (Class 1, Grade E), a Power Distributor (Class 1, Grade E), Sensors (Class 1, Grade E), and a Fuel Tank (Class 1, Grade C).", "metadata": {"entity_name": "Sidewinder Mk I", "document_type": "ship", "chunk_type": "outfitting"}}