{"text": "The Asp Scout is a multirole ship manufactured by Lakon Spaceways, produced from 3301 to the present. It is priced at 3,961,150 CR with an insurance cost of 198,058 CR. The ship is designed as a cheaper alternative to the Asp Explorer but lacks specialization in any particular role. It features a medium landing pad size, dimensions of 54.8m x 59.4m x 17.0m, and a multicrew capability with two pilot seats. The ship's default loadout includes various systems and compartments, with notable features such as its impressive manoeuvrability rating of 5, which allows it to evade fire easily and keep fixed mounts on targets. However, it has poor shields and armour for its price range, and its utility mounts are limited, making it less viable as a stealth ship. The Asp Scout has a default cargo capacity of 16t, expandable to 74t, and a default jump range of 11.59 ly, which can be upgraded to 31.47 ly. Its weapon hardpoints are located on either side and underneath the cockpit, and it is highly customizable through the Outfitting menu of Station Services.", "metadata": {"entity_name": "Asp Scout", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Asp Scout has a hull mass of 150t, an armour rating of 324 with a hardness of 52, and shields of 105 MJ. Its heat capacity is 210, and it has a fuel capacity of 16t. The ship's top speed is 223 m/s (default) and 225 m/s (upgraded), with a boost speed of 304 m/s (default) and 348 m/s (upgraded). The ship's manoeuvrability rating is 5, and it has a mass lock factor of 8. The Asp Scout's default outfitting includes two utility mounts, two small hardpoints, and two medium hardpoints. Its internal compartments consist of one Class 1, two Class 2, two Class 3, one Class 4, and one Class 5 compartment. The ship's default systems include Lightweight Alloys for bulkheads, a Power Plant for the reactor bay, Thrusters for the thrusters mounting, a Frame Shift Drive for the frame shift drive housing, Life Support for environment control, a Power Distributor for power coupling, Sensors for the sensor suite, and a Fuel Tank for the fuel store. The internal compartments include Cargo Racks, a Shield Generator, Supercruise Assist, and a (PAS).", "metadata": {"entity_name": "Asp Scout", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Asp Scout's default small hardpoints are equipped with Pulse Lasers (L) rated F for both Class 1 hardpoints. The medium hardpoints are initially empty but can be upgraded to Class 2. The utility mounts are also initially empty but can be upgraded to Class 0. The ship's default bulkhead system is Lightweight Alloys rated I for Class 1, with a maximum class of 8. The reactor bay is equipped with a Power Plant rated E for Class 4, and the thrusters mounting is equipped with Thrusters rated E for Class 4. The frame shift drive housing is equipped with a Frame Shift Drive rated E for Class 4, and the environment control is equipped with Life Support rated E for Class 3. The power coupling is equipped with a Power Distributor rated E for Class 4, and the sensor suite is equipped with Sensors rated E for Class 4. The fuel store is equipped with a Fuel Tank rated C for Class 4. The internal compartments include Cargo Racks rated E for Classes 3 and 4, a Shield Generator rated E for Class 3, Supercruise Assist rated E for Class 1, and a (PAS) rated I for Class 1.", "metadata": {"entity_name": "Asp Scout", "document_type": "ship", "chunk_type": "outfitting"}}