{"text": "The Diamondback Explorer is a Combat Explorer manufactured by Lakon Spaceways, produced from 3300 to the present. It costs 1,894,760 CR with an insurance value of 94,738 CR. It is not suitable for mining due to limited internal space and higher cost compared to other ships. It has a hull mass of 260 t, making it heavier for its size and less agile than the Diamondback Scout. It has 4 utility mounts, 2 medium hardpoints, and 1 large hardpoint. It has a default cargo capacity of 12 t, expandable to 60 t. It has a default unladen jump range of 15.70 ly, upgradeable to 41.61 ly. It has a default top speed of 251 m/s, upgradeable to 282 m/s, and a default boost speed of 328 m/s, upgradeable to 369 m/s. It has a heat capacity of 351, fuel capacity of 32 t, and shields of 131 MJ. It has a mass lock factor of 10, armor of 270, and armor hardness of 42. It has a landing pad size of small and dimensions of 45.0m x 27.3m x 13.6m. It has 1 pilot seat and no multicrew or fighter hangar. It has 2 class 1, 2 class 2, 2 class 3, and 2 class 4 internal compartments. It has a default loadout including a pulse laser (L) on two medium hardpoints, and empty utility mounts. It has a lightweight alloys bulkhead, a power plant, thrusters, a frame shift drive, life support, a power distributor, sensors, a fuel tank, a shield generator, cargo racks, an advanced docking computer, supercruise assist, and a (PAS).", "metadata": {"entity_name": "Diamondback Explorer", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Diamondback Explorer shares the same maximum power plant class limitation as the Diamondback Scout, while having more internal compartments and a larger offensive armament. These factors lead to the Diamondback Explorer having more power management issues with some loadouts. Thanks to the ability to fit a class 5 Frame Shift Drive and a 32t Fuel Tank, this ship is excellent for exploration. Even with a full combat outfit, the ship maintains an impressive jump range. This allows the ship to undertake long distance travel while still being able to defend itself and thus ideal for long-range travel into hostile territory, for Missions, as a forward scouting ship, or as a rescue ship with fuel limpets. Power can be managed with module priority, or in some cases simply disabling the cargo hatch. Additionally, the Diamondback Explorer has excellent heat efficiency and power distribution. The low base heat output translates to better fuel scooping, longer firing cycles for thermal weapons before overheating, easier management of a Shield Cell Bank's heat output, stealth and smuggling, or stealth combat with the ability to maintain silent running for long periods.", "metadata": {"entity_name": "Diamondback Explorer", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Diamondback Explorer is quite heavy for its size, and is currently the largest hull mass ship capable of utilizing small landing pads. While this has the benefit of making it harder to mass-lock than similar ships of its size, it makes the ship significantly less agile than its smaller brother, the Diamondback Scout, and even some ships larger than itself. The Explorer is not completely unwieldy, however; with gimballed weapons it can reliably keep weapons on target on all but the most agile of enemies.", "metadata": {"entity_name": "Diamondback Explorer", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The weapon hardpoints are located as follows: one Class 2 hardpoint is mounted on either side of the cockpit, and a single Class 3 hardpoint is mounted under the nose. The Class 3 hardpoint has similar field of fire to the nose mount of the Python. Hardpoint locations are grouped together on the fore of the ship's hull, with placement allowing all weapons to be fired at the target simultaneously. If gimballed, the hardpoints provide a large vertical field of fire. Utility mounts are located on the dorsal side of both wingtips, one above the cockpit, and one on the rear tail of the ship, for a total of four.", "metadata": {"entity_name": "Diamondback Explorer", "document_type": "ship", "chunk_type": "overview"}}
{"text": "As with the Diamondback Scout, the Diamondback Explorer is equipped with hydraulic, side-mounted thruster assemblies that also contain landing gear. The assemblies move back and rotate downwards when landing gear is deployed.", "metadata": {"entity_name": "Diamondback Explorer", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Diamondback Explorer has a hull mass of 260 t, armor of 270, armor hardness of 42, shields of 131 MJ, heat capacity of 351, fuel capacity of 32 t, manoeuvrability of 4, top speed of 251 m/s (default) or 282 m/s (upgraded), boost speed of 328 m/s (default) or 369 m/s (upgraded), unladen jump range of 15.70 ly (default) or 41.61 ly (upgraded), and cargo capacity of 12 t (default) or 60 t (max).", "metadata": {"entity_name": "Diamondback Explorer", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Diamondback Explorer has 4 utility mounts, 2 medium hardpoints, and 1 large hardpoint. The default systems for the medium hardpoints are Pulse Laser (L) with a rating of F and a class of 1, max class of 2. The utility mounts are empty by default. The bulkhead is Lightweight Alloys with a rating of I and a class of 1, max class of 8. The reactor bay is a Power Plant with a rating of E and a class of 4, max class of 4. The thrusters mounting is Thrusters with a rating of E and a class of 4, max class of 4. The frame shift drive housing is a Frame Shift Drive with a rating of E and a class of 5, max class of 5. The environment control is Life Support with a rating of E and a class of 3, max class of 3. The power coupling is a Power Distributor with a rating of E and a class of 4, max class of 4. The sensor suite is Sensors with a rating of E and a class of 3, max class of 3. The fuel store is a Fuel Tank with a rating of C and a class of 5, max class of 5.", "metadata": {"entity_name": "Diamondback Explorer", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Diamondback Explorer has 2 class 1, 2 class 2, 2 class 3, and 2 class 4 internal compartments. The default systems for the internal compartments are a Shield Generator with a rating of E and a class of 4, max class of 4, a Cargo Rack [x8] with a rating of E and a class of 3, max class of 4, a Cargo Rack [x4] with a rating of E and a class of 2, max class of 3, and three empty compartments with max classes of 3, 2, and 2. Additionally, it has an Advanced Docking Computer, Supercruise Assist, and a (PAS), all with a rating of E and a class of 1, max class of 1.", "metadata": {"entity_name": "Diamondback Explorer", "document_type": "ship", "chunk_type": "outfitting"}}