{"text": "The Keelback is a well-armed trader manufactured by Lakon Spaceways, capable of hauling large cargoes without an escort. It sacrifices cargo space for combat effectiveness, though not as much as the Type-10 Defender. Compared to the Type-6 Transporter, it has 16t less cargo space, a higher cost, and a lower jump range, making it a lesser trader but still capable. It has two Class 1 and two Class 2 hardpoints, with lower damage output than similar ships but can mount a Fighter Hangar to increase firepower. It's suitable for pirates or bounty hunters but has poor maneuverability. As an explorer, it's less capable than the Type-6 due to its greater mass and limited compartment space. It excels in mining with its medium hardpoints, large cargo space, and fighter bay for protection. It's a multipurpose ship but shines in mining. It has two pilot seats, making it compatible with Multicrew, and unique rotating engine pods.", "metadata": {"entity_name": "Keelback", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Keelback has the following specifications: dimensions of 49.7m x 40.3m x 14.9m, 2 pilot seats, multicrew compatibility, a fighter hangar, a hull mass of 180 t, an armour rating of 486, armour hardness of 45, shields of 99 MJ, heat capacity of 215, fuel capacity of 16 t, maneuverability of 2, top speed of 202 m/s (default) or 231 m/s (upgraded), boost speed of 303 m/s (default) or 344 m/s (upgraded), unladen jump range of 10.94 ly (default) or 27.19 ly (upgraded), and cargo capacity of 38 t (default) or 98 t (max).", "metadata": {"entity_name": "Keelback", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Keelback has 3 utility mounts, 2 small hardpoints, and 2 medium hardpoints. Its internal compartments include 1 Class 1, 2 Class 2, 1 Class 3, 1 Class 4, and 2 Class 5 compartments. Its default outfitting includes Pulse Lasers on the small hardpoints, empty medium hardpoints, and empty utility mounts. It has a default bulkhead system of Lightweight Alloys (Grade I, Class 1), a Power Plant (Grade E, Class 4), Thrusters (Grade E, Class 4), a Frame Shift Drive (Grade E, Class 4), Life Support (Grade E, Class 1), a Power Distributor (Grade E, Class 3), Sensors (Grade E, Class 2), a Fuel Tank (Grade C, Class 4), and various cargo racks, a Shield Generator, Supercruise Assist, and a PAS.", "metadata": {"entity_name": "Keelback", "document_type": "ship", "chunk_type": "outfitting"}}