{"text": "The Type-10 Defender is a mighty glacier; slow, heavily armored, and even more heavily armed, it bears the highest armor rating and theoretical damage in the game. In spite of this, the Type-10 is something of a paradox. When compared to similar ships in its price range(the Anaconda, Imperial Cutter and Federal Corvette), the Type-10 has the best armor, but the worst shielding. It has the best theoretical damage in the game, but wide hardpoint placement makes it impossible to effectively use fixed weapons. The ship's huge number of hardpoints seems ideal for turreted weapons, but hardpoint placement means all turrets can only be brought to bear when a target is directly in front of the ship. It has the rare ability to mount a class 8 shield, but less than half the shield capacity of the Cutter, and no ability to mount a class 8 Shield Cell bank. Its improved distributor improves its capability for mining, but reduced cargo capacity equally diminishes that capability. Overall, the Type-10 requires a very different design methodology from other large combat ships. Attempting to use fixed weapons, or to force the ship to rely heavily on shields, will often result in inferior results when compared to other alternatives. Some players equip it entirely with turrets and fly a Ship Launched Fighter, but this, too, is generally relegated to limited roles, such as AFK farming. Some success can be acquired by focusing on its strengths. While turreted weapons on all sides heavily diminishes damage capacity, turrets on a single side allows a player to compensate for its low maneuverability while leaving the other side for higher-damage gimballed weapons. While it shield capacity is low, its shield regeneration is undiminished, and it can take particular advantage from Guardian Shield Reinforcements, which offer nearly twice the benefit when compared to a Cutter. And with the heaviest armor in the game, it has the greatest capability to remain in a fight once its shields have gone down. Taken together, the Type 10 has the capacity to compete with other ships, though not necessarily to defeat them outright.", "metadata": {"entity_name": "Type-10 Defender", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-10 Defender is manufactured by Lakon Spaceways and has been in production since 3303. It is a Combat Freighter with a cost of 124,755,342 CR and an insurance value of 6,237,767 CR.", "metadata": {"entity_name": "Type-10 Defender", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-10 Defender has dimensions of 135.1m x 118.4m x 39.3m, a hull mass of 1,200 t, and a mass lock factor of 26. It has an armor rating of 1,044 with an armor hardness of 75, shields of 99 MJ, and a heat capacity of 335. The ship has a fuel capacity of 64 t, a top speed of 179 m/s (default) or 200 m/s (upgraded), a boost speed of 219 m/s (default) or 245 m/s (upgraded), and an unladen jump range of 6.97 ly (default) or 25.75 ly (upgraded). The cargo capacity is 220 t (default) or 534 t (max).", "metadata": {"entity_name": "Type-10 Defender", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Type-10 Defender has 8x Utility Mounts, 2x Small Hardpoints, 3x Medium Hardpoints, and 4x Large Hardpoints. It also has a variety of internal compartments including 1x Class 1, 1x Class 2, 2x Class 3, 2x Class 4, 1x Class 5, 1x Class 6, 1x Class 7, and 1x Class 8. Additionally, it has 2x Class 5 Military Compartments reserved.", "metadata": {"entity_name": "Type-10 Defender", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Type-10 Defender's default outfitting includes Lightweight Alloys (Class 1, Grade I) for bulkhead, a Power Plant (Class 6, Grade E) in the reactor bay, Thrusters (Class 7, Grade E) for thrusters mounting, a Frame Shift Drive (Class 6, Grade E) in the frame shift drive housing, Life Support (Class 5, Grade E) for environment control, a Power Distributor (Class 7, Grade E) for power coupling, Sensors (Class 4, Grade E) for the sensor suite, and a Fuel Tank (Class 6, Grade C) for the fuel store.", "metadata": {"entity_name": "Type-10 Defender", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Type-10 Defender's internal compartments include a Cargo Rack [x128] (Class 7, Grade E), a Cargo Rack [x64] (Class 6, Grade E), a Shield Generator (Class 6, Grade E), a Cargo Rack [x16] (Class 4, Grade E), two Empty (M) compartments, a Cargo Rack [x8] (Class 3, Grade E), an Empty compartment, a Cargo Rack [x4] (Class 2, Grade E), another Empty compartment, another Empty compartment, a Supercruise Assist (Class 1, Grade E), and a (PAS) (Class 1, Grade I).", "metadata": {"entity_name": "Type-10 Defender", "document_type": "ship", "chunk_type": "outfitting"}}