{"text": "The Type-9 Heavy is a freighter manufactured by Lakon Spaceways, produced from 3300 to the present. It is known for its large cargo capacity and dual Class 8 compartments, making it suitable for trading and some combat roles. However, its low maneuverability and speed make it vulnerable to enemy fire and FSD interdictions. The ship has five weapon hardpoints and four utility mounts, with a massive fuel tank allowing for long-range travel without a fuel scoop. The Type-9's canopy offers one of the widest views among ships, aiding in various flight and landing situations. Its combat-oriented variant, the Type-10 Defender, was released in 3303 to counter the Thargoid threat.", "metadata": {"entity_name": "Type-9 Heavy", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-9 Heavy has dimensions of 117.4m x 115.3m x 33.2m and a hull mass of 850 tons. It features 3-4 pilot seats, multicrew capability, and a fighter hangar. The ship's specifications include an armor rating of 864, shield capacity of 110 MJ, and a heat capacity of 289. Its fuel capacity is 64 tons, with a maneuverability rating of 0. The top speed is 132 m/s (default) or 151 m/s (upgraded), and the boost speed is 202 m/s (default) or 232 m/s (upgraded). The unladen jump range is 8.68 ly (default) or 22.12 ly (upgraded), with a cargo capacity of 348 tons (default) or 790 tons (max).", "metadata": {"entity_name": "Type-9 Heavy", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Type-9 Heavy has four utility mounts, two small hardpoints, and three medium hardpoints. Its internal compartments include one Class 1, one Class 2, two Class 3, two Class 4, one Class 5, one Class 6, one Class 7, and two Class 8 compartments. The default outfitting includes lightweight alloys for bulkhead, a power plant for the reactor bay, thrusters for thrusters mounting, a frame shift drive, life support for environment control, a power distributor, sensors, a fuel tank, and various cargo racks. The ship's weapon hardpoints are located on top, bottom, and sides, with utility mounts on top and below the ship.", "metadata": {"entity_name": "Type-9 Heavy", "document_type": "ship", "chunk_type": "outfitting"}}