{"text": "The Federal Assault Ship is a combat-oriented vessel manufactured by Core Dynamics, produced from 3300 to the present. It is known for its agility and resilient hull, making it a 'hull tank' with weak shields. It competes with the Alliance Chieftain, offering similar performance but requiring Federal Navy rank. It is suitable for exploration near the bubble due to its rugged design and decent jump range potential.", "metadata": {"entity_name": "Federal Assault Ship", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Federal Assault Ship measures 73.8m x 49.5m x 22.8m, with a hull mass of 480 tons. It has 2 pilot seats, supports multicrew, and has a mass lock factor of 14. Its armor rating is 540 with a hardness of 60, and its shields are 133 MJ. It has a heat capacity of 286, a fuel capacity of 16 tons, and a cargo capacity of 32 tons (default) up to 98 tons (max).", "metadata": {"entity_name": "Federal Assault Ship", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Federal Assault Ship has 4 utility mounts, 2 medium hardpoints, and 2 large hardpoints. Its internal compartments include 1 Class 1, 2 Class 2, 1 Class 3, 1 Class 4, and 2 Class 5 compartments, with 2 reserved Class 4 military compartments. Its weapon hardpoints are located above and behind the cockpit, on the nose, and underneath the base of the lower wings.", "metadata": {"entity_name": "Federal Assault Ship", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Federal Assault Ship's default medium hardpoints are equipped with Pulse Lasers (Class 1, Grade F), and its large hardpoints are empty. Its utility mounts are also empty. The ship's default systems include Lightweight Alloys (Class 1, Grade I) for bulkhead, Power Plant (Class 6, Grade E) for reactor bay, Thrusters (Class 6, Grade E) for thrusters mounting, Frame Shift Drive (Class 5, Grade E) for frame shift drive housing, Life Support (Class 5, Grade E) for environment control, Power Distributor (Class 6, Grade E) for power coupling, Sensors (Class 4, Grade E) for sensor suite, and Fuel Tank (Class 4, Grade C) for fuel store.", "metadata": {"entity_name": "Federal Assault Ship", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Federal Assault Ship's internal compartments include a Shield Generator (Class 5, Grade E), Cargo Racks (Class 4, Grade E for x16, Class 3, Grade E for x8), and empty compartments (Class 4, 3, and 2). It also has a Supercruise Assist (Class 1, Grade E) and a (PAS) system (Class 1, Grade I).", "metadata": {"entity_name": "Federal Assault Ship", "document_type": "ship", "chunk_type": "outfitting"}}