{"text": "The Type-7 Transporter is a bulky trading vessel manufactured by Lakon Spaceways, often chosen by traders upgrading from the Type-6 Transporter. It features triple the capacity of a Type-6 at a higher price. Due to its tall frame, it requires a large landing pad and cannot dock at outposts, limiting its utility compared to medium ships like the Federal Dropship or Python. It is the cheapest and smallest large-sized ship on the market.", "metadata": {"entity_name": "Type-7 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-7 Transporter is an excellent shielded or open play trader when outfitted with Military Grade Composites, a Shield Generator, and Shield Boosters. Its pitch and yaw speed, combined with acceptable base speed and adequate defenses, allow it to make a hyperspace jump out of combat or potentially evade interdiction. It is usually better to submit for a faster FSD cool-down, boost past attackers, and charge the Frame Shift Drive. Its Mass Lock Factor is below most medium ships and all large ships, making it inadvisable to jump to Supercruise to avoid an attacker.", "metadata": {"entity_name": "Type-7 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "In combat, the Type-7, like other freighters, is not viable. Its hardpoints are outclassed by even the Imperial Eagle or Viper Mk III, which are far cheaper and more maneuverable. The top and bottom hardpoints' poor convergence, combined with the weak Class 4 Power Distributor and heat problems, further limit damage output and hardpoint options. As a multirole or pirate ship, the Type-7 is surpassed by its main competitor, the Python. Even the Asp Scout is a better option for combat, multipurpose, and piracy. When outfitting the Type-7 as a shielded trader, it is worth considering equipping no weapons at all for increased speed and jump range.", "metadata": {"entity_name": "Type-7 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "For passenger missions, the Type-7 has three Class 6 Compartments and three Class 5 Compartments, making it the cheapest ship in the game with six or more Compartments of Class 5 or greater. It is useful for those who cannot afford a Python or more expensive large passenger haulers. As a large ship, it cannot dock at outposts, which are typically lower security, and is more commonly subjected to station scans. This can be mitigated with heatsinks or other heat-reducing measures. Passenger missions from outposts tend to pay slightly more, resulting in a small loss of credits per hour when using a large ship like the Type-7.", "metadata": {"entity_name": "Type-7 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-7 is a viable exploration ship with ranges around 30 LY, capable of long-range jumps and good for long-range deliveries or Rare Commodities trading. However, it struggles with heat control, which can be mitigated by installing an A-rated Power Plant and multiple Heatsink Launchers.", "metadata": {"entity_name": "Type-7 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-7 is an adequate miner, perhaps as an intermediate step between smaller ships like the Adder or Cobra Mk III and larger ships like the Python or Anaconda. It lacks Class 2 hardpoints, necessary for deep core asteroid mining, so it is only suited to laser mining. While it can accommodate more limpets and cargo space than the Python, its mining speed is limited by its Class 4 Power Distributor and hardpoints. It can install a Sub-surface Displacement Missile with no negative effect.", "metadata": {"entity_name": "Type-7 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-7 Transporter has four Class 1 hardpoints and four utility mounts. Two hardpoints are on the front face of the ship, one on the topside amidships, and one on the underside behind the cargo hatch. The cockpit is mounted low on the front face, requiring careful navigation through access corridors to avoid crashing the top of the ship.", "metadata": {"entity_name": "Type-7 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-7 Transporter is manufactured by Lakon Spaceways and has been in production from 3290 to the present. It is a Freighter type ship with a cost of 17,472,252 CR and insurance of 873,613 CR. It has a large landing pad size and dimensions of 81.6m x 56.1m x 25.4m. It has a hull mass of 350 t, armour of 612, armour hardness of 54, shields of 99 MJ, heat capacity of 226, and fuel capacity of 32 t. It has a top speed of 182 m/s (default) or 209 m/s (upgraded), boost speed of 304 m/s (default) or 348 m/s (upgraded), unladen jump range of 12.27 ly (default) or 29.75 ly (upgraded), and cargo capacity of 128 t (default) or 306 t (max).", "metadata": {"entity_name": "Type-7 Transporter", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Type-7 Transporter has 4x Utility Mounts and 4x Small Hardpoints. Its internal compartments include 1x Class 1, 1x Class 2, 2x Class 3, 3x Class 5, and 3x Class 6 compartments. The default outfitting includes Pulse Lasers (L) on two small hardpoints and empty on the other two. All utility mounts are empty by default.", "metadata": {"entity_name": "Type-7 Transporter", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Type-7 Transporter's default outfitting includes Lightweight Alloy bulkhead (Class 1, Grade C), Power Plant (Class 4, Grade E), Thrusters (Class 5, Grade E), Frame Shift Drive (Class 5, Grade E), Life Support (Class 4, Grade E), Power Distributor (Class 3, Grade E), and Sensors (Class 3, Grade E). It also has Cargo Racks (Class 5 and 4, Grade E), Shield Generator (Class 4, Grade E), Supercruise Assist (Class 1, Grade E), and (PAS) (Class 1, Grade I).", "metadata": {"entity_name": "Type-7 Transporter", "document_type": "ship", "chunk_type": "outfitting"}}