{"text": "The Imperial Cutter is a multirole ship manufactured by Gutamaya, produced from 3301 to the present. It is a stylish, powerhouse ship with ample cargo capacity, making it ideal for traders. It has a max cargo capacity of 794 tons, the largest of all playable ships, but it is also the most expensive ship in the game. It is well-shielded, very fast for its size, and much better armed, giving it far greater combat survivability, especially in the piracy role. It can hold its own against a Federal Corvette, Anaconda, or Type-10 Defender. It is also an excellent choice for mining, with plenty of internals available to mount mining accessories while still leaving the largest open for cargo holds. It features four medium hardpoints, two large hardpoints, and a single huge hardpoint. It has a mass lock factor of 26, tied with the Type-10 for the highest of all conventional ships. It has a default cargo capacity of 164 tons and a max cargo capacity of 794 tons. It has a default unladen jump range of 8.21 ly and a max unladen jump range of 25.70 ly. It has a default top speed of 202 m/s and a max top speed of 232 m/s. It has a default boost speed of 323 m/s and a max boost speed of 372 m/s. It has a default armor rating of 720 and a max armor rating of 720. It has a default shield rating of 704 MJ and a max shield rating of 704 MJ. It has a default heat capacity of 327 and a max heat capacity of 327. It has a default fuel capacity of 64 t and a max fuel capacity of 64 t. It has a default manoeuvrability of 0 and a max manoeuvrability of 0. It has a default hull mass of 1,100 t and a max hull mass of 1,100 t. It has a default landing pad size of Large and a max landing pad size of Large. It has a default dimensions of 192.6m x 111.1m x 33.4m and a max dimensions of 192.6m x 111.1m x 33.4m. It has a default pilot seats of 3-4 and a max pilot seats of 3-4. It has a default multicrew of Yes and a max multicrew of Yes. It has a default fighter hangar of Yes and a max fighter hangar of Yes. It has a default insurance of 10,448,473 CR and a max insurance of 10,448,473 CR. It has a default cost of 208,969,451 CR and a max cost of 208,969,451 CR. It has a default expansion of N/A and a max expansion of N/A. It has a default hangar type of N/A and a max hangar type of N/A. It has a default armour hardness of 70 and a max armour hardness of 70. It has a default mass lock factor of 26 and a max mass lock factor of 26. It has a default armour of 720 and a max armour of 720. It has a default shields of 704 MJ and a max shields of 704 MJ. It has a default heat capacity of 327 and a max heat capacity of 327. It has a default fuel capacity of 64 t and a max fuel capacity of 64 t. It has a default manoeuvrability of 0 and a max manoeuvrability of 0. It has a default top speed of 202 m/s and a max top speed of 232 m/s. It has a default boost speed of 323 m/s and a max boost speed of 372 m/s. It has a default unladen jump range of 8.21 ly and a max unladen jump range of 25.70 ly. It has a default cargo capacity of 164 t and a max cargo capacity of 794 t. It has a default hardpoints of 8x Utility Mounts, 4x Medium Hardpoints, 2x Large Hardpoints, and 1x Huge Hardpoint. It has a default internal compartments of 1x Class 1 Compartment, 1x Class 3 Compartment, 1x Class 4 Compartment, 2x Class 5 Compartments, 3x Class 6 Compartments, and 2x Class 8 Compartments. It has a default reserved compartments of 2x Class 5 Military Compartments. It has a default bulkhead of Lightweight Alloys, Class 1, Rating I. It has a default reactor bay of Power Plant, Class 8, Rating E. It has a default thrusters mounting of Thrusters, Class 8, Rating E. It has a default frame shift drive housing of Frame Shift Drive, Class 7, Rating E. It has a default environment control of Life Support, Class 7, Rating E. It has a default power coupling of Power Distributor, Class 7, Rating E. It has a default sensor suite of Sensors, Class 7, Rating E. It has a default fuel store of Fuel Tank, Class 6, Rating C. It has a default internal compartments of Shield Generator, Class 8, Rating E; Cargo Rack [x128], Class 7, Rating E; Cargo Rack [x32], Class 5, Rating E; Empty, Class 6; Empty, Class 6; Empty, Class 5; Empty, Class 5; Empty (M), Class 5; Empty (M), Class 5; Cargo Rack [x4], Class 2, Rating E; Empty, Class 3; Supercruise Assist, Class 1, Rating E; (PAS), Class 1, Rating I. It has a default medium hardpoint of Pulse Laser (L), Class 1, Rating F; Pulse Laser (L), Class 1, Rating F; Empty, Class 2; Empty, Class 2. It has a default large hardpoint of Empty, Class 3; Empty, Class 3. It has a default utility mount of Empty, Class 0; Empty, Class 0; Empty, Class 0; Empty, Class 0; Empty, Class 0; Empty, Class 0; Empty, Class 0; Empty, Class 0.", "metadata": {"entity_name": "Imperial Cutter", "document_type": "ship", "chunk_type": "overview"}}