{"text": "The Vulture is a combat-focused small-sized ship manufactured by Core Dynamics, produced from 3301 to the present. It is renowned for its powerful performance in combat, capable of outmaneuvering and dealing significant damage to larger ships like Anacondas or Pythons. Its two large hardpoints can mount Class 3 weapons, which have a higher Armour-Pierce Rating, making it effective against larger, heavily armored ships. However, its limited number of hardpoints restricts it to conventional weaponry, as missiles, mines, torpedoes, or railguns are not viable due to their limited ammo capacities and availability. The Vulture's defensive capabilities are impressive, boasting the highest base shield and armor strengths among small-sized ships, along with four utility mounts, similar to larger ships like the Python and Federal Gunship. Despite its strengths, the Vulture has notable drawbacks, including limited power capacity, lower speed compared to other small ships, and a sub-par jump range, making it less versatile for roles beyond combat. Its overspecialization limits its effectiveness as an anti-Thargoid ship, trader, or explorer. The Vulture's two large hardpoints are located above and behind the cockpit, and it can accommodate multicrew with two pilot seats. All ships are customizable through the Outfitting menu of Station Services.", "metadata": {"entity_name": "Vulture", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Vulture has the following specifications: dimensions of 43.1m x 34.7m x 12.3m, a hull mass of 230 tons, and an armor hardness of 55. It features 2 pilot seats and supports multicrew, but lacks a fighter hangar. Its armor rating is 288, shield capacity is 293 MJ, and heat capacity is 237. The ship has a fuel capacity of 8 tons and a cargo capacity ranging from 8 tons (default) to 60 tons (max). In terms of performance, the Vulture has a default top speed of 215 m/s (upgradable to 244 m/s), a boost speed of 348 m/s (upgradable to 397 m/s), and a default unladen jump range of 7.93 ly (upgradable to 22.36 ly). The ship's manoeuvrability is rated at 5, making it highly agile.", "metadata": {"entity_name": "Vulture", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Vulture's outfitting includes 4x Utility Mounts and 2x Large Hardpoints. Its internal compartments consist of 4x Class 1, 1x Class 2, 1x Class 4, and 1x Class 5, with a reserved Class 5 Military Compartment. The default loadout includes Pulse Lasers (Class 1, Rating F) on both large hardpoints and empty utility mounts. The ship's bulkhead is equipped with Lightweight Alloys (Class 1, Rating I), and it features a Power Plant (Class 4, Rating E), Thrusters (Class 5, Rating E), Frame Shift Drive (Class 4, Rating E), Life Support (Class 3, Rating E), Power Distributor (Class 5, Rating E), Sensors (Class 4, Rating E), and a Fuel Tank (Class 3, Rating C). Internal compartments include a Shield Generator (Class 5, Rating E), Cargo Rack [x8] (Class 3, Rating E), and various empty compartments.", "metadata": {"entity_name": "Vulture", "document_type": "ship", "chunk_type": "outfitting"}}