{"text": "The Imperial Clipper is a multirole ship manufactured by Gutamaya, produced from 3300 to the present. It costs 22,295,860 CR with an insurance value of 1,114,793 CR. The ship is 106.7m x 103.7m x 24.8m in size, has a hull mass of 400 tons, and can carry 250 tons of cargo at maximum. It features 2 pilot seats, multicrew compatibility, and a large landing pad. The ship's armour rating is 486 with a hardness of 60, and it has shields of 186 MJ. Its heat capacity is 304, and it has a fuel capacity of 16 tons. The Imperial Clipper has a top speed of 306 m/s (default) or 341 m/s (upgraded), a boost speed of 388 m/s (default) or 445 m/s (upgraded), and an unladen jump range of 8.98 ly (default) or 27.52 ly (upgraded).", "metadata": {"entity_name": "Imperial Clipper", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Imperial Clipper has 4 utility mounts, 2 medium hardpoints, and 2 large hardpoints. Its internal compartments include 1 Class 1, 2 Class 2, 2 Class 3, 2 Class 4, 1 Class 6, and 1 Class 7 compartments. The ship's default outfitting includes Lightweight Alloys (I, Class 1) for bulkhead, a Power Plant (E, Class 6) in the reactor bay, Thrusters (E, Class 6) for thrusters mounting, a Frame Shift Drive (E, Class 5) in the frame shift drive housing, Life Support (E, Class 5) for environment control, a Power Distributor (E, Class 6) for power coupling, Sensors (E, Class 5) for the sensor suite, and a Fuel Tank (C, Class 4) for the fuel store. The internal compartments are outfitted with a Cargo Rack [x64] (E, Class 6), a Shield Generator (E, Class 6), a Cargo Rack [x8] (E, Class 3), and a Supercruise Assist (E, Class 1), among others.", "metadata": {"entity_name": "Imperial Clipper", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Imperial Clipper's weapon hardpoints are located on the top of either wing-tip nacelle (Class 3 large hardpoint) and on the underside of either wing (Class 2 medium hardpoint). The wing-tip mounts are far from the centerline and have trouble converging their fields of fire unless used with gimballed or turret-mounted weapons. The underside mounts, although closer together, also suffer from field of fire convergence issues. Fixed weapons are generally not easy to use with this ship, but it is possible to use fixed mount weapons if placed on the same side of the ship.", "metadata": {"entity_name": "Imperial Clipper", "document_type": "ship", "chunk_type": "hardpoints"}}
{"text": "The Imperial Clipper is known for its high potential speed, with fully upgraded thrusters making it comparable to smaller ships like the Cobra Mk III and the Imperial Eagle. Its pitch rotation and yaw speed are higher than most ships, but it has poor lateral thruster strength. The ship has very weak shields for its size and wing-mounted hardpoints ill-suited for fixed weapons, making it difficult to recommend for combat. It is one of the widest ships on the market, which can make manual docking complicated for less experienced pilots. Compared to the Alliance Chieftain, the Clipper has superior shield strength and cargo capacity but less overall firepower and weaker armour.", "metadata": {"entity_name": "Imperial Clipper", "document_type": "ship", "chunk_type": "performance"}}
{"text": "The Imperial Clipper is capable of carrying 248 tons of cargo, which is impressive given its price point and multirole capabilities. While its speed and manoeuvrability fall off more heavily when laden compared to other ships, it is still a viable option for trading. The Type-7 Transporter may be cheaper and can haul more cargo, but it is not as viable as an armed trader that can confront attackers and evade them if necessary. The Imperial Clipper is also a good Miner with high cargo and numerous internal slots, but its two Class 2 and two Class 3 hardpoints can be constricting. Taking the Clipper out to mine means either sacrificing damage output to equip the necessary mining tools or mining with moderate defences and reduced mining efficiency.", "metadata": {"entity_name": "Imperial Clipper", "document_type": "ship", "chunk_type": "cargo_and_mining"}}
{"text": "With around 28 light-years of jump range potential, the Imperial Clipper is an average vessel for exploration. It is more than capable of doing the job and is a good choice for jobs that require travelling long distances, but ships like the Asp Explorer easily outclass it in this role and cost substantially less. The ship's large body can also prove problematic when moving in clustered asteroid fields and planetary rings.", "metadata": {"entity_name": "Imperial Clipper", "document_type": "ship", "chunk_type": "exploration"}}
{"text": "The pilot's seat is offset to the right of the centerline of the ship while the copilot's seat is offset to the left of the centerline. Although the ship is compatible with Multicrew, it cannot equip a Fighter Hangar.", "metadata": {"entity_name": "Imperial Clipper", "document_type": "ship", "chunk_type": "crew"}}
{"text": "The Imperial Clipper's default load-out includes Pulse Lasers (F, Class 1) on the medium hardpoints and empty large hardpoints. The utility mounts are also empty by default. The internal compartments include a Cargo Rack [x64] (E, Class 6), a Shield Generator (E, Class 6), a Cargo Rack [x8] (E, Class 3), and a Supercruise Assist (E, Class 1), among others.", "metadata": {"entity_name": "Imperial Clipper", "document_type": "ship", "chunk_type": "default_loadout"}}