{"text": "The Type-6 Transporter is a freighter manufactured by Lakon Spaceways, produced from 3200 to the present. It costs 1,045,945 CR with an insurance value of 52,297 CR. It is a medium-sized ship, measuring 48.4m x 27.2m x 15.0m, with a hull mass of 155 tonnes. It has a mass lock factor of 8, armor rating of 324, armor hardness of 35, shields of 77 MJ, and a heat capacity of 179. It has a fuel capacity of 16 tonnes, a top speed of 223 m/s (default) or 255 m/s (upgraded), a boost speed of 355 m/s (default) or 406 m/s (upgraded), and an unladen jump range of 12.39 ly (default) or 30.73 ly (upgraded). Its cargo capacity is 50 tonnes (default) or 114 tonnes (max). It has 3 utility mounts and 2 small hardpoints. It has a default load-out that includes a pulse laser on each small hardpoint and empty utility mounts. It also has various internal compartments and systems, including cargo racks, a shield generator, and a supercruise assist.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-6 Transporter is the cheapest medium ship on the market and an amazing trader. It is considered the next step up in terms of cargo capacity from the multipurpose Cobra Mk III. When fitted for maximum cargo capacity, which can reach 114 tonnes, many traders find that the Type-6 becomes quite suited for trading standard commodities in bulk rather than hauling rare commodities in long jump distances. After upgrading the Frame Shift Drive to increase its jump range, the Type-6 Transporter is better at hauling commodities in long jump distances.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-6 Transporter has also found a niche as an exploration vessel; when stripped of all unnecessary weight and stocked with an upgraded frame shift drive, the Type-6 Transporter can reach jump ranges just short of the Asp Explorer at a much lower cost, though it is significantly less capable of defending itself than an Asp Explorer should it encounter a hostile vessel. It is still almost three times more expensive than the Cobra MK III, which can also be used for exploration. Because of its high Compartment count, it is capable of holding more fuel and a bigger fuel scoop and is better at Passenger missions.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "In combat, the Type-6 is second only to the Hauler as the worst ship in the role. It has the same hardpoints as the Sidewinder but has much lower mobility and thus cannot evade fire or keep its fixed hardpoints on a target nearly as well and also attracts much more dangerous vessels than the Sidewinder would. Its low maneuverability also makes it more vulnerable to interdiction. Its advantage is it can be quite hardy, its shields and armour are rather good for its price so it can often take hits, though this requires lowering the cargo capacity. The Type-6 has a deceptively low Mass Lock Factor of 8, meaning most ships can mass lock it. Jumping to another system to flee combat is advised due to this, as mass-locking will not occur. If one wishes to take down oncoming enemy pirates while still making some profit from trade the Keelback is a much better option.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The weapon hardpoints are located as follows: two bottom mounted Class 1 hardpoints on either side of the ship, separated by a central ridge. This layout makes it relatively easy to keep the ship's weapons trained on its target, but the Type-6's aforementioned poor performance in combat roles make it more likely that the owner will be equipping mining tools than weapons if they choose to install hardpoints at all.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-6 Transporter has a default load-out that includes a pulse laser on each of its two small hardpoints. It also has three empty utility mounts. Its bulkhead is equipped with lightweight alloys (Grade I, Class 1), and it has a power plant (Grade E, Class 3), thrusters (Grade E, Class 4), a frame shift drive (Grade E, Class 4), life support (Grade E, Class 2), a power distributor (Grade E, Class 3), sensors (Grade E, Class 2), and a fuel tank (Grade C, Class 4). Its internal compartments include cargo racks, a shield generator, a supercruise assist, and a passenger cabin (Grade I, Class 1).", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "outfitting"}}