{"text": "The Vulture is a small-sized combat ship manufactured by Core Dynamics, produced from 3301 to the present. It costs 4,925,615 CR with an insurance value of 246,280 CR.", "metadata": {"entity_name": "Vulture", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Vulture is a powerful small-sized ship capable of staying out of the firing range of larger ships like Anacondas or Pythons. Its two large hardpoints can dish out heavy damage, and its class 3 weapons have a high Armour-Pierce Rating, making it effective against larger ships. However, it is limited to conventional weaponry due to its low number of hardpoints.", "metadata": {"entity_name": "Vulture", "document_type": "ship", "chunk_type": "overview"}}
{"text": "Defensively, the Vulture has the highest base shield and armour strengths among small-sized ships, with four utility mounts like larger ships. However, its limited power capacity restricts loadout choices, and its speed is lower than most other small and some medium-sized ships, though it has formidable manoeuvrability.", "metadata": {"entity_name": "Vulture", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Vulture is overspecialized for combat and is not suited for other roles. It is effective against Thargoid Scouts but limited against Thargoid Interceptors due to its low number of hardpoints. Its cargo capacity is low, making it inefficient for trading, and its jump range is sub-par, limiting its exploration capabilities.", "metadata": {"entity_name": "Vulture", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Vulture functions like a small Fer-de-Lance, excelling in combat but being one of the worst ships in other roles. It has two large hardpoints located above and behind the cockpit, with two pilot seats accommodating Multicrew, though turreted mounts are not recommended.", "metadata": {"entity_name": "Vulture", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Vulture has dimensions of 43.1m x 34.7m x 12.3m, a hull mass of 230 t, and a mass lock factor of 10. It has an armour rating of 288, armour hardness of 55, shields of 293 MJ, and a heat capacity of 237. Its fuel capacity is 8 t, with a top speed of 215 m/s (default) or 244 m/s (upgraded), and a boost speed of 348 m/s (default) or 397 m/s (upgraded). Its unladen jump range is 7.93 ly (default) or 22.36 ly (upgraded), with a cargo capacity of 8 t (default) or 60 t (max).", "metadata": {"entity_name": "Vulture", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Vulture has 4x Utility Mounts and 2x Large Hardpoints. Its internal compartments include 4x Class 1, 1x Class 2, 1x Class 4, and 1x Class 5, with 1x Class 5 Military Compartment reserved.", "metadata": {"entity_name": "Vulture", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Vulture's default large hardpoints are equipped with Pulse Lasers (Class 1, Rating F), with a maximum class of 3. Its utility mounts are initially empty, with a maximum class of 0. The default bulkhead is Lightweight Alloys (Class 1, Rating I), with a maximum class of 8.", "metadata": {"entity_name": "Vulture", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Vulture's default reactor bay is a Power Plant (Class 4, Rating E), with a maximum class of 4. Its thrusters mounting is Thrusters (Class 5, Rating E), with a maximum class of 5. The frame shift drive housing is a Frame Shift Drive (Class 4, Rating E), with a maximum class of 4.", "metadata": {"entity_name": "Vulture", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Vulture's environment control is Life Support (Class 3, Rating E), with a maximum class of 3. Its power coupling is a Power Distributor (Class 5, Rating E), with a maximum class of 5. The sensor suite is Sensors (Class 4, Rating E), with a maximum class of 4.", "metadata": {"entity_name": "Vulture", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Vulture's fuel store is a Fuel Tank (Class 3, Rating C), with a maximum class of 3. Its internal compartments include a Shield Generator (Class 5, Rating E), Cargo Rack [x8] (Class 3, Rating E), and various empty compartments. It also has an Advanced Docking Computer, Supercruise Assist, and PAS (Class 1, Rating I or E).", "metadata": {"entity_name": "Vulture", "document_type": "ship", "chunk_type": "outfitting"}}