{"text": "The Viper Mk IV is a heavier variant of the Viper Mk III that sacrifices mobility for increased toughness. Its appearance is very similar to that of the Mk III and it can be difficult to tell the two apart, especially with the former's ship kit. By default, the Mk IV has weaker shields than the Mk III due to its higher hull mass. However, the Mk IV is capable of fitting a larger Class 4 shield generator, whereas the Viper Mk III is limited to a Class 3. This results in the Viper Mk IV potentially having much stronger shields than the Mk III. Stronger shields combined with a higher base hull and more space for Hull Reinforcement Packages can make the Viper Mk IV substantially more resilient than the Mk III. These improvements come with the drawbacks of slightly reduced turn rate and speed. This makes it vulnerable to attacks from more nimble ships like Eagle Mk II and Cobra Mk III, and can be a disadvantage in a direct firefight against a Viper Mk III. Worthy of note is that the Viper Mk IV suffers from heat dissipation issues similar to that of its predecessor, though it does run slightly cooler. Additionally, with a Class 4 Power Plant, it can more easily power weapons with high power draw such as Railguns, as well as better defenses such as Shield Boosters. Though it is one of the least agile small ships, it is also one of the toughest. It is far more resilient than any other ship in its price range and can hold its own in a pure combat role. Additionally, a fair cargo capacity makes it a viable option for a Pirate. Although the Viper Mk IV is a small ship, it is one of the best options for beginner deep-core asteroid mining. Its internal compartments and hardpoints can fit the necessary mining tools and still have space for 32-40 tonnes of cargo. Furthermore, such a build costs less than 10 million credits, making it affordable to all but the newest Commanders. Miners can use the Viper Mk IV to earn their way to superior mining ships, such as the Python, Krait Mk II, and Type-9 Heavy. The Viper Mk IV can be useful as a multi-role. With a maximum cargo capacity of 54T it is a surprisingly effective trader for a fighter class and an above average jump range lets the ship take on an explorer role. Compared to the Cobra Mk III, a similarly priced ship, the Viper Mk IV is slower with a worse turn rate, but faster acceleration in all directions. It has a lower cargo capacity (54 compared to 64) and a slightly worse jump rate than the Cobra Mk III. What sets the Viper Mk IV apart from the Cobra Mk III, however, is its substantially stronger shields. Even with a Class 3 shield generator the Viper Mk IV has almost 2x the shield strength of a Cobra Mk III. With a Class 4 it has even stronger shields than that. This means that the Viper Mk IV can sacrifice hull reinforcement for cargo space without making as large as a sacrifice in terms of defensive capabilities compared to the Cobra Mk III. Commanders looking for a ship that can deliver similar multirole performance to that of the Cobra Mk III and still be able to take a few hits may appreciate the Viper Mk IV. Overall, the Viper Mk IV exchanges mobility for defensive capabilities and can be more appealing to pilots who prefer bulkier ships. Whether it is better or worse than the Mk III comes down to preference and skill, though it does have a much higher price. The Viper Mk IV's hardpoint options are identical to those of the Viper Mk III. It has two Class 1 hardpoints located on either side of the cockpit and two Class 2 hardpoints located beneath it. Unlike the Viper Mk III, which has underside-mounted Class 2 medium hardpoints on a horizontally flat plane, the Class 2 medium hardpoints of the Mk IV are on a slightly angled part of the hull. The hardpoint placement on the Viper Mk IV gives it excellent convergence with fixed weapons but a narrow field of fire when using gimballed or turreted guns. The Viper Mk IV has a delta-shaped hull which is significantly wider than the Mk III. The cockpit is situated just behind the bow, slightly raised. Compared to the Mk III, the Mk IV's cockpit is less exposed. The Mk IV lands on two small rear struts and one large front strut which doubles as a boarding ramp to the cockpit.", "metadata": {"entity_name": "Viper Mk IV", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Viper Mk IV is a combat ship manufactured by Faulcon DeLacy, produced from 3301 to the present. It costs 437,930 CR with an insurance value of 21,897 CR.", "metadata": {"entity_name": "Viper Mk IV", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Viper Mk IV has dimensions of 29.9m x 24.7m x 8.7m, with a hull mass of 190 t and an armour rating of 270. It has shields of 103 MJ, a heat capacity of 209, and a fuel capacity of 16 t. The ship's manoeuvrability is rated at 3, with a top speed of 271 m/s (default) or 314 m/s (upgraded), and a boost speed of 342 m/s (default) or 395 m/s (upgraded). Its unladen jump range is 10.36 ly (default) or 27.38 ly (upgraded), with a cargo capacity of 18 t (default) or 54 t (max).", "metadata": {"entity_name": "Viper Mk IV", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Viper Mk IV has 2x Utility Mounts, 2x Small Hardpoints, and 2x Medium Hardpoints. It also has 3x Class 1 Compartments, 2x Class 2 Compartments, 1x Class 3 Compartment, and 2x Class 4 Compartments, with 1x Class 3 Military Compartment reserved.", "metadata": {"entity_name": "Viper Mk IV", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Viper Mk IV's default small hardpoints are two Pulse Lasers, both rated F and Class 1.", "metadata": {"entity_name": "Viper Mk IV", "document_type": "ship", "chunk_type": "hardpoints"}}
{"text": "The Viper Mk IV's medium hardpoints are initially empty, with a maximum class of 2.", "metadata": {"entity_name": "Viper Mk IV", "document_type": "ship", "chunk_type": "hardpoints"}}
{"text": "The Viper Mk IV's utility mounts are initially empty, with a maximum class of 0.", "metadata": {"entity_name": "Viper Mk IV", "document_type": "ship", "chunk_type": "hardpoints"}}
{"text": "The Viper Mk IV's default bulkhead is Lightweight Alloys, rated I and Class 1, with a maximum class of 8.", "metadata": {"entity_name": "Viper Mk IV", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Viper Mk IV's default reactor bay is a Power Plant, rated E and Class 4, with a maximum class of 4.", "metadata": {"entity_name": "Viper Mk IV", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Viper Mk IV's default thrusters mounting is Thrusters, rated E and Class 4, with a maximum class of 4.", "metadata": {"entity_name": "Viper Mk IV", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Viper Mk IV's default power coupling is a Power Distributor, rated E and Class 3, with a maximum class of 3.", "metadata": {"entity_name": "Viper Mk IV", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Viper Mk IV's default sensor suite is Sensors, rated E and Class 3, with a maximum class of 3.", "metadata": {"entity_name": "Viper Mk IV", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Viper Mk IV's default fuel store is a Fuel Tank, rated C and Class 4, with a maximum class of 4.", "metadata": {"entity_name": "Viper Mk IV", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Viper Mk IV's internal compartments include two Cargo Racks [x8], both rated E and Class 3, with a maximum class of 4; one Shield Generator, rated E and Class 3, with a maximum class of 3; one empty compartment (M), with a maximum class of 3; one Cargo Rack [x2], rated E and Class 1, with a maximum class of 2; two empty compartments, with a maximum class of 2 and 1 respectively; one Advanced Docking Computer, rated E and Class 1, with a maximum class of 1; one Supercruise Assist, rated E and Class 1, with a maximum class of 1; and one (PAS), rated I and Class 1, with a maximum class of 1.", "metadata": {"entity_name": "Viper Mk IV", "document_type": "ship", "chunk_type": "outfitting"}}