{"text": "The Corsair is a multirole ship manufactured by Gutamaya, produced from 3311 to the present. It is priced at 79,304,750 CR with an insurance cost of 3,965,238 CR. The ship is designed to excel in all three main roles equally, making it superior to the Python. It can carry up to 318t of cargo, the highest among medium ships apart from the Type-8 Transporter. The Corsair's max speed is capped at 600 m/s through engineering, and its size 7 thrusters ensure reliable acceleration even with high-mass loadouts. The ship features blue neon strip lights, minimal heat vents, and a cockpit similar to the Imperial Courier with an extra seat. All hardpoints are located on the fuselage, affording tighter weapon convergence. The Corsair was unveiled on 26 February 2025 and launched for ARX on 8 April 2025, becoming available for credits on 4 July 2025. Initially, it had a mass lock factor of 7, which was fixed in the Trailblazers Update 3 on 30 April 2025.", "metadata": {"entity_name": "Corsair", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Corsair has dimensions of 86.8m x 69.4m x 16m, with a hull mass of 265 t and a mass lock factor of 17. It features 2 pilot seats, multicrew capability, and no fighter hangar. The ship's armour rating is 486 with a hardness of 65, shields of 264 MJ, heat capacity of 280, and fuel capacity of 32 t. Its manoeuvrability is rated at 4. The default top speed is 288 m/s (upgradable to 325 m/s), boost speed is 366 m/s (upgradable to 412 m/s), and unladen jump range is 12.96 ly (upgradable to 39.58 ly). The cargo capacity is 48 t by default, expandable to 318 t.", "metadata": {"entity_name": "Corsair", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Corsair is equipped with 4x Utility Mounts, 3x Medium Hardpoints, and 3x Large Hardpoints. Its internal compartments include 1x Class 1, 1x Class 2, 1x Class 3, 1x Class 4, 3x Class 5, and 3x Class 6 compartments. The default loadout includes Pulse Lasers (Class 1, Rating F) on two of the medium hardpoints, with the remaining hardpoints empty. The utility mounts are also empty by default.", "metadata": {"entity_name": "Corsair", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Corsair's default systems include Lightweight Alloys (Bulkhead, Class 1, Rating C), Power Plant (Reactor Bay, Class 7, Rating E), Thrusters (Class 7, Rating E), Frame Shift Drive (SCO) (Class 5, Rating E), Life Support (Environmental Control, Class 4, Rating E), Power Distributor (Class 7, Rating E), Sensors (Class 6, Rating E), and Fuel Tank (Class 5, Rating C). Internal compartments feature various systems such as Cargo Racks, Shield Generator, Supercruise Assist, Advanced Docking Computer, and PAS.", "metadata": {"entity_name": "Corsair", "document_type": "ship", "chunk_type": "outfitting"}}