{"text": "The Alliance Challenger is a combat ship manufactured by Lakon Spaceways, produced from 3304 to the present. It is designed for owners of the Alliance Chieftain seeking added firepower and durability. The Challenger trades one Class 3 hardpoint for two Class 2 hardpoints, increasing its damage output. It retains the Chieftain's maneuverability, with slightly lower pitch and yaw speeds, and offers increased shield and armor health. Its extra Class 6 internal compartment allows for a larger Shield Cell Bank, enhancing its defenses. The Challenger is highly effective against medium and even large ships like the Anaconda, and is well-suited for hunting Thargoid ships. It has a cargo capacity of 154t, making it a capable trader and miner. The main downsides are its higher cost and reduced jump range of just under 24 LYs before engineering, which decreases further when outfitted with armor. The Challenger's hardpoints are arranged similarly to the Chieftain, with utility slots well-distributed and minimal obstructions. It features a second seat for multicrew and is most commonly available in Alliance systems, requiring no rank or reputation with the Alliance to purchase.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Alliance Challenger has a hull mass of 450t, a mass lock factor of 13, armor of 540 with a hardness of 65, shields of 208 MJ, and a heat capacity of 316. It has a fuel capacity of 16t, a maneuverability rating of 4, a top speed of 204 m/s (default) or 251 m/s (upgraded), a boost speed of 316 m/s (default) or 360 m/s (upgraded), an unladen jump range of 8.58 ly (default) or 23.87 ly (upgraded), and a cargo capacity of 40t (default) or 152t (max). It features 4 utility mounts, 3 small hardpoints, 3 medium hardpoints, and 1 large hardpoint. Internal compartments include 1 Class 1, 2 Class 2, 2 Class 3, and 2 Class 6 compartments, with 3 Class 4 military compartments reserved.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "specifications"}}