{"text": "The Krait Mk II is a multirole combat ship manufactured by Faulcon DeLacy, produced from 3304 to the present. It is a leaner and faster alternative to the Python, featuring similar module and hardpoint specifications but with a lower cost, higher speed, improved handling, and a higher jump range potential. It can carry a Fighter Hangar but has one less Class 6 internal compartment, weaker armor, and shields compared to the Python. The Krait Mk II sacrifices some utility as a freighter for speed and jump range, making it a viable multirole option with strong combat ability. The Krait Phantom variant emphasizes multirole qualities and speed, reducing firepower, armor, cargo capacity, and removing the Fighter Hangar and one Class 3 hardpoint, but improving speed, handling, and jump range. The Krait Mk II is better for combat, trading, and mining, while the Krait Phantom is ideal for explorers or pilots without need for a Fighter Hangar.", "metadata": {"entity_name": "Krait Mk II", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Krait Mk II has dimensions of 73.3m x 72m x 13.5m, with a hull mass of 320 tons and a mass lock factor of 17. It features 3 pilot seats, multicrew capability, and a Fighter Hangar. Its armor rating is 396 with an armor hardness of 55, and its shields are 262 MJ. The ship has a heat capacity of 300, a fuel capacity of 32 tons, and a maneuverability rating of 3. Its top speed is 245 m/s (default) or 274 m/s (upgraded), with a boost speed of 337 m/s (default) or 383 m/s (upgraded). The unladen jump range is 8.99 ly (default) or 30.79-60~ ly (upgraded), and the cargo capacity is 82 t (default) or 230 t (max).", "metadata": {"entity_name": "Krait Mk II", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Krait Mk II has 4 utility mounts, 2 medium hardpoints, and 3 large hardpoints. Its internal compartments include 1 Class 1, 1 Class 2, 2 Class 3, 1 Class 4, 2 Class 5, and 2 Class 6 compartments. The default outfitting includes Pulse Lasers (Class 1, Grade F) on the medium hardpoints, and empty large hardpoints. The utility mounts are also empty. The ship's bulkhead is outfitted with Lightweight Alloys (Class 1, Grade C).", "metadata": {"entity_name": "Krait Mk II", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Krait Mk II's three Class 3 hardpoints are mounted in a delta pattern on the dorsal surface, behind the cockpit. The two medium hardpoints are located on the underside of the front-most points of the hull, on either side of the cockpit and slightly forward. Combined with a Fighter Hangar, the Krait Mk II can bring a considerable amount of firepower to bear for its size, and its hardpoint placement ensures that the pilot can keep weapons on a target without any difficulty.", "metadata": {"entity_name": "Krait Mk II", "document_type": "ship", "chunk_type": "hardpoints"}}
{"text": "The primary pilot's seat is located along the centerline of the ship, with the cockpit extending from the hull and slightly under-slung, providing a wide, unobstructed frontal view. The two secondary pilot seats flank the primary pilot seat to the left and right, each with separate canopies. The cockpit position allows the pilot to have a clear view of the Krait Mk II's two medium hardpoints when they are deployed.", "metadata": {"entity_name": "Krait Mk II", "document_type": "ship", "chunk_type": "cockpit"}}
{"text": "The Krait Mk II's default internal compartments include a Shield Generator (Class 6, Grade E), two Cargo Racks (Class 5, Grade E), a Cargo Rack (Class 4, Grade E), and a Cargo Rack (Class 1, Grade E). It also has a Supercruise Assist (Class 1, Grade E) and a PAS (Class 1, Grade I). The remaining compartments are empty but can be outfitted with various systems.", "metadata": {"entity_name": "Krait Mk II", "document_type": "ship", "chunk_type": "internal_compartments"}}