{"text": "The Federal Gunship is a heavily armored and armed medium-sized combat ship manufactured by Core Dynamics, produced from 3301 to present. It features seven weapon hardpoints and four utility mounts, with a cost of 35,658,297 CR and insurance of 1,782,915 CR.", "metadata": {"entity_name": "Federal Gunship", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Federal Gunship has dimensions of 75.5m x 53.3m x 22.5m, with a hull mass of 580 tons and a mass lock factor of 14. It has an armor rating of 630 with hardness of 60, shields of 186 MJ, and a heat capacity of 325. The ship has a fuel capacity of 16 tons, a top speed of 171 m/s (upgradable to 197 m/s), a boost speed of 282 m/s (upgradable to 325 m/s), and an unladen jump range of 6.66 ly (upgradable to 19.40 ly). It can carry up to 170 tons of cargo and has a manoeuvrability rating of 1.", "metadata": {"entity_name": "Federal Gunship", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Federal Gunship features four utility mounts, two small hardpoints, four medium hardpoints, and one large hardpoint. It has internal compartments including one Class 1, two Class 2, one Class 5, and two Class 6 compartments, with three Class 4 military compartments reserved.", "metadata": {"entity_name": "Federal Gunship", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Federal Gunship's default outfitting includes two small hardpoints with no default systems, four medium hardpoints with Pulse Lasers (L) rated F on two of them, and one large hardpoint with no default system. It also has four utility mounts with no default systems.", "metadata": {"entity_name": "Federal Gunship", "document_type": "ship", "chunk_type": "hardpoints"}}
{"text": "The Federal Gunship's default outfitting includes a Lightweight Alloys bulkhead rated I on Class 1, a Power Plant rated E on Class 6, Thrusters rated E on Class 6, a Frame Shift Drive rated E on Class 5, Life Support rated E on Class 5, a Power Distributor rated E on Class 7, Sensors rated E on Class 5, and a Fuel Tank rated C on Class 4.", "metadata": {"entity_name": "Federal Gunship", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Federal Gunship's internal compartments include a Shield Generator rated E on Class 6, a Cargo Rack [x16] rated E on Class 4, and several empty compartments of varying classes. It also has a Supercruise Assist rated E on Class 1 and a (PAS) rated I on Class 1.", "metadata": {"entity_name": "Federal Gunship", "document_type": "ship", "chunk_type": "internal_compartments"}}