{"text": "The Krait Phantom is a multirole ship manufactured by Faulcon DeLacy, produced from 3304 to the present. It is a variation of the Krait Mk II, emphasizing speed and maneuverability with a streamlined design and reduced mass. The Phantom has a slightly greater jump range and higher speed but lower armor, shield strength, and cargo capacity compared to the Mk II. It is effective in combat, exploration, and as a pirate or bounty hunter vessel, though it is less suited for trading and mining due to its reduced cargo capacity and lack of a fighter hangar. The ship's hardpoints are arranged similarly to the Krait Mk II, with two Class 3 hardpoints on the dorsal surface and two Class 2 hardpoints on the underside of the hull. The cockpit is under-slung, providing a wide frontal view.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Krait Phantom has dimensions of 73.3m x 72.0m x 14.6m, with a hull mass of 270 tonnes and a mass lock factor of 17. It features 2 pilot seats, multicrew capability, and no fighter hangar. The ship's armor rating is 324 with an armor hardness of 55, and its shields have a capacity of 260 MJ. The heat capacity is 300, and the fuel capacity is 32 tonnes. The Phantom has a maneuverability rating of 3, with a top speed of 256 m/s (default) or 290 m/s (upgraded), and a boost speed of 358 m/s (default) or 406 m/s (upgraded). The unladen jump range is 9.78 ly (default) or 34.79 ly (upgraded), and the cargo capacity is 82 tonnes (default) or 190 tonnes (max).", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Krait Phantom's outfitting includes 4 utility mounts, 2 medium hardpoints, and 2 large hardpoints. Its internal compartments consist of 1 Class 1, 1 Class 2, 3 Class 3, 3 Class 5, 1 Class 6, and no reserved compartments. The default loadout includes Pulse Lasers (Class 1, Rating F) on the medium hardpoints, and empty large hardpoints. Utility mounts are also empty by default. The ship's bulkhead is equipped with Lightweight Alloys (Class 1, Rating C), and other systems include a Power Plant (Class 7, Rating E), Thrusters (Class 6, Rating E), Frame Shift Drive (Class 5, Rating E), Life Support (Class 4, Rating E), Power Distributor (Class 7, Rating E), Sensors (Class 6, Rating E), and a Fuel Tank (Class 5, Rating C). Internal compartments house a Shield Generator (Class 6, Rating E), multiple Cargo Racks, and other systems.", "metadata": {"entity_name": "Krait Phantom", "document_type": "ship", "chunk_type": "outfitting"}}