{"text": "The Alliance Crusader is the third ship in the Alliance faction series and the second variant of the Alliance Chieftain, known for its ability to equip a Fighter Hangar for Ship-Launched Fighters, a feature lacking in the Chieftain and Alliance Challenger. It has four pilot seats, two more than its companion ships.", "metadata": {"entity_name": "Alliance Crusader", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Alliance Crusader has a similar hardpoint layout to the Alliance Chieftain but trades one Class 3 hardpoint for one Class 2 hardpoint, making it comparable to a Federal Assault Ship in terms of base firepower. Its increased mass reduces its maneuverability and speed compared to the Chieftain and Challenger, but it retains the series' handling features and surpasses the agility of other medium-size ships that can launch fighters, including the Krait Mk II.", "metadata": {"entity_name": "Alliance Crusader", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Alliance Crusader's reduced number of hardpoints is offset by its ability to deploy Ship-Launched Fighters, potentially making it a stronger combat option. It retains three Military Compartments but trades the Chieftain's single Class 4 Internal Compartment for two Class 3 slots, providing more flexibility in module selection but the same maximum cargo capacity of 120t.", "metadata": {"entity_name": "Alliance Crusader", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Alliance Crusader has a lower jump range than the Challenger, making it less ideal for exploration and emphasizing its combat use. Compared to the Chieftain and Challenger, it has lower mobility, multipurpose potential, and weapons loadout versatility due to fewer hardpoints. However, its ability to deploy two fighters simultaneously is a significant advantage, especially with skilled pilots.", "metadata": {"entity_name": "Alliance Crusader", "document_type": "ship", "chunk_type": "overview"}}
{"text": "Compared to the Krait Mk II, the Alliance Crusader has a lower top speed, superior agility, weaker shields, and a more durable hull. Compared to the Federal Gunship, it is faster, more agile, with higher hull durability and similar but potentially lower shield capacity, depending on the loadout. The Crusader must be fitted with a Class 5 shield generator to use a Class 6 Fighter Hangar and 2 SLFs, trading defense for firepower.", "metadata": {"entity_name": "Alliance Crusader", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Alliance Crusader is most commonly available in Alliance systems and does not require any rank or reputation with the Alliance to purchase. It is highly customizable through the Outfitting menu of Station Services.", "metadata": {"entity_name": "Alliance Crusader", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Alliance Crusader, manufactured by Lakon Spaceways since 3304, is a combat ship costing 25,367,279 CR with an insurance value of 1,268,364 CR. It measures 68.1m x 58.5m x 19.8m, has 3-4 pilot seats, supports multicrew, and features a fighter hangar. It has a hull mass of 500 t, armour of 540 with a hardness of 65, shields of 126 MJ, and a heat capacity of 316. Its fuel capacity is 16 t, with a default cargo capacity of 40 t and a maximum of 122 t.", "metadata": {"entity_name": "Alliance Crusader", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Alliance Crusader has a manoeuvrability rating of 3, a default top speed of 183 m/s (upgradable to 209 m/s), a default boost speed of 305 m/s (upgradable to 348 m/s), and a default unladen jump range of 8.21 ly (upgradable to 21.76 ly). It features 4 utility mounts, 3 small hardpoints, 2 medium hardpoints, and 1 large hardpoint. It has 1 Class 1, 2 Class 2, 2 Class 3, 1 Class 5, and 1 Class 6 internal compartments, with 3 reserved Class 4 military compartments.", "metadata": {"entity_name": "Alliance Crusader", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Alliance Crusader's default outfitting includes empty small and large hardpoints, Pulse Lasers (L) on medium hardpoints, and empty utility mounts. Its bulkhead is rated C for Class 1, with a maximum of Class 8. The reactor bay and thrusters mounting are rated E for Class 6, while the frame shift drive housing and environment control are rated E for Class 5. The power coupling is rated E for Class 6, and the sensor suite is rated E for Class 4.", "metadata": {"entity_name": "Alliance Crusader", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Alliance Crusader's default internal compartments include a Cargo Rack [x32] rated E for Class 5, a Shield Generator rated E for Class 5, three empty Class 4 compartments, two Cargo Racks [x4] rated E for Class 2, two empty Class 2 compartments, a Supercruise Assist rated E for Class 1, and a (PAS) rated I for Class 1.", "metadata": {"entity_name": "Alliance Crusader", "document_type": "ship", "chunk_type": "outfitting"}}