{"text": "The Orca is Saud Kruger's middle-of-the-road passenger liner, with greater passenger capacity than the Dolphin but less than the Beluga Liner. It's larger than medium ships, requiring a large landing pad. Despite its size, it has a sleeker design, better maneuverability, and a greater jump range than the Beluga Liner. It's not ideal for combat due to its hardpoint placement and limited power plant, but it can be outfitted for shieldless combat with high armor values. It's a solid choice for exploration and long-range passenger hauling, but not for trading or mining due to its high price and low cargo capacity.", "metadata": {"entity_name": "Orca", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Orca is manufactured by Saud Kruger and has been in production from 3300 to the present. It's a passenger liner with a cost of 48,539,887 CR and insurance of 2,426,994 CR. It has a landing pad size of large, dimensions of 130.4m x 50.8m x 22.7m, and a hull mass of 290 t. It has 2 pilot seats, is multicrew compatible, and has a heat capacity of 262. It's not equipped with a hangar.", "metadata": {"entity_name": "Orca", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Orca has an armour rating of 396 and shields of 233 MJ. It has a top speed of 308 m/s (default) and 348 m/s (upgraded), a boost speed of 390 m/s (default) and 441 m/s (upgraded), and an unladen jump range of 10.52 ly (default) and 36.17 ly (upgraded). It has a cargo capacity of 72 t (default) and 194 t (max).", "metadata": {"entity_name": "Orca", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Orca has 4x Utility Mounts, 2x Medium Hardpoints, and 1x Large Hardpoint. It has internal compartments including 1x Class 1, 2x Class 2, 1x Class 3, 1x Class 4, 3x Class 5, and 1x Class 6. It has no reserved compartments.", "metadata": {"entity_name": "Orca", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Orca's default medium hardpoints are equipped with Pulse Laser (L) systems, rated F, class 1, with a maximum class of 2. Its utility mounts are initially empty. The default bulkhead system is Lightweight Alloys, rated I, class 1, with a maximum class of 8. The default reactor bay system is a Power Plant, rated E, class 5, with a maximum class of 5.", "metadata": {"entity_name": "Orca", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Orca's default frame shift drive housing system is a Frame Shift Drive, rated E, class 5, with a maximum class of 5. The default environment control system is Life Support, rated E, class 6, with a maximum class of 6. The default power coupling system is a Power Distributor, rated E, class 5, with a maximum class of 5. The default sensor suite system is Sensors, rated E, class 4, with a maximum class of 4.", "metadata": {"entity_name": "Orca", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Orca's default fuel store system is a Fuel Tank, rated C, class 5, with a maximum class of 5. Its internal compartments include Cargo Rack [x32], Cargo Rack [x16], Cargo Rack [x16], Shield Generator, Cargo Rack [x8], and Empty compartments. It also has a Supercruise Assist and a (PAS) system.", "metadata": {"entity_name": "Orca", "document_type": "ship", "chunk_type": "outfitting"}}