{"text": "The Cobra Mk V is a multirole ship manufactured by Faulcon DeLacy, produced from 3310 to the present. It costs 1,989,461 CR with an insurance value of 99,473 CR. The ship features a redesigned cockpit with a central pilot seat and two multicrew seats on either side, offering great visibility through large windows and a wide, transparent floor. It excels in trading, mining, and combat roles, with exceptional cargo capacity and versatile hard points. In combat, it outperforms its predecessors but is outclassed by the Vulture in armor, maneuverability, shields, and firepower. However, the Cobra is faster, more versatile, and less expensive. As an explorer, it has a well-above-average jump range and is highly customizable. It was unveiled during Frontier Unlocked in October 2024, with more details and in-game footage revealed in November 2024. Early access for ARX started on December 12, 2024.", "metadata": {"entity_name": "Cobra Mk V", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Cobra Mk V has dimensions of 41.2m x 55.1m x 9.47m, with a hull mass of 150 tons and a mass lock factor of 8. It features 3 pilot seats and supports multicrew. The ship has an armor rating of 324 with a hardness of 40, shields of 235 MJ, and a heat capacity of 245. It has a fuel capacity of 16 tons, a top speed of 294 m/s (default) or 336 m/s (upgraded), a boost speed of 415 m/s (default) or 476 m/s (upgraded), and an unladen jump range of 16.79 ly (default) or 34.55 ly (upgraded). The cargo capacity is 12 tons (default) or 110 tons (max).", "metadata": {"entity_name": "Cobra Mk V", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Cobra Mk V has 4 utility mounts, 2 small hardpoints, and 3 medium hardpoints. It includes 1 class 1, 1 class 2, 3 class 3, 3 class 4, and 1 class 5 internal compartments. The default loadout includes pulse lasers on the small hardpoints and empty medium hardpoints. The bulkhead is equipped with lightweight alloys (grade I, class 1), and the reactor bay has a power plant (grade E, class 4). Thrusters (grade E, class 4), frame shift drive (grade E, class 4), life support (grade E, class 3), power distributor (grade E, class 4), sensors (grade E, class 3), and fuel tank (grade C, class 4) are also included. Internal compartments feature a shield generator (grade C, class 4), cargo racks, advanced docking computer (grade E, class 1), supercruise assist (grade E, class 1), and PAS (grade I, class 1).", "metadata": {"entity_name": "Cobra Mk V", "document_type": "ship", "chunk_type": "outfitting"}}