{"text": "The Type-6 Transporter is a freighter manufactured by Lakon Spaceways, produced from 3200 to the present. It costs 1,045,945 CR and has an insurance value of 52,297 CR. It is considered the next step up in terms of cargo capacity from the multipurpose Cobra Mk III. When fitted for maximum cargo capacity, which can reach 114 tonnes, many traders find that the Type-6 becomes quite suited for trading standard commodities in bulk rather than hauling rare commodities in long jump distances. After upgrading the Frame Shift Drive to increase its jump range, the Type-6 Transporter is better at hauling commodities in long jump distances.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-6 Transporter has also found a niche as an exploration vessel; when stripped of all unnecessary weight and stocked with an upgraded frame shift drive, the Type-6 Transporter can reach jump ranges just short of the Asp Explorer at a much lower cost, though it is significantly less capable of defending itself than an Asp Explorer should it encounter a hostile vessel. It is still almost three times more expensive than the Cobra MK III, which can also be used for exploration. Because of its high Compartment count, it is capable of holding more fuel and a bigger fuel scoop and is better at Passenger missions.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "In combat, the Type-6 is second only to the Hauler as the worst ship in the role. It has the same hardpoints as the Sidewinder but has much lower mobility and thus cannot evade fire or keep its fixed hardpoints on a target nearly as well and also attracts much more dangerous vessels than the Sidewinder would. Its low maneuverability also makes it more vulnerable to interdiction. Its advantage is it can be quite hardy, its shields and armour are rather good for its price so it can often take hits, though this requires lowering the cargo capacity. The Type-6 has a deceptively low Mass Lock Factor of 8, meaning most ships can mass lock it. Jumping to another system to flee combat is advised due to this, as mass-locking will not occur. If one wishes to take down oncoming enemy pirates while still making some profit from trade the Keelback is a much better option.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The weapon hardpoints are located as follows: two bottom mounted Class 1 hardpoints on either side of the ship, separated by a central ridge. This layout makes it relatively easy to keep the ship's weapons trained on its target, but the Type-6's aforementioned poor performance in combat roles make it more likely that the owner will be equipping mining tools than weapons if they choose to install hardpoints at all.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-6 Transporter has a landing pad size of Medium, dimensions of 48.4m x 27.2m x 15.0m, and a pilot seat capacity of 1. It has a hull mass of 155 t, armor rating of 324, armor hardness of 35, shields of 77 MJ, heat capacity of 179, and fuel capacity of 16 t. Its maneuverability is rated at 3, with a top speed of 223 m/s (default) and 255 m/s (upgraded), boost speed of 355 m/s (default) and 406 m/s (upgraded), unladen jump range of 12.39 ly (default) and 30.73 ly (upgraded), and cargo capacity of 50 t (default) and 114 t (max).", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Type-6 Transporter has 3x Utility Mounts and 2x Small Hardpoints. Its internal compartments include 1x Class 1, 2x Class 2, 1x Class 3, 2x Class 4, and 2x Class 5 compartments. It has no reserved compartments.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Type-6 Transporter's default small hardpoints are two Pulse Lasers, both rated F, class 1, with a maximum class of 1.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "hardpoints"}}
{"text": "The Type-6 Transporter's default utility mounts are all empty, with a maximum class of 0.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "hardpoints"}}
{"text": "The Type-6 Transporter's default bulkhead is Lightweight Alloys, rated I, class 1, with a maximum class of 8.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Type-6 Transporter's default reactor bay is a Power Plant, rated E, class 3, with a maximum class of 3.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Type-6 Transporter's default thrusters mounting is Thrusters, rated E, class 4, with a maximum class of 4.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Type-6 Transporter's default frame shift drive housing is a Frame Shift Drive, rated E, class 4, with a maximum class of 4.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Type-6 Transporter's default environment control is Life Support, rated E, class 2, with a maximum class of 2.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Type-6 Transporter's default power coupling is a Power Distributor, rated E, class 3, with a maximum class of 3.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Type-6 Transporter's default sensor suite is Sensors, rated E, class 2, with a maximum class of 2.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Type-6 Transporter's default fuel store is a Fuel Tank, rated C, class 4, with a maximum class of 4.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Type-6 Transporter's internal compartments include two Cargo Racks [x16], rated E, class 4, with a maximum class of 5; two Cargo Racks [x8], rated E, class 3, with a maximum class of 4; a Shield Generator, rated E, class 3, with a maximum class of 3; a Cargo Rack [x2], rated E, class 1, with a maximum class of 2; an empty compartment with a maximum class of 2; a Supercruise Assist, rated E, class 1, with a maximum class of 1; and a (PAS), rated I, class 1, with a maximum class of 1.", "metadata": {"entity_name": "Type-6 Transporter", "document_type": "ship", "chunk_type": "outfitting"}}