{"text": "The Anaconda is a multirole ship manufactured by Faulcon DeLacy, produced from 2856 to the present. It is a formidable combat ship with eight weapon hardpoints, capable of equipping Class 4 weaponry. It is recommended to use turreted and gimballed weapons due to its stiff handling. The Anaconda is extremely sturdy with eight utility mounts and a potent Class 8 Power Plant, allowing for strong defensive capabilities. It has a base armor strength of 945 and can be reinforced up to 10,755 with Engineering. Its Mass Lock Factor of 23 makes it difficult to be mass locked by other ships, but it is the slowest of the big three ships. The Anaconda is also the best exploration ship in the game with a jump range of 41.45 LY before Engineering, and up to 90 LY with Engineering. It has a large fuel tank and can fit a Class 7 Fuel Scoop. However, its size and slow turning rate in Supercruise can be drawbacks. The Anaconda is also used for trading and mining, with a cargo capacity of 468T and the ability to fit a Fighter Hangar. As a combat battleship, it has high DPS and strong armor, but its slow speed and maneuverability can be limitations. The Anaconda's bridge is located on the top of the ship, with a wide horizontal field of view but limited vertical view. The ship's nose and deployed hardpoints can obstruct the pilot's view. Overall, the Anaconda excels as a multi-role ship but has high outfitting and maintenance costs.", "metadata": {"entity_name": "Anaconda", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Anaconda has a hull mass of 400 tons and a mass lock factor of 23. It has an armor rating of 945 with an armor hardness of 65, and shields of 362 MJ. Its heat capacity is 334, and it has a fuel capacity of 32 tons. The ship has a top speed of 183 m/s (default) or 209 m/s (upgraded), a boost speed of 244 m/s (default) or 279 m/s (upgraded), and an unladen jump range of 9.41 LY (default) or 41.45 LY (upgraded). Its cargo capacity is 114 tons (default) or 470 tons (max).", "metadata": {"entity_name": "Anaconda", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Anaconda has 8 utility mounts, 2 small hardpoints, 2 medium hardpoints, 3 large hardpoints, and 1 huge hardpoint. It also has various internal compartments, including 1 Class 1, 1 Class 2, 3 Class 4, 3 Class 5, 3 Class 6, and 1 Class 7 compartment, as well as 1 Class 5 Military Compartment.", "metadata": {"entity_name": "Anaconda", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Anaconda's default small hardpoints are equipped with Pulse Lasers (Class 1, Rating F).", "metadata": {"entity_name": "Pulse Laser", "document_type": "weapon", "class": "1", "rating": "F"}}
{"text": "The Anaconda's medium hardpoints are initially empty but can be equipped with weapons up to Class 2.", "metadata": {"entity_name": "Medium Hardpoint", "document_type": "ship", "chunk_type": "hardpoints"}}
{"text": "The Anaconda's large hardpoints are initially empty but can be equipped with weapons up to Class 3.", "metadata": {"entity_name": "Large Hardpoint", "document_type": "ship", "chunk_type": "hardpoints"}}
{"text": "The Anaconda's utility mounts are initially empty but can be equipped with various systems up to Class 0.", "metadata": {"entity_name": "Utility Mount", "document_type": "ship", "chunk_type": "hardpoints"}}
{"text": "The Anaconda's bulkhead is equipped with Lightweight Alloys (Class 1, Rating I).", "metadata": {"entity_name": "Lightweight Alloys", "document_type": "equipment", "class": "1", "rating": "I"}}
{"text": "The Anaconda's reactor bay is equipped with a Power Plant (Class 8, Rating E).", "metadata": {"entity_name": "Power Plant", "document_type": "equipment", "class": "8", "rating": "E"}}
{"text": "The Anaconda's thrusters are equipped with Thrusters (Class 7, Rating E).", "metadata": {"entity_name": "Thrusters", "document_type": "equipment", "class": "7", "rating": "E"}}
{"text": "The Anaconda's frame shift drive housing is equipped with a Frame Shift Drive (Class 6, Rating E).", "metadata": {"entity_name": "Frame Shift Drive", "document_type": "equipment", "class": "6", "rating": "E"}}
{"text": "The Anaconda's environment control is equipped with Life Support (Class 5, Rating E).", "metadata": {"entity_name": "Life Support", "document_type": "equipment", "class": "5", "rating": "E"}}
{"text": "The Anaconda's power coupling is equipped with a Power Distributor (Class 8, Rating E).", "metadata": {"entity_name": "Power Distributor", "document_type": "equipment", "class": "8", "rating": "E"}}
{"text": "The Anaconda's sensor suite is equipped with Sensors (Class 8, Rating E).", "metadata": {"entity_name": "Sensors", "document_type": "equipment", "class": "8", "rating": "E"}}
{"text": "The Anaconda's fuel store is equipped with a Fuel Tank (Class 5, Rating C).", "metadata": {"entity_name": "Fuel Tank", "document_type": "equipment", "class": "5", "rating": "C"}}
{"text": "The Anaconda's internal compartments include various cargo racks, a shield generator, and other systems. The default loadout includes Cargo Rack [x64] (Class 6, Rating E), Cargo Rack [x32] (Class 5, Rating E), Shield Generator (Class 6, Rating E), Cargo Rack [x16] (Class 4, Rating E), and Supercruise Assist (Class 1, Rating E).", "metadata": {"entity_name": "Internal Compartment", "document_type": "ship", "chunk_type": "outfitting"}}