{"text": "The Alliance Chieftain is a combat ship manufactured by Lakon Spaceways, produced from 3304 to the present. It is priced at 19,382,250 CR with an insurance cost of 969,113 CR. The ship is highly competitive, offering similar capabilities to more expensive ships like the Python and Federal Gunship, with a strong focus on combat and versatility.", "metadata": {"entity_name": "Alliance Chieftain", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Alliance Chieftain features dimensions of 68.1m x 58.5m x 19.9m, with a hull mass of 400 tons. It has a mass lock factor of 13, armor rating of 504, armor hardness of 65, and shields of 162 MJ. The ship's heat capacity is 289, fuel capacity is 16 tons, and it can carry up to 120 tons of cargo. It has a top speed of 235 m/s (default) or 267 m/s (upgraded), a boost speed of 338 m/s (default) or 383 m/s (upgraded), and an unladen jump range of 9.59 ly (default) or 27.83 ly (upgraded).", "metadata": {"entity_name": "Alliance Chieftain", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Alliance Chieftain is equipped with 4 utility mounts, 3 small hardpoints, 1 medium hardpoint, and 2 large hardpoints. It has internal compartments including 1 Class 1, 2 Class 2, 1 Class 4, 1 Class 5, and 1 Class 6 compartment, with 3 reserved Class 4 military compartments.", "metadata": {"entity_name": "Alliance Chieftain", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Alliance Chieftain's default outfitting includes empty small hardpoints, a Pulse Laser (L) on the medium hardpoint, empty large hardpoints, and empty utility mounts. It features a Lightweight Alloys bulkhead (Class 1, Grade C), a Power Plant reactor bay (Class 6, Grade E), Thrusters (Class 6, Grade E), a Frame Shift Drive (Class 5, Grade E), Life Support (Class 5, Grade E), a Power Distributor (Class 6, Grade E), Sensors (Class 4, Grade E), and a Fuel Tank (Class 4, Grade C).", "metadata": {"entity_name": "Alliance Chieftain", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Alliance Chieftain's internal compartments include a Cargo Rack [x32] (Class 5, Grade E), a Shield Generator (Class 5, Grade E), a Cargo Rack [x8] (Class 3, Grade E), and several empty compartments of varying classes. It also features a Supercruise Assist (Class 1, Grade E) and a (PAS) system (Class 1, Grade I).", "metadata": {"entity_name": "Alliance Chieftain", "document_type": "ship", "chunk_type": "outfitting"}}