{"text": "The Beluga Liner is the largest ship in the Saud Kruger line after the Dolphin and Orca, designed for luxury VIP passengers with a focus on comfort and maneuverability over speed and cargo capacity. It features a Class 7 Frame Shift Drive and a 128-tonne Fuel Tank for long-distance travel, and can fit a Fighter Hangar for modest offensive capabilities.", "metadata": {"entity_name": "Beluga Liner", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Beluga Liner has a cargo capacity of 44 tonnes by default, expandable to 370 tonnes, but is inefficient for trading compared to other ships like the Type-9 Heavy. It is better suited for exploration with a jump range of 40-50 ly when equipped with a Guardian Frame Shift Drive Booster, offering ample internal space and an open cockpit layout for better views and supercruise maneuverability.", "metadata": {"entity_name": "Beluga Liner", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Beluga Liner performs poorly in combat due to its large size, weak shields, and ineffective hardpoint placement. It is not recommended for extensive combat despite having a Fighter Hangar. It is highly specialized as a passenger liner but faces issues with heat management and docking due to its size.", "metadata": {"entity_name": "Beluga Liner", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Beluga Liner has dimensions of 209.1m x 131.6m x 38.6m, a hull mass of 950 tonnes, and a heat capacity of 283. It has a top speed of 197 m/s (default) or 230 m/s (upgraded), a boost speed of 276 m/s (default) or 322 m/s (upgraded), and an unladen jump range of 10.60 ly (default) or 30.09 ly (upgraded).", "metadata": {"entity_name": "Beluga Liner", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Beluga Liner has 6x Utility Mounts and 5x Medium Hardpoints. It features internal compartments including 1x Class 1, 4x Class 3, 1x Class 4, 2x Class 5, and 4x Class 6 compartments. The default outfitting includes a Shield Generator (Class 6), Cargo Racks, Passenger Cabins, and other essential modules.", "metadata": {"entity_name": "Beluga Liner", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Beluga Liner's default medium hardpoints include two Pulse Lasers (Class 1, Rating F) and three empty slots, all with a maximum class of 2. The utility mounts are all empty by default with a maximum class of 0.", "metadata": {"entity_name": "Beluga Liner", "document_type": "ship", "chunk_type": "hardpoints"}}
{"text": "The Beluga Liner's default systems include Lightweight Alloys (Bulkhead, Class 1), a Power Plant (Class 6), a Frame Shift Drive (Class 7), Life Support (Class 8), a Power Distributor (Class 6), Sensors (Class 5), and a Fuel Tank (Class 7).", "metadata": {"entity_name": "Beluga Liner", "document_type": "ship", "chunk_type": "outfitting"}}