{"text": "The Viper Mk III is a combat-focused vessel manufactured by Faulcon DeLacy, produced from 3300 to the present. It is a small, delta-shaped ship with a landing pad size of small, measuring 29.8m x 24.0m x 8.6m. The Viper Mk III is designed for single pilot operation and does not support multicrew or fighter hangars. It has a hull mass of 50 tons and a mass lock factor of 7. The ship's armor rating is 126 with an armor hardness of 35, and it has shields of 137 MJ. The Viper Mk III has a heat capacity of 195, a fuel capacity of 4 tons, and a cargo capacity of 4 tons (default) up to 26 tons (max). It has a top speed of 315 m/s (default) and 361 m/s (upgraded), a boost speed of 394 m/s (default) and 451 m/s (upgraded), and an unladen jump range of 7.67 ly (default) and 21.28 ly (upgraded). The Viper Mk III is known for its speed, combat capability, and versatility, making it suitable for law enforcement, bounty hunting, courier services, mercenary work, and smuggling. However, its small cargo capacity makes it a poor choice for traders, and its limited fuel capacity and heat dissipation can be drawbacks in certain situations. The Viper Mk III's weapon hardpoints are located as follows: two Class 1 hardpoints in front of the cockpit on the upper surface, and two Class 2 hardpoints on the underside of the ship with one on each side of the cargo scoop. The cockpit is situated just behind the bow, slightly raised, providing the pilot with an excellent view without exposing the canopy to potential damage. The Viper Mk III lands on two small rear struts and one large front strut, which doubles as a boarding ramp to the cockpit.", "metadata": {"entity_name": "Viper Mk III", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Viper Mk III has 2x Utility Mounts, 2x Small Hardpoints, and 2x Medium Hardpoints. It also has 3x Class 1 Compartments, 1x Class 2 Compartment, 2x Class 3 Compartments, and 1x Class 3 Military Compartment reserved. The ship's default outfitting includes two empty small hardpoints, two Pulse Lasers (L) with a default rating of F and a default class of 1, a Lightweight Alloys bulkhead with a default rating of I and a default class of 1, a Power Plant reactor bay with a default rating of E and a default class of 3, Thrusters with a default rating of E and a default class of 3, a Frame Shift Drive with a default rating of E and a default class of 3, Life Support with a default rating of E and a default class of 2, a Power Distributor with a default rating of E and a default class of 3, Sensors with a default rating of E and a default class of 3, a Fuel Tank with a default rating of C and a default class of 2, a Cargo Rack [x4] with a default rating of E and a default class of 2, a Shield Generator with a default rating of E and a default class of 3, an empty Class 3 compartment, two empty Class 1 compartments, an Advanced Docking Computer with a default rating of E and a default class of 1, a Supercruise Assist with a default rating of E and a default class of 1, and a PAS with a default rating of I and a default class of 1.", "metadata": {"entity_name": "Viper Mk III", "document_type": "ship", "chunk_type": "outfitting"}}