{"text": "The Alliance Challenger is a combat ship manufactured by Lakon Spaceways, produced from 3304 to the present. It is designed for owners of the Alliance Chieftain seeking enhanced firepower and durability. The Challenger replaces one Class 3 hardpoint with two Class 2 hardpoints, boosting its combat effectiveness. It maintains the Chieftain's maneuverability while offering increased shield and armor health, making it a formidable and resilient ship in battles. Its additional Class 6 internal compartment allows for a larger Shield Cell Bank, significantly enhancing its defensive capabilities. Although it has a slight speed reduction, this difference is minimal when upgraded. The Challenger excels in taking down medium and even large ships, such as the Anaconda, and is also effective against Thargoid ships. It has a cargo capacity of 154 tons, making it suitable for trading and mining. The main drawbacks are its higher cost compared to the Chieftain and its limited jump range of just under 24 LYs before engineering, which can be further reduced when outfitted with armor. The Challenger's hardpoints are arranged similarly to the Chieftain, with utility slots well-distributed and minimal obstructions. It features a second seat for multicrew. Despite its higher purchase price, the Challenger remains more affordable than many other medium vessels, such as the Federal Gunship, Krait Mk II, Python, and Fer-de-Lance, while still being capable of engaging them in combat. The Alliance Challenger is most commonly available in Alliance systems and does not require any specific rank or reputation to purchase.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Alliance Challenger has the following specifications: it has a hull mass of 450 tons, a mass lock factor of 13, armor rating of 540 with a hardness of 65, shields of 208 MJ, and a heat capacity of 316. It has a fuel capacity of 16 tons, a maneuverability rating of 4, a top speed of 204 m/s (default) which can be upgraded to 251 m/s, a boost speed of 316 m/s (default) which can be upgraded to 360 m/s, an unladen jump range of 8.58 LY (default) which can be upgraded to 23.87 LY, and a cargo capacity ranging from 40 tons (default) to 152 tons (max).", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Alliance Challenger's outfitting includes 4 utility mounts, 3 small hardpoints, 3 medium hardpoints, and 1 large hardpoint. It also features 1 Class 1 compartment, 2 Class 2 compartments, 2 Class 3 compartments, 2 Class 6 compartments, and 3 reserved Class 4 military compartments.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Alliance Challenger's default outfitting includes three small hardpoints, all initially empty with a maximum class of 1.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "hardpoints", "hardpoint_type": "small"}}
{"text": "The Alliance Challenger's default outfitting includes three medium hardpoints, two of which are equipped with Pulse Lasers (L) rated F with a default class of 1 and a maximum class of 2. The third medium hardpoint is empty with a maximum class of 2.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "hardpoints", "hardpoint_type": "medium"}}
{"text": "The Alliance Challenger's default outfitting includes one large hardpoint, which is initially empty with a maximum class of 3.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "hardpoints", "hardpoint_type": "large"}}
{"text": "The Alliance Challenger's default outfitting includes four utility mounts, all of which are initially empty with a maximum class of 0.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "hardpoints", "hardpoint_type": "utility"}}
{"text": "The Alliance Challenger's default outfitting includes a Lightweight Alloys bulkhead rated C with a default class of 1 and a maximum class of 8.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "outfitting", "component_type": "bulkhead"}}
{"text": "The Alliance Challenger's default outfitting includes a Power Plant rated E with a default class of 6 and a maximum class of 6.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "outfitting", "component_type": "reactor_bay"}}
{"text": "The Alliance Challenger's default outfitting includes Thrusters rated E with a default class of 6 and a maximum class of 6.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "outfitting", "component_type": "thrusters_mounting"}}
{"text": "The Alliance Challenger's default outfitting includes a Frame Shift Drive rated E with a default class of 5 and a maximum class of 5.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "outfitting", "component_type": "frame_shift_drive_housing"}}
{"text": "The Alliance Challenger's default outfitting includes Life Support rated E with a default class of 5 and a maximum class of 5.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "outfitting", "component_type": "environment_control"}}
{"text": "The Alliance Challenger's default outfitting includes a Power Distributor rated E with a default class of 6 and a maximum class of 6.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "outfitting", "component_type": "power_coupling"}}
{"text": "The Alliance Challenger's default outfitting includes Sensors rated E with a default class of 4 and a maximum class of 4.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "outfitting", "component_type": "sensor_suite"}}
{"text": "The Alliance Challenger's default outfitting includes a Fuel Tank rated C with a default class of 4 and a maximum class of 4.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "outfitting", "component_type": "fuel_store"}}
{"text": "The Alliance Challenger's default outfitting includes a Cargo Rack [x32] rated E with a default class of 5 and a maximum class of 6.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "outfitting", "component_type": "internal_compartments"}}
{"text": "The Alliance Challenger's default outfitting includes a Shield Generator rated E with a default class of 6 and a maximum class of 6.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "outfitting", "component_type": "internal_compartments"}}
{"text": "The Alliance Challenger's default outfitting includes three empty medium internal compartments with a maximum class of 4.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "outfitting", "component_type": "internal_compartments"}}
{"text": "The Alliance Challenger's default outfitting includes two Cargo Racks [x4] rated E with a default class of 2 and a maximum class of 3.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "outfitting", "component_type": "internal_compartments"}}
{"text": "The Alliance Challenger's default outfitting includes two empty internal compartments with a maximum class of 2.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "outfitting", "component_type": "internal_compartments"}}
{"text": "The Alliance Challenger's default outfitting includes a Supercruise Assist rated E with a default class of 1 and a maximum class of 1.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "outfitting", "component_type": "internal_compartments"}}
{"text": "The Alliance Challenger's default outfitting includes a (PAS) rated I with a default class of 1 and a maximum class of 1.", "metadata": {"entity_name": "Alliance Challenger", "document_type": "ship", "chunk_type": "outfitting", "component_type": "internal_compartments"}}