{"text": "The Krait Mk II is a leaner, meaner alternative to the Python, featuring almost identical module and hardpoint specifications. It is manufactured by Faulcon DeLacy and has been in production since 3304. The Krait's advantages over the Python include lower cost, lower hull mass, higher speed, improved handling, higher jump range potential, and the ability to carry a Fighter Hangar. However, it has one less Class 6 internal compartment, weaker armour, and shields compared to the Python. The Krait Mk II sacrifices some utility as a freighter for speed and jump range potential but remains a viable multirole option with strong combat ability. A variant, the Krait Phantom, focuses more on multirole qualities and speed, sacrificing firepower, armour, a Fighter Hangar, one Class 3 hardpoint, and one pilot's seat for reduced hull mass, improving speed, handling, and jump range. The Krait Mk II is better for combat, trading, and mining, while the Krait Phantom is ideal for explorers or pilots who do not need a Fighter Hangar.", "metadata": {"entity_name": "Krait Mk II", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Krait Mk II has a cost of 45,814,205 CR and an insurance cost of 2,290,710 CR. It is classified as a Combat, Multirole ship. The ship's dimensions are 73.3m x 72m x 13.5m, with 3 pilot seats and multicrew capability. It has a hull mass of 320 t, a mass lock factor of 17, armour rating of 396, armour hardness of 55, shields of 262 MJ, and a heat capacity of 300. The fuel capacity is 32 t. The ship's manoeuvrability rating is 3, with a top speed of 245 m/s (default) or 274 m/s (upgraded), a boost speed of 337 m/s (default) or 383 m/s (upgraded), and an unladen jump range of 8.99 ly (default) or 30.79-60~ ly (upgraded). The cargo capacity is 82 t (default) or 230 t (max).", "metadata": {"entity_name": "Krait Mk II", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Krait Mk II features 4 Utility Mounts, 2 Medium Hardpoints, and 3 Large Hardpoints. It has internal compartments including 1 Class 1, 1 Class 2, 2 Class 3, 1 Class 4, 2 Class 5, and 2 Class 6 compartments. The default outfitting includes Pulse Lasers (Class 1, Grade F) on the medium hardpoints, and empty large hardpoints. The utility mounts are also empty by default. The ship's bulkhead is equipped with Lightweight Alloys (Class 1, Grade C).", "metadata": {"entity_name": "Krait Mk II", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Krait Mk II's three Class 3 hardpoints are mounted in a delta pattern on the dorsal surface behind the cockpit. The two medium hardpoints are located on the underside of the front-most points of the hull, on either side of the cockpit and slightly forward. Combined with a Fighter Hangar, the Krait Mk II can bring a considerable amount of firepower to bear for its size, and its hardpoint placement ensures that the pilot can keep weapons on a target without any difficulty.", "metadata": {"entity_name": "Krait Mk II", "document_type": "ship", "chunk_type": "hardpoints"}}
{"text": "The primary pilot's seat is located along the centerline of the ship, with the cockpit extending from the hull and slightly under-slung, providing a wide, unobstructed frontal view. The pilot has a clear view of the two medium hardpoints when deployed. The two secondary pilot seats flank the primary seat to the left and right, each with separate canopies.", "metadata": {"entity_name": "Krait Mk II", "document_type": "ship", "chunk_type": "cockpit"}}
{"text": "The Krait Mk II's default internal compartments include a Shield Generator (Class 6, Grade E), Cargo Racks (Class 5 and 4, Grade E), an Empty compartment (Class 4), two Empty compartments (Class 3), a Cargo Rack (Class 1, Grade E), Supercruise Assist (Class 1, Grade E), and a PAS (Class 1, Grade I).", "metadata": {"entity_name": "Krait Mk II", "document_type": "ship", "chunk_type": "internal_compartments"}}