{"text": "The Type-8 Transporter is a medium-sized freighter manufactured by Lakon Spaceways, designed for cargo hauling with a maximum capacity of 406 tons. It features retractable engines for medium landing pads and has a default jump range of 17.55 ly when laden and 23.42 ly when unladen. The ship is optimized for Frame Shift Drive (SCO) with improved hull stress capacity and interlaced polymer drive insulation. It fills the gap between the Type-7 Transporter and the Type-9 Heavy, offering a balance of cargo capacity, range, and fuel efficiency. The Type-8 has an industrial design with 2 prongs in the front, a cockpit with 1 pilot seat, 6 hardpoints (5 small, 1 medium), and 9 optional internals. It can be outfitted for mining and exploration with engineering upgrades. The ship was announced for a free update in 2024, with early access released on August 7, 2024, and the free version for in-game credits released on November 28, 2024.", "metadata": {"entity_name": "Type-8 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-8 Transporter has dimensions of 99.34 m x 59.96 m x 25.63 m, a hull mass of 400 t, and a mass lock factor of 18. It features armour with a rating of 792 and hardness of 58, shields of 122 MJ, heat capacity of 236, and fuel capacity of 32 t. The ship's manoeuvrability is rated at 1, with a top speed of 201 m/s (default) or 228 m/s (upgraded), and a boost speed of 342 m/s (default) or 387 m/s (upgraded). The unladen jump range is 23.42 ly (default) or 29.37 ly (upgraded), with a cargo capacity of 176 t (default) or 406 t (max).", "metadata": {"entity_name": "Type-8 Transporter", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Type-8 Transporter has 4x Utility Mounts, 5x Small Hardpoints, and 1x Medium Hardpoint. It features internal compartments including 1x Class 1, 1x Class 2, 1x Class 4, 2x Class 5, 3x Class 6, and 1x Class 7. The default outfitting includes Pulse Lasers on some small hardpoints and various empty slots for customization. The ship's core internals include a Power Plant, Thrusters, Frame Shift Drive (SCO), Fuel Tank, Life Support, Sensors, and a Power Distributor. The default internal compartments include Cargo Racks and a Shield Generator, with several empty slots for additional equipment.", "metadata": {"entity_name": "Type-8 Transporter", "document_type": "ship", "chunk_type": "outfitting"}}