{"text": "The Cobra Mk III is a popular multirole ship manufactured by Faulcon DeLacy, produced from 3100 to the present. It is a small, low-cost vessel capable of performing well in various roles, serving as a cheaper alternative to the Python. The Cobra Mk III is potent in combat with impressive damage output and defenses for its price tier, making it suitable for bounty hunting and pirating. However, it can be outmaneuvered by Eagle Mk IIs and Viper Mk IIIs. Its large cargo bay makes it viable for pirates. The ship's carrying capacity is more than double that of the Hauler and Adder, and its cost is almost one-third that of the Type-6 Transporter, making it a logical stepping stone for aspiring traders. It is also a good and affordable exploration ship due to its sizeable 16t Fuel Tank and internal compartments, allowing for necessary exploration modules. As a miner, the Mk III is very effective due to its additional hardpoints, compartments, and cargo space. The weapon hardpoints are located as follows: two Class 2 hardpoints in front of the cockpit on the upper surface ship, and two Class 1 hardpoints on the underside of the ship. The pilot's seat is to the left of the center of the ship, with the co-pilot's to the right.", "metadata": {"entity_name": "Cobra Mk III", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Cobra Mk III has the following specifications: dimensions of 27.1m x 44.0m x 7.9m, a hull mass of 180 t, armour of 216 with an armour hardness of 35, shields of 92 MJ, heat capacity of 225, fuel capacity of 16 t, manoeuvrability of 5, top speed of 282 m/s (default) or 325 m/s (upgraded), boost speed of 403 m/s (default) or 464 m/s (upgraded), unladen jump range of 11.16 ly (default) or 28.55 ly (upgraded), and cargo capacity of 18 t (default) or 64 t (max). It has 2 pilot seats, supports multicrew, and has a small landing pad size.", "metadata": {"entity_name": "Cobra Mk III", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Cobra Mk III has the following outfitting: 2x Utility Mounts, 2x Small Hardpoints, and 2x Medium Hardpoints. It also has 2x Class 1 Compartments, 3x Class 2 Compartments, and 3x Class 4 Compartments.", "metadata": {"entity_name": "Cobra Mk III", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Cobra Mk III's default outfitting includes two empty Small Hardpoints, two Pulse Lasers (Class 1, Rating F) on Medium Hardpoints, two empty Utility Mounts, Lightweight Alloys (Class 1, Rating I) on Bulkhead, a Power Plant (Class 4, Rating E) in the Reactor Bay, Thrusters (Class 4, Rating E) in Thrusters Mounting, a Frame Shift Drive (Class 4, Rating E) in Frame Shift Drive Housing, Life Support (Class 3, Rating E) in Environment Control, a Power Distributor (Class 3, Rating E) in Power Coupling, Sensors (Class 3, Rating E) in Sensor Suite, a Fuel Tank (Class 4, Rating C) in Fuel Store, and various internal compartments including Cargo Racks, Shield Generator, Advanced Docking Computer, Supercruise Assist, and PAS.", "metadata": {"entity_name": "Cobra Mk III", "document_type": "ship", "chunk_type": "default_outfitting"}}