{"text": "The Federal Dropship is a combat and multirole ship manufactured by Core Dynamics, produced from 3300 to the present. It is available for purchase at stations controlled by minor factions aligned with the Federation, with a cost of 14,314,210 CR and insurance of 715,710 CR. It shares its design with the Federal Assault Ship and Federal Gunship, being the cheapest and having the lowest Federal Navy rank requirement among the three. The Dropship is known for its combat capabilities, featuring one Class 3 hardpoint and four Class 2 hardpoints, above-average armor, and two Military Compartments. However, it has weak shielding and poor mobility, making it less effective against nimble ships. It is also a respectable ship for bounty hunters and pirates but is often used as a stepping stone to stronger vessels. As a trader, it has 164T of cargo space, making it one of the best non-large ships for trading, but its low jump range can limit trade options. As an explorer, it is one of the worst choices due to its poor jump range. However, it excels as a miner, with four medium hardpoints for mining tools and a large hardpoint for self-defense, along with great cargo space and good defenses. Its weapon hardpoints are located on the sides and underside of the ship, with good to excellent fields of fire when fitted with turrets.", "metadata": {"entity_name": "Federal Dropship", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Federal Dropship has dimensions of 73.9m x 52.3m x 21.7m, with a hull mass of 580 t and a mass lock factor of 14. It features 2 pilot seats and supports multicrew but does not have a fighter hangar. Its armor rating is 540 with an armor hardness of 60, and it has shields of 104 MJ. The ship has a heat capacity of 331, a fuel capacity of 16 t, and a manoeuvrability rating of 3. Its top speed is 182 m/s (default) or 209 m/s (upgraded), with a boost speed of 304 m/s (default) or 348 m/s (upgraded). The unladen jump range is 7.25 ly (default) or 19.66 ly (upgraded), and the cargo capacity is 56 t (default) or 166 t (max).", "metadata": {"entity_name": "Federal Dropship", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Federal Dropship has 4x Utility Mounts, 4x Medium Hardpoints, and 1x Large Hardpoint. Its internal compartments include 1x Class 1, 1x Class 2, 2x Class 3, 1x Class 4, 2x Class 5, and 1x Class 6 compartments, with 2x Class 4 Military Compartments reserved.", "metadata": {"entity_name": "Federal Dropship", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Federal Dropship's medium hardpoints include two Pulse Lasers (Class 1, Rating F) and two empty slots (max Class 2). Its utility mounts are all empty (max Class 0). The default systems include Lightweight Alloys (Bulkhead, Class 1, Rating I), Power Plant (Reactor Bay, Class 6, Rating E), Thrusters (Thrusters Mounting, Class 6, Rating E), Frame Shift Drive (Class 5, Rating E), Life Support (Environment Control, Class 5, Rating E), Power Distributor (Class 6, Rating E), Sensors (Class 4, Rating E), and Fuel Tank (Class 4, Rating C). Internal compartments include Cargo Racks, Shield Generator, Supercruise Assist, and PAS.", "metadata": {"entity_name": "Federal Dropship", "document_type": "ship", "chunk_type": "outfitting"}}