{"text": "The Imperial Cutter is a multirole ship manufactured by Gutamaya, produced from 3301 to the present. It is a large, expensive, and ponderous ship with a heavy armament, making it effective for multi-purpose roles. It has a max cargo capacity of 794 tons, the largest of all playable ships, but is also the most expensive. The Cutter is well-shielded, fast for its size, and better armed than the Type-9 Heavy, making it suitable for trading, combat, and mining. It features four medium hardpoints, two large hardpoints, one huge hardpoint, and eight utility mounts. It can carry a Fighter Hangar for Ship-Launched Fighters. However, it has a lower jump range than the Anaconda and slightly less combat potential than the Corvette and Anaconda due to its Class 7 power distributor. It has a mass lock factor of 26, the highest of all conventional ships, and is highly customizable through the Outfitting menu.", "metadata": {"entity_name": "Imperial Cutter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Imperial Cutter has the following specifications: dimensions of 192.6m x 111.1m x 33.4m, a hull mass of 1,100 tons, armour of 720 with a hardness of 70, shields of 704 MJ, heat capacity of 327, fuel capacity of 64 tons, and a cargo capacity of 164 tons (default) to 794 tons (max). It has a top speed of 202 m/s (default) and 232 m/s (upgraded), a boost speed of 323 m/s (default) and 372 m/s (upgraded), and an unladen jump range of 8.21 ly (default) and 25.70 ly (upgraded). It has a manoeuvrability rating of 0 and can accommodate 3-4 pilots with multicrew and a fighter hangar.", "metadata": {"entity_name": "Imperial Cutter", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Imperial Cutter's outfitting includes 8 utility mounts, 4 medium hardpoints, 2 large hardpoints, and 1 huge hardpoint. It has internal compartments of 1 Class 1, 1 Class 3, 1 Class 4, 2 Class 5, 3 Class 6, and 2 Class 8. It also has 2 reserved Class 5 Military Compartments. The default loadout includes Pulse Lasers on two medium hardpoints and empty slots on the rest. The bulkhead is made of Lightweight Alloys (Class 1, Grade I), and it has a Power Plant (Class 8, Grade E), Thrusters (Class 8, Grade E), Frame Shift Drive (Class 7, Grade E), Life Support (Class 7, Grade E), Power Distributor (Class 7, Grade E), Sensors (Class 7, Grade E), and a Fuel Tank (Class 6, Grade C). Internal compartments include a Shield Generator (Class 8, Grade E), Cargo Racks (various classes and grades), Supercruise Assist (Class 1, Grade E), and a PAS (Class 1, Grade I).", "metadata": {"entity_name": "Imperial Cutter", "document_type": "ship", "chunk_type": "outfitting"}}