{"text": "The Asp Explorer is a multirole ship manufactured by Lakon Spaceways, produced from 3300 to the present. It costs 6,661,153 CR with an insurance value of 333,058 CR. The ship is known for its flexibility and versatility, suitable for various activities such as exploration, trading, and combat. It has a decent cargo capacity of up to 130 tonnes and a low hull mass, allowing for higher speeds than most dedicated trading vessels. The Asp Explorer features six weapon hardpoints, enabling it to be outfitted as a well-armed freighter or a pure fighter. However, its combat ability is somewhat limited by thinner armor and a prominent, damage-prone cockpit canopy. The ship's best-known role is exploration, thanks to its considerable jump range, internal compartments for essential exploration modules, and unobstructed views of the cosmos from its canopy.", "metadata": {"entity_name": "Asp Explorer", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Asp Explorer has the following specifications: dimensions of 56.5m x 51.3m x 19.7m, a hull mass of 280 tonnes, and a mass lock factor of 11. It features 2 pilot seats, supports multicrew, and has no fighter hangar. The ship's armor rating is 378 with an armor hardness of 52, and its shields have a capacity of 152 MJ. The heat capacity is 272, and the fuel capacity is 32 tonnes. In terms of performance, the Asp Explorer has a manoeuvrability rating of 4, a top speed of 254 m/s (default) or 290 m/s (upgraded), a boost speed of 345 m/s (default) or 395 m/s (upgraded), and an unladen jump range of 13.12 ly (default) or 38.19 ly (upgraded). The cargo capacity ranges from 38 tonnes (default) to 130 tonnes (max).", "metadata": {"entity_name": "Asp Explorer", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Asp Explorer's weapon hardpoints include four small hardpoints and two medium hardpoints. The small hardpoints are located on the ventral surface on both sides of the cockpit and directly beneath the cockpit. The medium hardpoints are located on the dorsal surface. The ship's default outfitting includes Pulse Lasers (Class 1, Grade F) in two of the small hardpoints, with the other two small hardpoints and both medium hardpoints being empty. The Asp Explorer also has four utility mounts, all of which are empty by default.", "metadata": {"entity_name": "Asp Explorer", "document_type": "ship", "chunk_type": "hardpoints"}}
{"text": "The Asp Explorer's internal compartments include one Class 1 compartment, two Class 2 compartments, three Class 3 compartments, one Class 5 compartment, and one Class 6 compartment. The default outfitting for these compartments includes a Cargo Rack [x32] (Class 5, Grade E), a Shield Generator (Class 5, Grade E), a Cargo Rack [x4] (Class 2, Grade E), three empty compartments (max Class 3), a Cargo Rack [x2] (Class 1, Grade E), one empty compartment (max Class 2), a Supercruise Assist (Class 1, Grade E), and a (PAS) (Class 1, Grade I).", "metadata": {"entity_name": "Asp Explorer", "document_type": "ship", "chunk_type": "internal_compartments"}}
{"text": "The Asp Explorer's default outfitting includes a Lightweight Alloys bulkhead (Class 1, Grade I), a Power Plant (Class 5, Grade E), Thrusters (Class 5, Grade E), a Frame Shift Drive (Class 5, Grade E), Life Support (Class 4, Grade E), a Power Distributor (Class 4, Grade E), Sensors (Class 5, Grade E), and a Fuel Tank (Class 5, Grade C).", "metadata": {"entity_name": "Asp Explorer", "document_type": "ship", "chunk_type": "outfitting"}}