{"text": "The Viper Mk III is a combat-focused vessel manufactured by Faulcon DeLacy, produced from 3300 to the present. It is commonly used by station security forces and other law enforcement organizations. The Viper Mk III has a cost of 142,931 CR and an insurance cost of 7,147 CR. It is known for its speed and combat capability, making it ideal for bounty hunters, small-load couriers, mercenaries, or smugglers. However, its small cargo capacity makes it a poor choice for traders and an inadequately profitable platform for pirates. With proper fitting, the Viper Mk III is an excellent fighter capable of standing its ground against more expensive ships.", "metadata": {"entity_name": "Viper Mk III", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Viper Mk III has a delta-shaped hull which tapers to form two prongs at the front. The cockpit is situated just behind the bow, slightly raised, providing the pilot with an excellent view without exposing the canopy to potential damage. The Viper Mk III lands on two small rear struts and one large front strut, which doubles as a boarding ramp to the cockpit. The ship's dimensions are 29.8m x 24.0m x 8.6m, with a hull mass of 50 t and an armour rating of 126. It has a heat capacity of 195 and a fuel capacity of 4 t. The Viper Mk III has a top speed of 315 m/s (default) and 361 m/s (upgraded), a boost speed of 394 m/s (default) and 451 m/s (upgraded), and an unladen jump range of 7.67 ly (default) and 21.28 ly (upgraded). Its cargo capacity is 4 t (default) and can be increased to 26 t (max).", "metadata": {"entity_name": "Viper Mk III", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Viper Mk III has 2x Utility Mounts, 2x Small Hardpoints, and 2x Medium Hardpoints. It also has 3x Class 1 Compartments, 1x Class 2 Compartment, 2x Class 3 Compartments, and 1x Class 3 Military Compartment. The default loadout includes Pulse Lasers (L) on the medium hardpoints and empty utility mounts. The ship's default systems include Lightweight Alloys (Bulkhead, Class 1), Power Plant (Reactor Bay, Class 3), Thrusters (Thrusters Mounting, Class 3), Frame Shift Drive (Frame Shift Drive Housing, Class 3), Life Support (Environment Control, Class 2), Power Distributor (Power Coupling, Class 3), Sensors (Sensor Suite, Class 3), and Fuel Tank (Fuel Store, Class 2). Internal compartments include Cargo Rack [x4] (Class 2), Shield Generator (Class 3), Empty (M) (Class 3), Empty (Class 2), Empty (Class 1), Advanced Docking Computer (Class 1), Supercruise Assist (Class 1), and (PAS) (Class 1).", "metadata": {"entity_name": "Viper Mk III", "document_type": "ship", "chunk_type": "outfitting"}}