{"text": "The Imperial Clipper is a multirole ship manufactured by Gutamaya, produced from 3300 to the present. It costs 22,295,860 CR with an insurance value of 1,114,793 CR. The ship is known for its high potential speed, with upgraded thrusters making it comparable to smaller ships like the Cobra Mk III and Imperial Eagle. It has superior pitch rotation and yaw speed but suffers from poor lateral thruster strength and weak shields for its size. The ship's wide body can make manual docking challenging for less experienced pilots. Compared to the Alliance Chieftain, the Clipper has better shield strength and cargo capacity but less firepower and weaker armor. Its speed and maneuverability decrease significantly when laden, affecting its trading efficiency. The ship can carry 248T of cargo, making it a good miner and explorer with around 28Ly of jump range potential. However, its weapon hardpoints are ill-suited for fixed weapons, and its large body can be problematic in clustered asteroid fields and planetary rings.", "metadata": {"entity_name": "Imperial Clipper", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Imperial Clipper has dimensions of 106.7m x 103.7m x 24.8m and a hull mass of 400 tons. It features 2 pilot seats, supports multicrew, and has a landing pad size of Large. The ship's armor rating is 486 with an armor hardness of 60, and its shields are rated at 186 MJ. It has a heat capacity of 304, a fuel capacity of 16 tons, and a maneuverability rating of 5. The top speed is 306 m/s (default) and 341 m/s (upgraded), with a boost speed of 388 m/s (default) and 445 m/s (upgraded). The unladen jump range is 8.98 ly (default) and 27.52 ly (upgraded), with a cargo capacity of 74 t (default) and 250 t (max).", "metadata": {"entity_name": "Imperial Clipper", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Imperial Clipper has 4 utility mounts, 2 medium hardpoints, and 2 large hardpoints. Its internal compartments include 1 Class 1, 2 Class 2, 2 Class 3, 2 Class 4, 1 Class 6, and 1 Class 7 compartments. The default outfitting includes Lightweight Alloys for bulkhead, a Power Plant for the reactor bay, Thrusters for thrusters mounting, a Frame Shift Drive, Life Support for environment control, a Power Distributor, Sensors, and a Fuel Tank. Internal compartments include Cargo Racks, a Shield Generator, and Supercruise Assist.", "metadata": {"entity_name": "Imperial Clipper", "document_type": "ship", "chunk_type": "outfitting"}}