{"text": "The Diamondback Scout is a cheap vessel built primarily for combat that can also be repurposed as a moderately satisfactory exploration ship for pilots who cannot afford better options. It has exceptional mobility and a small body letting it dodge with ease, resulting in a ship that can be incredibly nimble and tough to hit. This helps counteract its rather poor shields and armour. Good heat signature and a lot of utility mounts make it capable of running stealth builds and is very effective in the role. It has good firepower potential for its price range with two Class 1 and two Class 2 hardpoints. As an explorer, the Scout also performs well. At 30 LY without Engineering, the Scout has a high jump range for its price, but is still outperformed by the cheaper Adder and Hauler, although those two ships have their own shortcomings in the role. One drawback is the Scout's very restricting internal space, which can hamper Outfitting options, and its small fuel tank, but such limitations are to be expected with a ship in the Scout's low price range. The Scout is a poor choice for trading, mining, and passenger transport.", "metadata": {"entity_name": "Diamondback Scout", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Diamondback Scout is manufactured by Lakon Spaceways and has been in production since 3300. It is classified as a Combat Explorer and costs 564,320 CR with an insurance value of 28,216 CR.", "metadata": {"entity_name": "Diamondback Scout", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Diamondback Scout has dimensions of 39.0m x 24.3m x 12.3m, a hull mass of 170 t, and a mass lock factor of 8. It has an armour rating of 216 with an armour hardness of 40, shields of 92 MJ, and a heat capacity of 346. The ship has a fuel capacity of 16 t, a manoeuvrability rating of 5, a top speed of 286 m/s (default) or 329 m/s (upgraded), a boost speed of 384 m/s (default) or 441 m/s (upgraded), and an unladen jump range of 11.35 ly (default) or 30.4 ly (upgraded). The cargo capacity is 0 t (default) or 32 t (max).", "metadata": {"entity_name": "Diamondback Scout", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Diamondback Scout has 4 utility mounts, 2 small hardpoints, and 2 medium hardpoints. It has 2 Class 1 compartments, 1 Class 2 compartment, and 3 Class 3 compartments. The weapon hardpoints are located as follows: one Class 1 hardpoint on either side of the cockpit, and one Class 2 hardpoint on either side of the cockpit, for a total of four hardpoints. These hardpoints have their aim points arranged in a straight horizontal line with little space between reticle dots making them easy to use with fixed, gimballed, and turreted weapons.", "metadata": {"entity_name": "Diamondback Scout", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Diamondback Scout's default load-out includes two Pulse Lasers (Class 1, Rating F) on medium hardpoints, and empty small hardpoints. It has four empty utility mounts. The bulkhead is equipped with Lightweight Alloys (Class 1, Rating I). The reactor bay has a Power Plant (Class 4, Rating E), and the thrusters mounting has Thrusters (Class 4, Rating E). The frame shift drive housing has a Frame Shift Drive (Class 4, Rating E). The environment control has Life Support (Class 2, Rating E), and the power coupling has a Power Distributor (Class 3, Rating E). The sensor suite has Sensors (Class 2, Rating E), and the fuel store has a Fuel Tank (Class 4, Rating C). The internal compartments include a Shield Generator (Class 3, Rating E), an Advanced Docking Computer (Class 1, Rating E), Supercruise Assist (Class 1, Rating E), and a PAS (Class 1, Rating I).", "metadata": {"entity_name": "Diamondback Scout", "document_type": "ship", "chunk_type": "outfitting"}}