{"text": "The Adder is a versatile multirole ship manufactured by Zorgon Peterson, produced from 2914 to the present. It is known for its high cargo capacity and good combat efficiency, making it suitable for various roles such as trading, combat, mining, and exploration. The Adder is often considered an upgraded version of the Hauler and shares a similar appearance.", "metadata": {"entity_name": "Adder", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Adder has a cost of 87,808 CR and an insurance value of 4,390 CR. It features a landing pad size of Small, dimensions of 31.5m x 28.8m x 9.6m, and a hull mass of 35 t. The ship has 2 pilot seats, supports multicrew, and has a mass lock factor of 7. Its armor rating is 162 with an armor hardness of 35, shields of 78 MJ, and a heat capacity of 170. The fuel capacity is 8 t, and it has a top speed of 220 m/s (default) or 255 m/s (upgraded), a boost speed of 321 m/s (default) or 372 m/s (upgraded), and an unladen jump range of 9.12 ly (default) or 32.96 ly (upgraded). The cargo capacity is 6 t (default) or 30 t (max).", "metadata": {"entity_name": "Adder", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Adder is equipped with 2x Utility Mounts, 2x Small Hardpoints, and 1x Medium Hardpoint. It has 3x Class 1 Compartments, 2x Class 2 Compartments, and 2x Class 3 Compartments. The default outfitting includes Pulse Laser (L) Class 1 on the small hardpoints and empty utility mounts. The bulkhead is equipped with Lightweight Alloys Class 1, and the reactor bay has a Power Plant Class 3. The thrusters are Class 3, and the frame shift drive is Class 3. The environment control is Life Support Class 1, and the power coupling is a Power Distributor Class 2. The sensor suite is Class 3, and the fuel store is a Fuel Tank Class 3. Internal compartments include Cargo Rack [x4] Class 2, Shield Generator Class 3, Cargo Rack [x2] Class 1, and various other systems.", "metadata": {"entity_name": "Adder", "document_type": "ship", "chunk_type": "outfitting"}}