{"text": "The Imperial Courier is a multirole ship manufactured by Gutamaya, produced from 3145 to the present. It is known for its agility, strong shielding, and versatility in combat and exploration. Its low mass makes it evasive but also affects its boost speed and jump range. The ship has a default top speed of 277 m/s, boost speed of 380 m/s, and a jump range of 7.81 ly, which can be significantly upgraded. It features 3 medium hardpoints and 4 utility mounts, with a default loadout that includes pulse lasers and various internal compartments for cargo and systems. The ship's small size and single pilot seat make it incompatible with multicrew setups.", "metadata": {"entity_name": "Imperial Courier", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Imperial Courier has a hull mass of 35 t, armor rating of 144, and shield capacity of 230 MJ. Its heat capacity is 230, and it has a fuel capacity of 8 t. The ship's dimensions are 42.1m x 27.4m x 7.1m, with a cargo capacity of 12 t by default, expandable to 34 t. It has a manoeuvrability rating of 4 and a landing pad size of Small. The ship's top speed can be upgraded to 325 m/s, boost speed to 441 m/s, and jump range to 33.68 ly. Its armor hardness is 30, and it has a mass lock factor of 7.", "metadata": {"entity_name": "Imperial Courier", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Imperial Courier's default outfitting includes 3 medium hardpoints, each equipped with a Pulse Laser (L) rated F, Class 1, with a maximum class of 2. It also has 4 utility mounts, all initially empty. The ship's internal compartments include 3 Class 1, 3 Class 2, and 2 Class 3 compartments. The default systems include a Power Plant (E, Class 4), Thrusters (E, Class 3), Frame Shift Drive (E, Class 3), Life Support (E, Class 1), Power Distributor (E, Class 3), Sensors (E, Class 2), and a Fuel Tank (C, Class 3). The internal compartments house systems like Cargo Racks, Shield Generator, Advanced Docking Computer, Supercruise Assist, and a PAS (I, Class 1).", "metadata": {"entity_name": "Imperial Courier", "document_type": "ship", "chunk_type": "outfitting"}}