{"text": "The Corsair is a multirole ship manufactured by Gutamaya, produced from 3311 to the present. It is designed to excel in all three main roles equally, making it superior to the Python. The Corsair can carry up to 318t of cargo, the highest capacity among medium ships apart from the Type-8 Transporter. It features a size 7 Power Plant, size 7 thrusters, and a size 7 Power Distributor, with up to 10 optional internals and 6 hardpoints. The ship's max speed is capped at 600 m/s through engineering, and it has a distinctive blue neon strip lighting and minimal heat vents. The cockpit is similar to the Imperial Courier but with an extra seat. All hardpoints are located on the fuselage, allowing for tighter weapon convergence. The Corsair was unveiled on 26 February 2025 and launched for ARX on 8 April 2025, becoming available for credits on 4 July 2025. Initially, it had a mass lock factor of 7, which was later fixed to 17 in the Trailblazers Update 3 on 30 April 2025.", "metadata": {"entity_name": "Corsair", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Corsair has the following specifications: dimensions of 86.8m x 69.4m x 16m, 2 pilot seats, and multicrew capability. It has a hull mass of 265 t, armour rating of 486 with hardness of 65, and shields of 264 MJ. The ship's heat capacity is 280, fuel capacity is 32 t, and manoeuvrability is rated at 4. Its top speed is 288 m/s (default) and 325 m/s (upgraded), with a boost speed of 366 m/s (default) and 412 m/s (upgraded). The unladen jump range is 12.96 ly (default) and 39.58 ly (upgraded), and the cargo capacity is 48 t (default) and 318 t (max).", "metadata": {"entity_name": "Corsair", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Corsair's outfitting includes 4x Utility Mounts, 3x Medium Hardpoints, and 3x Large Hardpoints. It has internal compartments consisting of 1x Class 1, 1x Class 2, 1x Class 3, 1x Class 4, 3x Class 5, and 3x Class 6 compartments. The default loadout includes a size 7 Power Plant, size 7 Thrusters, size 7 Power Distributor, size 5 Frame Shift Drive (SCO), size 4 Life Support, size 6 Sensors, size 5 Fuel Tank, and various other systems.", "metadata": {"entity_name": "Corsair", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Corsair's default medium hardpoints include two Pulse Lasers (Class 1, Rating F) and one empty slot (max Class 2). All large hardpoints and utility mounts are initially empty, with max classes of 3 and 0 respectively. The default internal compartments include Cargo Racks, Shield Generator, Supercruise Assist, Advanced Docking Computer, and a Passenger System (PAS).", "metadata": {"entity_name": "Corsair", "document_type": "ship", "chunk_type": "hardpoints"}}