{"text": "The Mamba is a combat ship manufactured by Zorgon Peterson, produced from 3304 to the present. It costs 55,867,041 CR and has an insurance value of 2,793,352 CR. The ship is designed for combat and draws inspiration from the Fer-de-Lance, emphasizing heavy firepower and speed. It features six utility slots and a single huge hardpoint, making it capable of mounting Class 4 weaponry. The Mamba is known for its incredible speed, surpassing most other ships, which allows it to hunt targets, escape ambushes, and use long-range tactics. However, its turning radius is sizeable, impacting close-quarters maneuverability. The ship has a low heat threshold but compensates with a higher heat dissipation rate. The Mamba is suited for bounty hunting and is effective against Thargoid Interceptors due to its high speed and damage output. It has a maximum cargo capacity of 64t, making it less ideal for trading, mining, or piracy. Its maximum jump range is 20.53 ly, which can make travel frustrating when optimized for combat. The ship has two pilot seats, giving it multicrew capability, and all its hardpoints are located on the dorsal surface. The Mamba's default load-out includes various systems and compartments, with all ships being highly customizable through the Outfitting menu of Station Services.", "metadata": {"entity_name": "Mamba", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Mamba has dimensions of 72.2m x 50.1m x 11.4m, with a hull mass of 250 t and a mass lock factor of 12. It features 2 pilot seats and has multicrew capability. The ship does not have a fighter hangar. Its armor rating is 414 with an armor hardness of 70, and it has shields of 244 MJ. The heat capacity is 165, and the fuel capacity is 8 t. The Mamba has a manoeuvrability rating of 3, with a top speed of 316 m/s (default) and 361 m/s (upgraded), and a boost speed of 387 m/s (default) and 445 m/s (upgraded). The unladen jump range is 6.79 ly (default) and 20.53 ly (upgraded), with a cargo capacity of 20 t (default) and 66 t (max).", "metadata": {"entity_name": "Mamba", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Mamba features 6 utility mounts, 2 small hardpoints, 2 large hardpoints, and 1 huge hardpoint. Its internal compartments include 1 Class 1, 2 Class 2, 1 Class 3, 1 Class 4, and 1 Class 5 compartments. The default systems for the small hardpoints are Pulse Laser (L) with a rating of F and a class of 1. The large hardpoints are initially empty, with a maximum class of 3. All six utility mounts are also initially empty, with a maximum class of 0. The ship's bulkhead is equipped with Lightweight Alloys (Class 1, Grade C), and it has various other systems such as a Power Plant (Class 6, Grade E), Thrusters (Class 5, Grade E), Frame Shift Drive (Class 4, Grade E), Life Support (Class 4, Grade E), Power Distributor (Class 6, Grade E), Sensors (Class 4, Grade E), and a Fuel Tank (Class 3, Grade C). The internal compartments include a Cargo Rack [x16] (Class 4, Grade E), Shield Generator (Class 4, Grade E), Cargo Rack [x4] (Class 2, Grade E), Supercruise Assist (Class 1, Grade E), and a PAS (Class 1, Grade I).", "metadata": {"entity_name": "Mamba", "document_type": "ship", "chunk_type": "outfitting"}}