{"text": "The Type-7 Transporter is a bulky trading vessel manufactured by Lakon Spaceways, often chosen by traders upgrading from the Type-6 Transporter. It features triple the capacity of a Type-6 at a higher price but cannot dock at Outposts due to its large size. It is the cheapest and smallest large-sized ship on the market.", "metadata": {"entity_name": "Type-7 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-7 Transporter is an excellent shielded or Open Play trader when outfitted with Military Grade Composites, a Shield Generator, and Shield Boosters. Its pitch, yaw speed, base speed, and adequate defenses allow it to make a hyperspace jump out of combat or potentially evade interdiction.", "metadata": {"entity_name": "Type-7 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "In combat, the Type-7, much like other freighters, is not viable. Its hardpoints are outclassed by even the Imperial Eagle or Viper Mk III, which are far cheaper and significantly more maneuverable. As a multirole or pirate ship, the Type-7 is surpassed by its main competitor, the Python.", "metadata": {"entity_name": "Type-7 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-7 Transporter has three Class 6 Compartments and three Class 5 Compartments, making it the cheapest ship in the game with six or more Compartments of Class 5 or greater. It is useful for passenger missions, though it cannot dock at outposts, which are typically lower security.", "metadata": {"entity_name": "Type-7 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-7 Transporter is a viable exploration ship with ranges around 30 LY, capable of long-range jumps and deliveries or Rare Commodities trading. However, it struggles with heat control, which can be mitigated by installing an A-rated Power Plant and multiple Heatsink Launchers.", "metadata": {"entity_name": "Type-7 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-7 Transporter is an adequate miner, perhaps as an intermediate step between smaller ships and larger ones like the Python, Anaconda, Type-9 Heavy, or Imperial Cutter. It lacks Class 2 hardpoints, so it is only suited to laser mining.", "metadata": {"entity_name": "Type-7 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-7 Transporter possesses four Class 1 hardpoints and four utility mounts. Two hardpoints are located on the front face of the ship, one on the topside, and one on the underside. The cockpit is mounted low on the front face, requiring careful navigation through access corridors.", "metadata": {"entity_name": "Type-7 Transporter", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Type-7 Transporter has a hull mass of 350 t, armor rating of 612, armor hardness of 54, shields of 99 MJ, heat capacity of 226, and fuel capacity of 32 t. It has a top speed of 182 m/s (default) or 209 m/s (upgraded), boost speed of 304 m/s (default) or 348 m/s (upgraded), and an unladen jump range of 12.27 ly (default) or 29.75 ly (upgraded).", "metadata": {"entity_name": "Type-7 Transporter", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Type-7 Transporter has a cargo capacity of 128 t (default) or 306 t (max). It features 4x Utility Mounts and 4x Small Hardpoints. Internal compartments include 1x Class 1, 1x Class 2, 2x Class 3, 3x Class 5, and 3x Class 6 compartments.", "metadata": {"entity_name": "Type-7 Transporter", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Type-7 Transporter's default outfitting includes Pulse Lasers (L) on two small hardpoints, with the other two being empty. All utility mounts are empty. The default systems include Lightweight Alloy bulkhead, Power Plant, Thrusters, Frame Shift Drive, Life Support, Power Distributor, and Sensors.", "metadata": {"entity_name": "Type-7 Transporter", "document_type": "ship", "chunk_type": "outfitting"}}