{"text": "The Mandalay is an explorer ship manufactured by Zorgon Peterson, produced from 3310 to the present. It costs 17,639,220 CR with an insurance value of 881,961 CR. The ship is 49.6m x 74.4m x 14.9m in size, has a hull mass of 230 t, and can accommodate up to 2 pilots with multicrew capability. It features 414 armor with a hardness of 55, 268 MJ shields, and a heat capacity of 250. The Mandalay has a fuel capacity of 32 t, a maneuverability rating of 5, a top speed of 286 m/s (default) or 325 m/s (upgraded), a boost speed of 358 m/s (default) or 406 m/s (upgraded), and an unladen jump range of 31.10 ly (default) or 45.26 ly (upgraded). Its cargo capacity is 40 t (default) or 154 t (max).", "metadata": {"entity_name": "Mandalay", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Mandalay outperforms the Anaconda in terms of jump range and is optimized for SCO-capable frame shift drives. It has better fuel economy and ease of control compared to the Python Mk II and Type-8, with maneuverability comparable to the Diamondback Explorer. The ship's boarding ramp is under the cockpit, aiding in exobiological scanning, and the cockpit floor is transparent for a clear view of planetary terrain. The Mandalay's design is influenced by the English Electric Lightning interceptor aircraft from 1960 and is named after a species of spitting cobra native to Myanmar.", "metadata": {"entity_name": "Mandalay", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Mandalay has 4x Utility Mounts, 2x Small Hardpoints, and 4x Medium Hardpoints. Its internal compartments include 3x Class 1, 1x Class 2, 2x Class 3, 2x Class 4, 1x Class 5, and 1x Class 6. The ship's default outfitting includes Lightweight Alloys (Bulkhead, Class 1), Power Plant (Reactor Bay, Class 5), Thrusters (Class 5), Frame Shift Drive (SCO) (Class 5), Life Support (Environment Control, Class 4), Power Distributor (Class 5), Sensors (Class 5), Fuel Tank (Class 5), Cargo Rack [x32] (Class 5), Shield Generator (Class 5), Cargo Rack [x8] (Class 3), Supercruise Assist (Class 1), and (PAS) (Class 1).", "metadata": {"entity_name": "Mandalay", "document_type": "ship", "chunk_type": "outfitting"}}