{"text": "The Anaconda is a multirole ship manufactured by Faulcon DeLacy, produced from 2856 to the present. It is known for its eight weapon hardpoints and ability to equip Class 4 weaponry. The ship is highly customizable and excels in various roles, including combat, exploration, and trading.", "metadata": {"entity_name": "Anaconda", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Anaconda has dimensions of 155m x 62m x 32m and can accommodate 3-4 pilots. It features a large landing pad size and has a hull mass of 400 tons. The ship's armor rating is 945 with an armor hardness of 65, and it has shields of 362 MJ. Its heat capacity is 334, and it has a fuel capacity of 32 tons. The Anaconda's top speed is 183 m/s (default) or 209 m/s (upgraded), with a boost speed of 244 m/s (default) or 279 m/s (upgraded). Its unladen jump range is 9.41 ly (default) or 41.45 ly (upgraded), and its cargo capacity is 114 t (default) or 470 t (max).", "metadata": {"entity_name": "Anaconda", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Anaconda features 8 utility mounts, 2 small hardpoints, 2 medium hardpoints, 3 large hardpoints, and 1 huge hardpoint. It also has various internal compartments, including 1 Class 1, 1 Class 2, 3 Class 4, 3 Class 5, 3 Class 6, and 1 Class 7 compartments, with 1 Class 5 military compartment reserved.", "metadata": {"entity_name": "Anaconda", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Anaconda's default outfitting includes Pulse Lasers (Class 1, Rating F) on its small hardpoints. The medium and large hardpoints are initially empty but can be upgraded to Class 2 and Class 3, respectively. The utility mounts are also initially empty but can be upgraded to Class 0. The ship's bulkhead is equipped with Lightweight Alloys (Class 1, Rating I), and it has a Power Plant (Class 8, Rating E) in the reactor bay. The thrusters are rated E (Class 7), and the Frame Shift Drive is rated E (Class 6). The environment control system is rated E (Class 5), and the power coupling is rated E (Class 8). The sensor suite is rated E (Class 8), and the fuel store is rated C (Class 5). The internal compartments include various cargo racks, a shield generator, and other empty compartments that can be upgraded.", "metadata": {"entity_name": "Anaconda", "document_type": "ship", "chunk_type": "outfitting"}}