{"text": "The Cobra Mk V is a multirole ship manufactured by Faulcon DeLacy, produced from 3310 to the present. It is priced at 1,989,461 CR with an insurance cost of 99,473 CR. The ship features a redesigned cockpit with a central pilot seat and two multicrew seats on either side, offering great visibility through large windows and a wide, transparent floor. It excels in trading, mining, and combat roles, with exceptional cargo capacity and a versatile hardpoint arrangement. In combat, it outperforms its predecessors but is generally outclassed by the Vulture. As an explorer, it has a well-above-average jump range and is highly customizable. The Cobra Mk V was unveiled during Frontier Unlocked in October 2024, with more details and in-game footage revealed in November 2024. Early access for ARX began on December 12, 2024.", "metadata": {"entity_name": "Cobra Mk V", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Cobra Mk V has dimensions of 41.2m x 55.1m x 9.47m and a hull mass of 150 tonnes. It features 3 pilot seats, including multicrew capabilities, and has a mass lock factor of 8. The ship's armour rating is 324 with an armour hardness of 40, and it has shields of 235 MJ. Its heat capacity is 245, and it has a fuel capacity of 16 tonnes. The Cobra Mk V has a manoeuvrability rating of 5, with a top speed of 294 m/s (default) or 336 m/s (upgraded), and a boost speed of 415 m/s (default) or 476 m/s (upgraded). Its unladen jump range is 16.79 ly (default) or 34.55 ly (upgraded), and it has a cargo capacity of 12 tonnes (default) or 110 tonnes (max).", "metadata": {"entity_name": "Cobra Mk V", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Cobra Mk V has a total of 4 utility mounts, 2 small hardpoints, and 3 medium hardpoints. It also features a variety of internal compartments, including 1 Class 1, 1 Class 2, 3 Class 3, 3 Class 4, and 1 Class 5 compartments. The default outfitting includes a Pulse Laser (Class 1, Rating F) on both small hardpoints, while the medium hardpoints are initially empty but can be upgraded to Class 2. The bulkhead is equipped with Lightweight Alloys (Class 1, Rating I), and the reactor bay, thrusters mounting, and frame shift drive housing all feature default systems rated E and Class 4. The environment control and sensor suite are also rated E and Class 3. The fuel store is rated C and Class 4. Internal compartments include a Shield Generator (Class 4, Rating C), Cargo Racks, an Advanced Docking Computer, Supercruise Assist, and a PAS (Class 1, Rating I).", "metadata": {"entity_name": "Cobra Mk V", "document_type": "ship", "chunk_type": "outfitting"}}