{"text": "The Federal Dropship is a combat and multirole ship manufactured by Core Dynamics, produced from 3300 to the present. It is available for purchase at stations controlled by minor factions aligned with the Federation, with systems controlled by Federal President Zachary Hudson guaranteed to have it on hand. The Dropship shares its body shape and design with the Federal Assault Ship and Federal Gunship, making them difficult to distinguish at a glance. It is the cheapest of the three and has the lowest Federal Navy rank requirement.", "metadata": {"entity_name": "Federal Dropship", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Federal Dropship is a very good combat vessel, featuring one Class 3 hardpoint and four Class 2 hardpoints. It has above-average armor and two Military Compartments, giving it additional bulk. However, it suffers from weak shielding and poor mobility, making it difficult to use against nimble ships like the Vulture. It is a respectable ship for both Bounty Hunters and Pirates, but more likely to be used as a stepping stone to a stronger vessel.", "metadata": {"entity_name": "Federal Dropship", "document_type": "ship", "chunk_type": "combat"}}
{"text": "As a trader, the Federal Dropship has 164T of cargo space, which is very good for a medium ship and the fifth best among all non-large ships. Combined with its impressive defense and ability to dodge interdictions, it can be a very appealing trade ship. However, its very low jump range, especially when fully laden, may limit trade options.", "metadata": {"entity_name": "Federal Dropship", "document_type": "ship", "chunk_type": "trading"}}
{"text": "As an explorer, the Federal Dropship is notorious as one of the worst ships in the role, with a poor jump range of 19.66 LY or so, the second lowest in the game. It is a subpar and cumbersome choice as an exploration vessel, even after engineering.", "metadata": {"entity_name": "Federal Dropship", "document_type": "ship", "chunk_type": "exploration"}}
{"text": "The Federal Dropship is an excellent miner, with four medium hardpoints for one of each mining tool, while retaining a large hardpoint for self-defense. Its small size, great cargo space, and good defenses make it a fantastic miner. Its only downsides are the lack of a Fighter Hangar and its limited jump range, which can make reaching specific mining zones a chore.", "metadata": {"entity_name": "Federal Dropship", "document_type": "ship", "chunk_type": "mining"}}
{"text": "The weapon hardpoints of the Federal Dropship are located as follows: two side-mounted Class 2 hardpoints in front of the lower wings, two underside Class 2 hardpoints located slightly behind the point at which the front fuselage tapering ends, and one underside Class 3 hardpoint beneath the nose of the ship and slightly forward of the front fuselage tapering. Although all hardpoints have good to excellent fields of fire when fitted with turrets, the side-mounted hardpoints benefit the most from turrets.", "metadata": {"entity_name": "Federal Dropship", "document_type": "ship", "chunk_type": "hardpoints"}}
{"text": "The Federal Dropship has the following specifications: dimensions of 73.9m x 52.3m x 21.7m, a hull mass of 580 t, armor of 540 with a hardness of 60, shields of 104 MJ, heat capacity of 331, fuel capacity of 16 t, manoeuvrability of 3, top speed of 182 m/s (default) or 209 m/s (upgraded), boost speed of 304 m/s (default) or 348 m/s (upgraded), unladen jump range of 7.25 ly (default) or 19.66 ly (upgraded), and cargo capacity of 56 t (default) or 166 t (max).", "metadata": {"entity_name": "Federal Dropship", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Federal Dropship has the following outfitting: 4x Utility Mounts, 4x Medium Hardpoints, 1x Large Hardpoint, 1x Class 1 Compartment, 1x Class 2 Compartment, 2x Class 3 Compartments, 1x Class 4 Compartment, 2x Class 5 Compartments, 1x Class 6 Compartment, and 2x Class 4 Military Compartments.", "metadata": {"entity_name": "Federal Dropship", "document_type": "ship", "chunk_type": "outfitting"}}
{"text": "The Federal Dropship's default loadout includes Pulse Laser (L) systems with a default rating of F and a default class of 1 for two of the medium hardpoints, and empty slots for the other two medium hardpoints. The large hardpoint is also empty. The utility mounts are all empty, and the bulkhead is fitted with Lightweight Alloys with a default rating of I and a default class of 1.", "metadata": {"entity_name": "Federal Dropship", "document_type": "ship", "chunk_type": "default_loadout"}}