{"text": "The Python is a multirole ship manufactured by Faulcon DeLacy, produced from 2700 to the present. It is considered the most effective balance between firepower, maneuverability, and protection among all ships. The Python can serve as a heavily armed freighter, carrying up to 292 tons of cargo, and is excellent for Community Goals due to its large cargo capacity and medium landing pad size. In combat, it is more than capable of putting down most other ships, including larger ones like Anacondas and Imperial Cutters, thanks to its 5 hardpoints and high mass lock factor of 17. However, its maneuverability is a weakness, making it less effective against smaller, more agile ships. The Python can also serve as a competent explorer, with a well-balanced array of optional internal slots for exploration equipment and weapons for deterring pirates.", "metadata": {"entity_name": "Python", "document_type": "ship", "chunk_type": "overview"}}
{"text": "The Python has a hull mass of 350 tons, armor rating of 468 with a hardness of 65, shields of 294 MJ, and a heat capacity of 300. It has a fuel capacity of 32 tons and a cargo capacity of up to 294 tons. The ship's top speed is 234 m/s (default) or 267 m/s (upgraded), with a boost speed of 305 m/s (default) or 348 m/s (upgraded). Its unladen jump range is 8.23 ly (default) or 30.45 ly (upgraded). The Python has 2 pilot seats, supports multicrew, and has a medium landing pad size with dimensions of 87.9m x 58.1m x 18.0m.", "metadata": {"entity_name": "Python", "document_type": "ship", "chunk_type": "specifications"}}
{"text": "The Python's hardpoints include 4 utility mounts, 2 medium hardpoints, and 3 large hardpoints. The default loadout includes Pulse Lasers (Class 1, Rating F) on the medium hardpoints, and empty large hardpoints. The ship's internal compartments include 1 Class 1, 1 Class 2, 2 Class 3, 1 Class 4, 2 Class 5, and 3 Class 6 compartments. The default internal systems include Cargo Racks, a Shield Generator, and a Supercruise Assist.", "metadata": {"entity_name": "Python", "document_type": "ship", "chunk_type": "outfitting"}}